{"week": 1, "emotion": {"stamina": 95, "knowledge": 15, "stress": 90, "happy": 20, "sleep": 95, "social": 30}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "Ugh, this week felt like a blur, honestly. It’s Sunday night now, and I’m already feeling that familiar knot in my stomach thinking about everything that’s coming up. I mean, I *know* I’ve been getting good sleep, and my stamina feels fine, which is great, but it’s like my brain just can’t keep up with everything else.\n\nAcademically, I’m really starting to worry about COSC 065. I saw the summary said \"no class experience recorded,\" and yeah, that’s pretty accurate. I had classes scheduled for Monday, Wednesday, Thursday, and Friday, all at lsb, but I just… wasn't there. I don't know what happened. I was at Sphinx a lot, and then Reed Hall at weird hours, but not lsb. It’s like I just completely lost track, or maybe I just couldn't bring myself to go. It’s such a bad habit, and now I’m so far behind. The thought of catching up is just overwhelming, especially with *so many* deadlines looming for Monday and Tuesday. It’s like a wall of assignments, and I haven’t even started on most of them. I feel this intense pressure, and it just makes me want to curl up and disappear.\n\nOutside of classes, I’ve been spending a lot of time at the Sphinx Secret Society building. Sometimes I’m doing things there, sometimes I’m just… there. It’s a comfortable place, I guess. And my pottery studio trips to Vermont have been a consistent thing, which is nice. It’s a good escape, a place where I can actually focus on something tangible and not feel like my brain is constantly buzzing with anxieties. I also managed to get to the Boathouse a few times, and the gym. It feels good to move, to just push myself physically when my mind feels so stuck. I guess that’s why my stamina is still high, even if my mental state feels a bit fragile.\n\nSocially, I feel a bit disconnected. I’m around people, especially at Sphinx, but it’s not always deep connection, you know? It’s more like just existing in the same space. I probably need to make more of an effort to actually *talk* to people, but when I’m this stressed about academics, it’s hard to put myself out there.\n\nThe biggest challenge, by far, is getting back on track with COSC 065. It’s not just the missed classes, it’s the feeling of falling behind and the sheer volume of work that needs to be done. I feel this immense guilt, and it just spirals into more anxiety.\n\nFor next week, my goals are pretty clear, even if they feel daunting:\n1.  **Attend COSC 065 classes.** No excuses. I need to be there, even if I feel lost. Just showing up is the first step.\n2.  **Tackle those Monday and Tuesday deadlines.** I need to break them down into smaller, manageable chunks. Maybe I can find someone in class to ask for help, even though that thought makes me a bit nervous.\n3.  **Prioritize academic work over other activities.** As much as I love pottery and the boathouse, I need to put my studies first right now.\n4.  **Try to reach out to someone.** Maybe a classmate, or even just a friend, to talk about how overwhelmed I’m feeling. Keeping it all inside isn't helping.\n\nI just hope I can actually follow through. The thought of another week like this is… a lot.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"my stamina feels fine, which is great\" and \"my stamina is still high,\" indicating good physical energy despite mental struggles.\n- **Knowledge:** The student expresses significant concern about COSC 065, noting \"no class experience recorded,\" being \"so far behind,\" and having \"haven’t even started on most of them\" for looming deadlines, indicating a very low grasp of current academic material.\n- **Stress:** The journal is filled with indicators of high stress: \"familiar knot in my stomach,\" feeling \"overwhelming,\" \"intense pressure,\" wanting to \"curl up and disappear,\" and \"brain is constantly buzzing with anxieties,\" along with \"immense guilt\" and spiraling anxiety.\n- **Happy:** The overall tone is negative, marked by \"Ugh, this week felt like a blur\" and a desire to \"curl up and disappear.\" While pottery and physical activity provide \"a good escape\" and \"feel good,\" they are presented as relief from anxiety rather than sources of genuine happiness, keeping this value low.\n- **Sleep:** The student clearly states, \"I *know* I’ve been getting good sleep,\" indicating this area is not a concern.\n- **Social:** The student feels \"a bit disconnected,\" noting that being \"around people...is not always deep connection,\" and that it's \"hard to put myself out there\" due to stress, suggesting a low level of meaningful social engagement."}
{"week": 2, "emotion": {"stamina": 95, "knowledge": 85, "stress": 95, "happy": 5, "sleep": 90, "social": 15}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 9, "total_questions": 10, "week": 2}, "weekly_desc": "Ugh, this week. It’s just… a lot. I feel this constant knot in my stomach, like I’m forgetting something crucial or letting someone down. My happiness is just so low right now, and it’s hard to shake off this feeling of dread, even when I’m trying to relax.\n\nAcademically, I really messed up. COSC 065. I know I had classes scheduled, but I just… didn't make it. Every time Monday, Wednesday, Thursday, and Friday rolled around, I had every intention of going to lsb, but then I found myself elsewhere. On Wednesday and Friday mornings, I was at Sphinx, and Thursday I was at the gym. Monday, same thing, back at Sphinx. It’s not like I don’t *know* the material, I actually feel pretty good about my understanding of things, but showing up is a whole other battle. And now, looking at all these deadlines piling up for Monday, Tuesday, and Wednesday, it’s just making my anxiety spike even higher. I *need* to get on top of this. It’s not fair to myself, or to the professors, to just skip out.\n\nOutside of classes, my week was a blur of activity, but not necessarily the kind that makes me feel connected. The boathouse was my constant. I was there almost every day, sometimes multiple times a day, just pushing myself. It’s exhausting, but it’s also the one place where I feel like I’m actually *doing* something productive and physical. My stamina is high, so at least I'm not physically drained from that, but mentally, it's a lot.\n\nThen there’s Sphinx. I spent so much time there, especially late into the night. It feels like a second home, but even with all that time, my social battery still feels low. I’m around people, but I don’t always feel *with* them, if that makes sense. It’s weird. And then, Friday night, I actually made it out to the pottery studio. That was a nice escape, just getting my hands dirty and focusing on something completely different. It’s off-campus, which is a bit of a trek, but it’s a good way to clear my head, even if it’s just for a few hours.\n\nThe biggest challenge this week was definitely my inability to get to COSC 065. It’s a pattern I need to break. I feel so overwhelmed by everything, and it just makes me want to retreat, even though I know that’s not helping. My sleep has been good, which is a blessing, but it doesn't seem to be translating into feeling rested or less anxious during the day.\n\nFor next week, my goals are pretty clear, even if they feel daunting. First, I *have* to prioritize those deadlines. I need to break them down and tackle them one by one, instead of letting them loom over me. Second, I need to figure out how to actually get to my COSC 065 classes. Maybe I need to set alarms, or find a study buddy to walk with. I need to be more intentional about my academic commitments. And finally, I need to find a way to manage this constant feeling of being on edge. Maybe spending less time at Sphinx and more time just… being quiet, or doing something that genuinely recharges me, like pottery, could help. I just want to feel a little less overwhelmed and a little more in control.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 95 because the student explicitly states, \"My stamina is high,\" and mentions being at the boathouse \"almost every day, sometimes multiple times a day, just pushing myself,\" indicating high physical endurance.\n- **Knowledge:** 85 because despite skipping classes, the student states, \"It’s not like I don’t *know* the material, I actually feel pretty good about my understanding of things,\" indicating a strong grasp of the subject matter.\n- **Stress:** 95 because the student describes a \"constant knot in my stomach,\" \"feeling of dread,\" and that \"deadlines piling up... is just making my anxiety spike even higher.\" They also feel \"so overwhelmed by everything\" and have a \"constant feeling of being on edge.\"\n- **Happy:** 5 because the student explicitly states, \"My happiness is just so low right now,\" and finds it \"hard to shake off this feeling of dread.\"\n- **Sleep:** 90 because the student reports, \"My sleep has been good, which is a blessing,\" indicating sufficient and quality rest.\n- **Social:** 15 because despite being \"around people\" at Sphinx, the student feels their \"social battery still feels low\" and that they \"don’t always feel *with* them,\" indicating a lack of meaningful social connection or energy for it."}
{"week": 3, "emotion": {"stamina": 90, "knowledge": 90, "stress": 98, "happy": 5, "sleep": 90, "social": 8}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 9, "total_questions": 10, "week": 3}, "weekly_desc": "This week felt… heavy. Like there’s this constant hum of anxiety just under the surface, even when I’m trying to ignore it. My happiness score being so low really tracks, honestly. It’s hard to shake this feeling of dread, even though I’m getting a decent amount of sleep and my stamina is somehow still high. It’s like my body is fine, but my brain is just… not.\n\nThe biggest thing, and it’s hard to even write this down, is COSC 065. I just… didn’t go. Not once. I saw the schedule, I know when it was supposed to be, but every time, I just found myself somewhere else. Wednesday, Thursday, Friday, Monday – all those class times, and I was either still in my dorm or, more often, at the Sphinx Secret Society. I don’t even know why I keep ending up there. It’s like a magnet, pulling me in, and then hours just disappear. It’s not even like I’m doing anything productive there, just… existing. And now I have zero class experience recorded, which is just another thing to worry about. How am I going to catch up?\n\nAnd the deadlines. Oh god, the deadlines. Seven of them, all piling up for Monday and Tuesday. It’s like a wall of assignments I haven’t even properly looked at because I’ve been so caught up in… well, I don’t even know what. The thought of them just makes my stomach clench. I know I have the knowledge, my scores are high, but actually *doing* the work feels impossible right now.\n\nMy social life is basically non-existent, which isn’t helping. That 15 score is probably generous. I’m spending so much time at the Sphinx, but it’s not really *social* in a meaningful way. It’s more like a void I fall into. I did manage to get out a few times – saw a movie at the Nugget, went to the Black Family Visual Arts Center, and even the Leverone Field House. And the pottery studio! That’s been a weird escape. It’s so far off campus, but there’s something about working with my hands that just… quiets things down for a bit. I was there late a few nights, just trying to clear my head. And the boathouse, too. I guess I’m just trying to find places to be that aren’t my dorm or the library, but also aren’t class.\n\nIt’s a mess. I feel so overwhelmed and guilty about missing class, especially with all these deadlines looming. I know I need to get it together. For next week, my absolute top priority has to be COSC 065. I *have* to go. I need to figure out what I missed and start chipping away at those assignments. And maybe, just maybe, try to actually talk to someone, anyone, outside of the Sphinx. This feeling of being stuck is just getting to me.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student explicitly states, \"my stamina is somehow still high\" and \"It’s like my body is fine.\" They also describe being physically active, visiting various locations like the pottery studio (late nights, far off campus) and the boathouse, indicating good physical energy.\n-   **Knowledge**: The student confidently asserts, \"I know I have the knowledge, my scores are high,\" indicating a strong grasp of academic material despite current difficulties.\n-   **Stress**: This is extremely high due to multiple indicators: \"constant hum of anxiety,\" \"hard to shake this feeling of dread,\" \"another thing to worry about\" (missing class), \"Oh god, the deadlines. Seven of them, all piling up,\" \"The thought of them just makes my stomach clench,\" and feeling \"so overwhelmed and guilty.\"\n-   **Happy**: The student directly confirms, \"My happiness score being so low really tracks, honestly,\" and describes a \"feeling of dread\" and that their \"brain is just… not\" fine, reinforcing a very low emotional state.\n-   **Sleep**: The student states they are \"getting a decent amount of sleep,\" suggesting this area is not a primary concern and is relatively stable.\n-   **Social**: The student declares, \"My social life is basically non-existent,\" and believes the previous \"15 score is probably generous.\" They also describe time at the Sphinx as \"not really *social* in a meaningful way. It’s more like a void I fall into,\" indicating a severe lack of fulfilling social interaction."}
{"week": 4, "emotion": {"stamina": 15, "knowledge": 85, "stress": 98, "happy": 5, "sleep": 85, "social": 8}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Activities & Intents", "correct_answers": 10, "total_questions": 10, "week": 4}, "weekly_desc": "This week felt like a blur, honestly. It’s hard to even pinpoint where the days went. My head just feels… heavy.\n\nCOSC 065 is really starting to get to me. I know I *should* be there, but every time the class rolls around, I just can't bring myself to go. Wednesday, Thursday, Friday, Monday – I missed them all. It’s not like I don’t *want* to learn, it’s just this overwhelming feeling that I’m already so far behind, and then the anxiety just paralyzes me. And now, looking at all those deadlines for Monday and Tuesday, it’s just a massive knot in my stomach. How am I going to catch up on three assignments for Monday and two for Tuesday when I haven't even been to class? I feel so incredibly guilty about it.\n\nI spent a lot of time in my dorm, Topliff, just kind of existing. It’s weird, I’m sleeping a lot, which is good for my stamina I guess, but I still feel so drained. I know I’m not really connecting with people. My social score is practically zero, and it shows. I’d be at the Sphinx Secret Society sometimes, but it wasn't really *social* social, more just being in the same space as others without really engaging. It’s hard to put myself out there when I feel this way.\n\nThe Boathouse was a bit of a reprieve. Getting out on the water, even just for a bit, helps clear my head. It’s one of the few times I feel a little less anxious, a brief moment of calm. And I did make it to the library a couple of times, and Fairchild, trying to get some work done for other classes, but it felt like I was just going through the motions.\n\nMy biggest escape, though, has been the pottery studio. It’s off-campus, which is probably why I like it so much. It’s a completely different world, and when I’m there, I can just focus on my hands and the clay. It’s messy and tactile and it just… quiets my brain for a bit. I was there pretty late a few nights, and it felt good to actually *do* something creative, something that wasn't tied to grades or deadlines. But then I come back to campus, and the deadlines are still there, staring at me.\n\nI feel so incredibly unhappy right now. My happiness is at a 5, and honestly, it feels lower. The stress is just constant, a dull ache in my chest. I know I’m knowledgeable, I know I *can* do this, but the pressure just builds and builds until I can’t move. It’s a vicious cycle.\n\nMy biggest challenge this week was definitely the COSC 065 classes and the mounting pile of work. I just couldn't break through the mental block.\n\nFor next week, my absolute top priority has to be COSC 065. I *have* to go to class. I need to figure out what I missed and somehow, miraculously, get those assignments done. I also need to try and be more intentional about my time. Maybe I can still go to the pottery studio, but not let it completely derail my academic responsibilities. And maybe, just maybe, I can try to talk to someone, even briefly. Just a small step to feel a little less isolated. I just need to get through these deadlines first.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"My head just feels… heavy,\" and \"I still feel so drained,\" despite sleeping a lot. They also mention \"just kind of existing\" and \"going through the motions,\" indicating very low energy and motivation.\n- **Knowledge**: The student asserts, \"I know I’m knowledgeable, I know I *can* do this.\" This indicates a strong underlying academic capability and self-awareness of their knowledge base, even if stress is preventing them from applying it effectively or attending classes.\n- **Stress**: This is a dominant theme. The student describes an \"overwhelming feeling,\" \"anxiety just paralyzes me,\" a \"massive knot in my stomach,\" and that \"the stress is just constant, a dull ache in my chest.\" They also mention the \"pressure just builds and builds until I can’t move\" and \"couldn't break through the mental block.\"\n- **Happy**: The student directly states, \"I feel so incredibly unhappy right now. My happiness is at a 5, and honestly, it feels lower.\" This provides a clear and low self-assessment of their happiness.\n- **Sleep**: The student mentions, \"I’m sleeping a lot, which is good for my stamina I guess.\" This indicates a high quantity of sleep, even if it's not fully restorative for their stamina.\n- **Social**: The student explicitly states, \"I know I’m not really connecting with people. My social score is practically zero, and it shows.\" They also describe being in the same space as others but \"without really engaging,\" and finding it \"hard to put myself out there.\""}
{"week": 5, "emotion": {"stamina": 5, "knowledge": 85, "stress": 95, "happy": 10, "sleep": 30, "social": 5}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 8, "total_questions": 10, "week": 5}, "weekly_desc": "Ugh, another week gone. It feels like I’m constantly running on fumes, even though the sleep tracker says I’m getting enough. My body just doesn't agree. Stamina is practically non-existent, and honestly, my happiness levels are just… a flatline. It’s this constant hum of anxiety, you know? Like a low-grade fever that just won't break.\n\nClasses this week were a total bust. COSC 065? Yeah, I didn't make it to a single one. Monday, Wednesday, Thursday, Friday – all missed. It’s just this knot in my stomach thinking about it. I *know* I should have been there. I keep telling myself I'll catch up, but then the day comes, and I just can't seem to drag myself out of Topliff or wherever I've ended up. It’s not like I don’t understand the material; my knowledge levels are fine, but actually *being* there, participating… it just feels impossible sometimes.\n\nInstead, I spent way too much time at the Boathouse. It’s weird, sometimes it feels like the only place I can really breathe, even when I’m pushing myself. And the pottery studio in Vermont? That’s my escape. I was there late into the night, multiple times. It’s a long drive, but once I’m there, with the clay in my hands, everything else just… fades. It’s probably not the most efficient use of my time, especially with all these deadlines looming, but it’s the only thing that feels genuinely good right now.\n\nSpeaking of deadlines, the sheer number of them for Monday, Tuesday, and Wednesday next week is just suffocating. I tried to get some work done in Reed Hall super late on Thursday and Friday, and then actually made it to Sudikoff on Tuesday afternoon and evening. That felt like a small victory, actually being in the CS building and doing something productive. But it’s still not enough. I feel so behind, and the thought of all those assignments just makes me want to curl up and disappear.\n\nAnd social life? What social life? My social score is abysmal. I’m around people, sure, especially at the Sphinx Secret Society – I spend a ridiculous amount of time there, often at really odd hours. But it’s not really *social* in the way that makes you feel connected. It’s more like just… existing in the same space. I don’t know. I feel pretty isolated, even when I’m not alone.\n\nThis week was a mess. I’m tired of feeling this way, tired of the constant worry.\n\nNext week, I *have* to get it together.\n1.  **Attend COSC 065.** Seriously. No excuses. I need to be in those classes.\n2.  **Prioritize the deadlines.** I need to break them down and tackle them one by one, instead of letting them overwhelm me. Maybe less late-night pottery, at least until the major assignments are done.\n3.  **Find a better balance.** The Boathouse and pottery are important for my mental health, but they can’t come at the expense of everything else. I need to figure out how to fit them in without completely derailing my academics.\n4.  **Try to connect.** Even just a quick chat with someone, anyone. My social battery is dead, but maybe a tiny spark could help.\n\nI just need to get through this. One step at a time.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student explicitly states \"Stamina is practically non-existent\" and feels \"constantly running on fumes,\" indicating extreme fatigue and very low physical energy.\n-   **Knowledge**: The student directly states, \"It’s not like I don’t understand the material; my knowledge levels are fine,\" indicating a good grasp of the subject matter.\n-   **Stress**: The student describes a \"constant hum of anxiety,\" feeling \"suffocating\" due to deadlines, and wanting to \"curl up and disappear,\" indicating very high and overwhelming stress levels.\n-   **Happy**: The student explicitly states, \"my happiness levels are just… a flatline\" and expresses being \"tired of feeling this way,\" indicating very low overall happiness.\n-   **Sleep**: Although the \"sleep tracker says I’m getting enough,\" the student immediately counters with \"My body just doesn't agree\" and feels \"constantly running on fumes,\" suggesting the sleep is not restorative or effective, despite the quantity.\n-   **Social**: The student states, \"My social score is abysmal\" and feels \"pretty isolated, even when I’m not alone,\" indicating a very low sense of social connection and engagement."}
{"week": 6, "emotion": {"stamina": 5, "knowledge": 85, "stress": 95, "happy": 10, "sleep": 20, "social": 5}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 9, "total_questions": 10, "week": 6}, "weekly_desc": "This week felt like a complete mess, honestly. I'm just so utterly exhausted, physically and mentally. My happiness is practically non-existent, and I feel like I'm running on fumes. The sleep situation is just getting worse and worse, and I know it's impacting absolutely everything else.\n\nI really messed up with COSC 065 this week. I didn't make it to a single lecture. Every time the alarm went off, or I knew I should be heading out, it just felt impossible to get out of bed, or even out of my dorm. It's not like I don't care about the class – I actually feel like I understand the material pretty well when I do get around to it, which is weird. I spent some time in Sudikoff, trying to catch up on my own, but it's just not the same as being there. The thought of all those deadlines piling up for Monday and Tuesday just makes my stomach clench. It's like a constant knot of anxiety that never loosens.\n\nI guess I've been trying to find ways to cope, but I'm not sure they're actually helping. I ended up at the Boathouse a lot, just needing to clear my head, even if it was super late or ridiculously early. And the pottery studio… I know it’s a trek, and it eats up so much time, especially late at night, but it’s the only place where my brain feels quiet for a bit. It’s a strange escape, but I just need something to take my mind off everything. I know it's probably why my sleep is so bad, but I just can't seem to stop going.\n\nSocially, I feel like I'm completely isolated. My social battery is at zero. Even when I'm in places like the Sphinx Secret Society, I'm just... there. Not really connecting with anyone. It feels like everyone else has it together, and I'm just barely keeping my head above water.\n\nThe biggest challenge right now is just the sheer weight of everything. The missed classes, the lack of sleep, the constant worry about assignments. My stamina is shot. I feel like I'm always tired, always on edge.\n\nFor next week, I *have* to do better. My main goal is to actually attend COSC 065. I need to break this cycle of missing class. I also desperately need to prioritize sleep. I know it sounds simple, but it feels monumental right now. I need to figure out a way to manage these deadlines without completely burning out. Maybe I can try to get some work done earlier in the day, so I'm not up so late. And maybe, just maybe, I can try to connect with someone, even just for a few minutes. I know I'm not great at it, but feeling this alone isn't helping. I just need to get through this.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"I'm just so utterly exhausted, physically and mentally,\" \"I feel like I'm running on fumes,\" and \"My stamina is shot.\" This indicates extremely low physical and mental energy.\n- **Knowledge**: Despite missing classes, the student mentions, \"I actually feel like I understand the material pretty well when I do get around to it, which is weird.\" This suggests their perceived understanding of the material is still relatively high, even if their engagement is low.\n- **Stress**: The student describes \"The thought of all those deadlines piling up... just makes my stomach clench\" and \"It's like a constant knot of anxiety that never loosens.\" They also mention \"the constant worry about assignments\" and feeling \"always on edge,\" indicating very high stress levels.\n- **Happy**: The student directly states, \"My happiness is practically non-existent,\" which points to a very low emotional state.\n- **Sleep**: The student reports, \"The sleep situation is just getting worse and worse,\" and \"I know it's probably why my sleep is so bad.\" They also mention it's \"impossible to get out of bed,\" highlighting severe sleep deprivation and its impact.\n- **Social**: The student feels \"completely isolated,\" states \"My social battery is at zero,\" and notes that even in social settings like the Sphinx Secret Society, they are \"Not really connecting with anyone,\" indicating very low social engagement and satisfaction."}
{"week": 7, "emotion": {"stamina": 5, "knowledge": 80, "stress": 95, "happy": 10, "sleep": 5, "social": 5}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 10, "total_questions": 10, "week": 7}, "weekly_desc": "Ugh, this week felt like a blur, and not in a good way. I'm just so incredibly tired, like I haven't truly rested in days. My body feels heavy, and my brain just won't shut off. It's hard to even remember what day it is sometimes, everything just blends into this constant state of exhaustion. And honestly, I feel pretty isolated. It's like I'm moving through the world, but not really connecting with anyone.\n\nThe biggest thing weighing on me is COSC 065. I know I have classes for it, but I just… didn't make it. Not once. Every time the alarm went off, or I thought about getting ready, this wave of dread would just wash over me. It felt impossible to drag myself out of bed, or even out of my dorm, to face it. I know the material, I really do, but the thought of actually *being there* felt overwhelming. And now, looking at the upcoming deadlines, it's just a huge knot in my stomach. So many things due on Monday, then Tuesday, and Wednesday. How am I going to catch up when I can barely function?\n\nI spent a lot of time at the Boathouse this week. It's a place where I can just be, I guess. Sometimes I'd do something, sometimes I'd just sit there. It's a bit of an escape. But my real escape, the one place I feel like I can breathe, is the pottery studio. I was there so much, especially late at night. It's off campus, and it's just... quiet. I can lose myself in what I'm doing, and for a few hours, the anxiety just fades. But then I look at the clock, and it's 1 AM, 2 AM, even 3 AM, and I know I'm just digging myself deeper into this sleep deficit. I was even at Fairchild and Reed Hall super late, trying to get some work done when no one else was around. It feels like the only time I can focus, but it's clearly not sustainable.\n\nI know I need to get my act together. My sleep is practically non-existent, my stamina is shot, and I feel so disconnected from everyone. It's a vicious cycle. The more tired and anxious I get, the harder it is to do anything, and then I feel worse about not doing anything.\n\nNext week, I *have* to get to COSC 065. No matter how I feel, I need to be there. I also need to figure out a better way to manage these deadlines. Maybe break them down into smaller chunks, even if I'm just doing a little bit at a time. And I really, really need to prioritize sleep. That means cutting back on the late-night pottery sessions, even though it's the one thing that brings me some peace. I need to find a healthier balance, or I'm just going to burn out completely. Maybe I can try to connect with someone, even just for a quick chat. Anything to feel a little less alone.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"I'm just so incredibly tired, like I haven't truly rested in days,\" \"My body feels heavy,\" \"everything just blends into this constant state of exhaustion,\" and \"my stamina is shot.\" This indicates extremely low physical and mental energy.\n- **Knowledge**: The student confidently asserts, \"I know the material, I really do,\" regarding COSC 065, despite not attending class. This suggests a strong grasp of the subject matter itself.\n- **Stress**: The journal is filled with indicators of high stress: \"The biggest thing weighing on me is COSC 065,\" \"wave of dread,\" \"felt overwhelming,\" \"a huge knot in my stomach,\" \"So many things due,\" and the fear of \"burn out completely.\" The pottery studio is an \"escape\" where \"the anxiety just fades,\" implying high baseline anxiety.\n- **Happy**: The overall tone is negative (\"Ugh, this week felt like a blur, and not in a good way\"). While pottery offers \"peace\" and a place to \"breathe,\" it's described as an \"escape\" from overwhelming feelings, not a source of sustained happiness, and comes at the cost of sleep.\n- **Sleep**: The student states, \"I haven't truly rested in days,\" mentions being up until \"1 AM, 2 AM, even 3 AM,\" is \"digging myself deeper into this sleep deficit,\" and declares, \"My sleep is practically non-existent.\" This points to a severe lack of sleep.\n- **Social**: The student feels \"pretty isolated,\" is \"not really connecting with anyone,\" and feels \"disconnected from everyone,\" expressing a desire to \"try to connect with someone\" to feel \"a little less alone.\" This indicates very low social connection."}
{"week": 8, "emotion": {"stamina": 5, "knowledge": 20, "stress": 95, "happy": 5, "sleep": 5, "social": 10}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "Ugh, this week felt like a blur, and honestly, not in a good way. I'm just so tired, all the time. My head feels fuzzy, and it's hard to focus on anything. I know I'm not getting enough sleep, that's for sure. Waking up at 4 AM or even 1 AM some days, it's just not sustainable. I feel like I'm constantly running on fumes, and it's making everything feel so much harder.\n\nI really messed up with COSC 065 this week. I didn't make it to a single lecture. Not Wednesday, not Thursday, not Friday, and not even Monday. Every time it rolled around, I was either still in my dorm, or at Sphinx, or somewhere else entirely. It's this awful cycle where I feel too overwhelmed to go, then I feel even more anxious because I missed it, and then that anxiety makes it even harder to get myself to the next one. I know I need to be there, especially with all these deadlines piling up. There are so many things due on Monday and Tuesday, and another one on Wednesday. It's just a constant knot in my stomach.\n\nI spent a lot of time at Sphinx this week, and the Boathouse. I guess those are my go-to places when I'm trying to escape, or just exist without having to think too much. And the pottery studio in Vermont, that's my little escape, but it's so far, and it eats up so much time. I know I should be in Sudikoff or Fairchild, actually *doing* something productive, but it's like my brain just shuts down. I did make it to Fairchild a couple of times, and even the library once, but it felt more like I was just passing through than actually getting solid work done.\n\nMy social battery feels completely drained, even though I'm around people a lot. I'm physically present, but I don't feel like I'm really connecting with anyone. It's weird, I want to be more social, but then when I'm in a group, I just feel… detached. And my happiness levels are just in the gutter. I feel like I'm constantly on the verge of tears, or just completely numb.\n\nNext week, I *have* to get it together. My main goal is to actually attend COSC 065. All of them. I need to catch up on what I've missed, because the knowledge is there, but it's not translating into action. I also need to figure out a way to get more sleep. Maybe if I can just get a few solid nights, I'll feel less like a zombie. And I need to tackle those deadlines head-on instead of letting them loom over me. It's going to be tough, but I can't keep going like this. I just can't.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: 5, because the student explicitly states \"I'm just so tired, all the time,\" \"I feel like I'm constantly running on fumes,\" and \"my brain just shuts down,\" indicating profound exhaustion and lack of energy.\n-   **Knowledge**: 20, as the student \"didn't make it to a single lecture\" for COSC 065 and acknowledges they \"need to catch up on what I've missed,\" indicating a significant current deficit in course-specific knowledge, despite believing \"the knowledge is there\" (perhaps referring to foundational understanding).\n-   **Stress**: 95, due to feeling \"too overwhelmed,\" \"even more anxious\" about missed lectures, and having \"so many things due\" which is \"just a constant knot in my stomach,\" reflecting extreme and pervasive anxiety.\n-   **Happy**: 5, as the student states \"my happiness levels are just in the gutter\" and feels \"constantly on the verge of tears, or just completely numb,\" indicating a very low emotional state.\n-   **Sleep**: 5, because the student clearly states \"I know I'm not getting enough sleep,\" and describes waking up \"at 4 AM or even 1 AM some days,\" which is \"not sustainable,\" pointing to severe sleep deprivation.\n-   **Social**: 10, as the student's \"social battery feels completely drained,\" they \"don't feel like I'm really connecting with anyone,\" and feel \"detached\" even when physically present in social settings, indicating a lack of meaningful social engagement despite being around people."}
{"week": 9, "emotion": {"stamina": 35, "knowledge": 75, "stress": 95, "happy": 25, "sleep": 15, "social": 75}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "Ugh, another week gone. It feels like I'm constantly trying to catch my breath, and honestly, I'm not sure I'm succeeding. The stress is really starting to get to me, just a constant hum of anxiety in the background.\n\nAcademically, this week was... well, it wasn't great. I completely missed my COSC 065 classes on Wednesday and Thursday. I feel so bad about it. It's not like I don't understand the material, but actually getting myself there, especially when I'm feeling so overwhelmed, just feels impossible sometimes. And now, looking at the sheer number of deadlines piling up for next week – three on Monday, two on Tuesday, another on Wednesday – it's just making my stomach churn. How am I going to get all of that done when I'm already behind? The thought alone is enough to make me want to just pull the covers over my head.\n\nInstead of class, I ended up spending a lot of time just... around. A lot of it was at Topliff, just trying to exist, or at the Sphinx Secret Society. It's good to be around people, I guess, and my social battery feels pretty full, which is a relief. I also found myself down at the Boathouse a couple of times, which was nice, just to clear my head a bit. The highlight, though, was definitely getting off campus to that pottery studio on Wednesday night. It was such a weird, unexpected detour, but it was genuinely calming to just focus on something creative for a bit, away from everything. It's a strange contrast, feeling so creatively fulfilled in one moment and then immediately crashing back into the reality of all the academic pressure.\n\nI think my sleep schedule is completely out of whack too. I was up super late on Wednesday night, then active again really early on Thursday. It's probably not helping with the general feeling of being on edge. My stamina feels pretty neutral, but my brain definitely doesn't.\n\nThe biggest challenge right now is definitely the mountain of work ahead and the guilt of not having been more on top of things this week. It's a vicious cycle – the more stressed I get, the harder it is to focus, and then I get more behind, which just adds to the stress.\n\nFor next week, I *have* to get a grip. My main goal is to actually attend all my COSC 065 classes. No excuses. I also need to break down these assignments into smaller, manageable chunks and just start chipping away at them, even if it's just for an hour at a time. I need to prioritize getting a decent night's sleep too, because I know that's not helping my focus. And maybe, just maybe, I can find a way to channel some of that creative energy from the pottery studio into tackling these deadlines. I just need to find a way to breathe through the panic and actually *do* the work.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student states \"It feels like I'm constantly trying to catch my breath\" and mentions feeling \"so overwhelmed\" that getting to class \"just feels impossible sometimes,\" indicating low energy for daily tasks. While they say \"my stamina feels pretty neutral,\" they immediately follow with \"but my brain definitely doesn't,\" suggesting mental exhaustion, and the overall narrative of struggle points to a low functional stamina.\n- **Knowledge:** The student explicitly states, \"It's not like I don't understand the material,\" indicating a good grasp of the academic content, despite missing classes.\n- **Stress:** The student describes \"a constant hum of anxiety,\" feeling their \"stomach churn\" at the thought of deadlines, and wanting to \"pull the covers over my head.\" They also mention a \"vicious cycle\" where stress makes it harder to focus, leading to more stress, and needing to \"breathe through the panic,\" all pointing to extremely high stress levels.\n- **Happy:** The overall tone is negative, marked by \"Ugh, another week gone,\" feeling \"so bad\" and \"guilt.\" While there were positive moments like the \"pottery studio\" which was \"genuinely calming\" and \"creatively fulfilled,\" these were temporary and quickly followed by \"crashing back into the reality of all the academic pressure,\" indicating a low overall happiness level.\n- **Sleep:** The student directly states, \"I think my sleep schedule is completely out of whack too,\" and provides evidence by being \"up super late on Wednesday night, then active again really early on Thursday,\" indicating very poor sleep quality and consistency.\n- **Social:** The student explicitly states, \"my social battery feels pretty full,\" and mentions it's \"good to be around people,\" indicating positive and fulfilling social interactions."}
{"week": 10, "emotion": {"stamina": 10, "knowledge": 65, "stress": 98, "happy": 8, "sleep": 5, "social": 65}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 29.0, "full_text_response": "This is an exceptionally well-thought-out project idea, demonstrating a strong understanding of both the problem space and the technical requirements for a mobile application.\n\nHere's a breakdown of the evaluation:\n\n*   **Is the idea innovative or unique compared to existing apps?**\n    *   While task managers are a saturated market, ZenFlow's explicit and central focus on *mental well-being* and *stress reduction* through its design philosophy (calming UI, gentle nudges, micro-win celebrations) provides a clear and compelling differentiator. It's not just a task manager; it's a *supportive tool*. This niche focus makes it unique enough for a student project.\n*   **Does it clearly address a real problem or user need?**\n    *   Absolutely. The student articulates the problem of student overwhelm and the counter-intuitive stress caused by traditional task managers with clarity and personal resonance. This is a highly relatable and significant pain point for the target audience.\n*   **Is the idea technically feasible for implementation by a student team within one semester?**\n    *   Yes, the proposed core features (UI/UX, hierarchical task management, local notifications, simple animations, local data persistence) are all fundamental concepts covered in a typical smartphone programming course. The student has wisely avoided overly complex integrations or real-time systems, making it very achievable.\n*   **Is the scope appropriate (not too simple, not too ambitious)?**\n    *   The scope is perfectly balanced. It's more than a trivial \"to-do list\" due to the hierarchical breakdown, custom notification styles, and positive reinforcement elements, which add depth. However, it remains highly feasible within a semester, as confirmed by the student's clear understanding of core mobile development concepts. The inclusion of \"Future Enhancements\" further demonstrates a mature understanding of project scoping.\n*   **Does it demonstrate thoughtful consideration of user experience and impact?**\n    *   This is arguably the strongest aspect of the proposal. The entire concept is built around enhancing the user's emotional state and reducing stress. Every feature, from the calming UI to the gentle reminders and micro-win celebrations, is directly tied to improving the user's experience and fostering a positive impact on their well-being. This shows a deep empathy for the user.\n\n**Overall:** This is a highly commendable project idea. It's well-researched, clearly articulated, technically sound, and demonstrates a strong user-centric approach. The student has clearly put significant thought into all aspects of the evaluation criteria.\n\n29/30"}, "weekly_desc": "This week felt like a complete blur, honestly. Like I was just moving through the motions without really being *there*. My brain feels so foggy, and I'm just perpetually exhausted. I know I was in COSC 065 every day – Monday, Wednesday, Thursday, Friday – but if you asked me to recall anything specific, I'd probably just stare blankly. It all just blends together into this dull hum of information I'm trying to absorb while feeling like I'm running on fumes.\n\nThe biggest challenge, by far, is the sheer mountain of deadlines looming over me. Three things due Monday, two more on Tuesday, and another on Wednesday. It's just... suffocating. Every time I look at the list, my chest gets tight. I feel like I'm constantly playing catch-up, even though I'm trying so hard to stay on top of things. My conscientiousness is screaming at me to get organized, but my brain just feels too fried to properly execute.\n\nI've been trying to keep up with my social life, which is probably why my sleep is so abysmal. It feels important to connect with people, to not just isolate myself, but then I pay for it later when I'm staring at the ceiling at 3 AM, my mind racing about everything I *should* be doing. My stamina is just shot. It's a weird push and pull – I want to be out there, but then I just feel more drained. It's like I'm trying to fill a bucket with a hole in it.\n\nMy knowledge levels seem okay, which is a small comfort, I guess. At least I'm learning *something*, even if I feel like a zombie doing it. But the happiness? That's definitely taken a nosedive. It's hard to feel happy when you're constantly stressed and sleep-deprived.\n\nFor next week, my goals are pretty clear, even if they feel daunting. First, I *have* to tackle these deadlines head-on. I need to break them down into smaller, manageable chunks so they don't feel so overwhelming. Second, I desperately need to prioritize sleep. I know it's easier said than done with everything going on, but I can't keep functioning like this. I need to find a way to carve out more time for rest, even if it means saying no to some social things. And finally, I just want to feel less anxious. I want to feel like I have some control, instead of feeling like I'm drowning. Just a little bit of breathing room would be nice.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: 10, because the student explicitly states \"My stamina is just shot,\" and describes feeling \"perpetually exhausted,\" \"running on fumes,\" and like a \"zombie.\" They also mention feeling \"more drained\" after social interactions and \"can't keep functioning like this.\"\n- **Knowledge**: 65, because despite feeling \"brain so foggy\" and difficulty recalling specifics (\"stare blankly\"), the student directly states, \"My knowledge levels seem okay, which is a small comfort, I guess. At least I'm learning *something*.\" This indicates a reasonable level of knowledge acquisition, even if processing is impaired by fatigue.\n- **Stress**: 98, because the student describes a \"sheer mountain of deadlines looming,\" feeling \"suffocating,\" \"chest gets tight,\" \"constantly playing catch-up,\" and \"brain just feels too fried.\" They also mention being \"constantly stressed\" and feeling like they are \"drowning.\"\n- **Happy**: 8, because the student states, \"The happiness? That's definitely taken a nosedive,\" and finds it \"hard to feel happy when you're constantly stressed and sleep-deprived.\" They also describe the week as a \"complete blur\" and \"just moving through the motions without really being *there*.\"\n- **Sleep**: 5, because the student explicitly says \"my sleep is so abysmal\" and describes \"staring at the ceiling at 3 AM, my mind racing.\" They acknowledge being \"sleep-deprived\" and that they \"desperately need to prioritize sleep\" because they \"can't keep functioning like this.\"\n- **Social**: 65, because the student states, \"I've been trying to keep up with my social life\" and finds it \"important to connect with people, to not just isolate myself.\" They express a desire to \"be out there,\" indicating continued engagement, even if it's a \"weird push and pull\" that impacts their sleep and they are considering reducing it in the future."}
