{"week": 1, "emotion": {"stamina": 100, "knowledge": 25, "stress": 85, "happy": 35, "sleep": 100, "social": 50}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "Okay, this past week felt a bit… unstructured, to say the least. Looking back, it’s pretty clear I didn’t make it to any of my actual classes, which is a bit of a wake-up call. It’s not like I was exhausted or anything – my sleep and stamina have been great, actually. I just seemed to be elsewhere.\n\nOn Wednesday, instead of being in COSC 065 or 089, I was hitting the gym at Berry Sports Center and then Leverone. Good workout, but definitely not class. Later in the day, I was down by the Boathouse. Thursday was similar; I missed my COSC 065 and TUCK 003 classes. I was at the Life Sciences Center for a bit, and then back at the Boathouse. It feels like I spent a lot of time by the water this week.\n\nFriday was another day of missed classes. I was actually at the Admissions Office for a while in the afternoon, which was interesting, but it meant I wasn't in COSC 065 or 089. I did have some activity later in the evening, but it was pretty vague.\n\nThe weekend was a mix. Saturday, I found myself out at Glen Road Plaza, which is definitely not campus. Just doing some errands, I guess. Sunday was pretty quiet, not much going on until later in the afternoon.\n\nThen Monday rolled around, and again, no classes for me. I was at the Boathouse again in the early afternoon, and then later at the Admissions Office. I did have some activity late at night, but it wasn't academic. And Tuesday, my TUCK 003 class was scheduled for Carson-Tech Services, but I was over in Sudikoff Hall around that time. So, I was in a CS building, just not where I was supposed to be for class.\n\nIt’s weird because I know I have a lot of deadlines coming up – seriously, there are so many, especially next week. My conscientiousness is definitely kicking in now, realizing I've let things slide a bit. My knowledge level is probably reflecting my attendance, which is a bit concerning. My social life has been okay, just average, so it's not like I was out being super social instead of studying. I think I just got a bit sidetracked, maybe exploring other things or just not feeling the pull of lectures.\n\nThe biggest challenge this week was definitely my lack of engagement with my actual coursework. I feel a bit behind now, and the sheer number of upcoming deadlines is a bit daunting.\n\nFor next week, my goals are pretty clear:\n1.  **Attend all my scheduled classes.** No more missing lectures. I need to get back into the routine and absorb the material directly.\n2.  **Start tackling those deadlines.** I need to prioritize and make a plan to chip away at the assignments. My conscientiousness needs to take the lead here.\n3.  **Find a better balance.** I enjoy being active and exploring, but it can't come at the expense of my academics. I need to integrate my physical activity with my study schedule more effectively.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** 100, because the student explicitly states, \"my sleep and stamina have been great, actually.\"\n-   **Knowledge:** 25, because the student notes, \"My knowledge level is probably reflecting my attendance, which is a bit concerning,\" indicating a significant drop due to missed classes and lack of engagement with coursework.\n-   **Stress:** 85, because the student expresses high stress due to \"a lot of deadlines coming up – seriously, there are so many,\" feeling \"a bit behind now,\" and finding the number of upcoming deadlines \"a bit daunting.\"\n-   **Happy:** 35, because while the student enjoyed some activities (\"I enjoy being active and exploring\"), the overall tone is one of concern and realization about academic neglect (\"unstructured,\" \"wake-up call,\" \"let things slide,\" \"concerning,\" \"biggest challenge,\" \"feel a bit behind,\" \"daunting\"), which likely diminishes overall happiness despite the physical activity.\n-   **Sleep:** 100, because the student explicitly states, \"my sleep and stamina have been great, actually.\"\n-   **Social:** 50, because the student describes their social life as \"okay, just average,\" indicating a neutral state."}
{"week": 2, "emotion": {"stamina": 100, "knowledge": 25, "stress": 85, "happy": 35, "sleep": 100, "social": 50}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 9, "total_questions": 10, "week": 2}, "weekly_desc": "This week felt like a bit of a blur, honestly. My happiness is definitely on the low side, and I can feel it. It’s strange because my sleep tracker says I’m getting a full 100% on sleep, and my stamina is through the roof, but I just haven’t been channeling that energy into the right places.\n\nLooking back, I pretty much missed every single one of my classes. COSC 089, COSC 050, TUCK 003, COSC 065… all of them. The class experience summary says \"No class experience recorded,\" and that's painfully accurate. It's like I just couldn't bring myself to go, even though I know I should have been there. I saw I was at the Boathouse a couple of times on Thursday, which was nice for a bit, and then there were those random bursts of activity late at night or super early in the morning, mostly in unknown places. I guess I was just... doing other things? Or maybe just not tracking properly. It's frustrating because I know I *should* be in class, especially with all these deadlines piling up. Seriously, there are so many due next week, especially Monday, Tuesday, and Wednesday. It's a bit overwhelming to look at.\n\nI did manage to get to Sudikoff on Tuesday afternoon, which was good. I think I spent some time in the CS lab there, trying to catch up on something, but it felt like too little, too late for the whole week. My knowledge level is supposed to be high, but I feel like I'm actively sabotaging it by not showing up. It's a weird feeling, like I know what I *should* be doing, and I want to do it, but then I just... don't.\n\nThis whole situation is making me feel pretty stressed, which probably explains the low happiness. I need to get back on track. For next week, my absolute top priority is to attend every single class. No excuses. I also need to get a serious head start on these assignments. I can't afford to fall further behind. I want to feel that sense of accomplishment again, and not this constant low-level anxiety about what I'm missing. I need to find a way to channel this high stamina into actual productive work, not just random late-night bursts of activity. And maybe figure out why I'm so disengaged from classes right now, despite knowing how important they are.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 100 because the student explicitly states, \"my stamina is through the roof\" and \"I can channel this high stamina.\"\n- **Knowledge:** 25 because the student \"pretty much missed every single one of my classes,\" notes \"No class experience recorded,\" and feels they are \"actively sabotaging it by not showing up,\" despite a brief attempt to \"catch up on something, but it felt like too little, too late.\"\n- **Stress:** 85 because the student mentions \"deadlines piling up,\" finding it \"a bit overwhelming to look at,\" explicitly states \"This whole situation is making me feel pretty stressed,\" and describes a \"constant low-level anxiety.\"\n- **Happy:** 35 because the student directly states, \"My happiness is definitely on the low side\" and attributes \"low happiness\" to the stressful situation.\n- **Sleep:** 100 because the student explicitly mentions, \"my sleep tracker says I’m getting a full 100% on sleep.\"\n- **Social:** 50 because the student mentions a positive, albeit brief, social interaction: \"I saw I was at the Boathouse a couple of times on Thursday, which was nice for a bit.\" There's no indication of significant social engagement or isolation beyond this."}
{"week": 3, "emotion": {"stamina": 15, "knowledge": 10, "stress": 95, "happy": 35, "sleep": 75, "social": 50}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 10, "total_questions": 10, "week": 3}, "weekly_desc": "This week felt… off. Like I was moving through molasses, or maybe just not moving at all. My happiness score is definitely reflecting that; 35 is pretty low, and I can feel it. It’s this weird mix of being completely rested – my sleep and stamina are somehow at 100, which is great – but also just utterly drained emotionally.\n\nThe biggest thing, and it’s hard to even write it down, is that I didn't make it to any of my classes. Not a single one. COSC 089, COSC 050, TUCK 003, COSC 065… I just couldn't bring myself to go. It’s not like I was out partying or anything. Most of the time, the logs just say \"No activity\" or \"Unknown location.\" It feels like I just existed, rather than actively participated in anything.\n\nI did find myself wandering around campus a bit. Spent a surprising amount of time at the Boathouse – it’s peaceful there, a good place to just… be. I also ended up near the Admissions Office a few times. Not sure why, just ended up there. And Fairchild Physical Sciences Center, too, though not for any specific class. It’s like I was trying to be productive, or at least in the vicinity of productivity, but the actual work just wasn't happening. There were those odd early morning activities too, like 3 or 4 AM, which probably means my sleep schedule is more erratic than the \"100\" score suggests. Maybe I'm just sleeping *a lot* to compensate for feeling so low.\n\nMy social score is sitting at 50, which feels about right. I haven't really connected with anyone properly this week. It’s hard to reach out when you feel this disengaged.\n\nAnd the deadlines… oh god, the deadlines. Looking at the list, it’s just a wall of them, especially for next week. Wednesday, Sunday, Monday, Tuesday, Friday… they’re all piling up. My conscientiousness is screaming at me, telling me I should be on top of this, but the motivation just isn't there. It’s a vicious cycle: I feel bad for not doing things, which makes me less likely to do things, which makes me feel worse. My knowledge score is high, which is good, but it doesn't mean much if I'm not applying it or learning new things in class.\n\nSo, for next week, I really need to turn this around. My main goal is simple: **attend all my classes.** Just showing up would be a huge step. Then, I need to start chipping away at these deadlines. I can’t let them overwhelm me. I need to break them down into smaller, manageable tasks. Maybe I can try to connect with a friend or two, too. Just a quick coffee or study session, something to boost that social score and maybe my happiness a little. I know I can do better than this. I just need to find that spark again.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student states they felt \"like I was moving through molasses, or maybe just not moving at all\" and was \"utterly drained emotionally.\" They \"couldn't bring myself to go\" to any classes and noted \"the actual work just wasn't happening,\" despite feeling physically rested. This indicates a severe lack of mental and emotional energy for action.\n- **Knowledge:** The student explicitly states they \"didn't make it to any of my classes. Not a single one.\" While they claim \"My knowledge score is high,\" they immediately qualify this by saying \"it doesn't mean much if I'm not applying it or learning new things in class,\" indicating a complete lack of current knowledge acquisition or application in their studies.\n- **Stress:** The student expresses extreme distress over \"the deadlines… oh god, the deadlines,\" describing them as \"just a wall of them\" that are \"all piling up.\" They also mention being caught in a \"vicious cycle\" of feeling bad and lacking motivation, which is a strong indicator of high stress.\n- **Happy:** The student directly states, \"My happiness score is definitely reflecting that; 35 is pretty low, and I can feel it.\"\n- **Sleep:** The student initially claims \"my sleep and stamina are somehow at 100,\" and feels \"completely rested.\" However, they contradict this by noting \"odd early morning activities too, like 3 or 4 AM, which probably means my sleep schedule is more erratic than the \"100\" score suggests,\" implying that while they might be getting a lot of sleep, its quality or regularity is compromised.\n- **Social:** The student explicitly states, \"My social score is sitting at 50, which feels about right. I haven't really connected with anyone properly this week. It’s hard to reach out when you feel this disengaged.\""}
{"week": 4, "emotion": {"stamina": 5, "knowledge": 80, "stress": 95, "happy": 20, "sleep": 70, "social": 50}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Activities & Intents", "correct_answers": 9, "total_questions": 10, "week": 4}, "weekly_desc": "Okay, another week gone. Honestly, it feels like a blur, and not in a good way. I'm looking at my schedule and then at what I actually *did*, and there's a huge disconnect.\n\nI didn't make it to a single class this week. Not one. COSC 089, COSC 050, TUCK 003, COSC 065 – all of them, just... missed. It's not like I didn't *want* to go, or that I don't care about the material. My knowledge levels are still pretty high, so I know I've been keeping up with the content, but actually showing up? That just didn't happen.\n\nMy stamina is just completely shot, which probably explains a lot. I feel drained, like I'm running on fumes. Most of my time was spent just... being. A lot of \"no activity, unknown location,\" which probably means I was just holed up in my room, trying to recharge, or maybe just staring at the ceiling. I did manage to get to the library on Wednesday for a bit, which was good, felt like I was at least *trying* to be productive. And I made it to the boathouse a couple of times, which usually helps clear my head, but even that felt like a monumental effort. I guess I also ventured out to Lebanon on Monday, which was a nice change of scenery, but it wasn't exactly a bustling social event.\n\nMy happiness is pretty low right now, and I think it's directly tied to this feeling of falling behind, even though I'm trying to keep up with the material on my own. There are so many deadlines looming – a bunch for Wednesday, then Sunday, Monday, Tuesday, Thursday, Friday... it's a constant wave, and it feels like I'm barely treading water. The conscientiousness in me is screaming about all the things I *should* be doing, and the gap between that and my actual energy levels is just crushing.\n\nI need to figure out why I'm so drained. Is it just the sheer volume of work? Am I not managing my time effectively, even with a decent sleep schedule? I'm usually pretty good at staying on top of things, but this week felt different.\n\nFor next week, the absolute priority has to be getting back into the rhythm of classes. I need to be physically present, not just trying to catch up later. I'll try to break down those looming deadlines into smaller, more manageable chunks so they don't feel so overwhelming. And I really need to focus on rebuilding my stamina. Maybe more regular, shorter bursts of activity, and making sure I'm actually fueling myself properly. I also want to try and connect with people a bit more, even if it's just a quick chat. My social meter is neutral, but I think a bit more interaction could help lift my spirits. This can't become a pattern. I need to get back on track.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states, \"My stamina is just completely shot,\" and \"I feel drained, like I'm running on fumes.\" They also mention that even activities that usually help felt like \"a monumental effort,\" indicating extreme exhaustion and lack of energy.\n-   **Knowledge:** The student asserts, \"My knowledge levels are still pretty high, so I know I've been keeping up with the content,\" despite missing classes. This indicates confidence in their understanding of the material.\n-   **Stress:** The student describes \"so many deadlines looming\" as \"a constant wave\" and feels like they're \"barely treading water.\" They also mention the \"conscientiousness in me is screaming\" and the gap with energy levels is \"crushing,\" all pointing to very high stress levels.\n-   **Happy:** The student directly states, \"My happiness is pretty low right now,\" and attributes it to \"this feeling of falling behind\" and the \"crushing\" gap between what they should be doing and their energy.\n-   **Sleep:** The student mentions, \"even with a decent sleep schedule,\" suggesting that their sleep quality or quantity is adequate, and not the primary cause of their fatigue.\n-   **Social:** The student explicitly states, \"My social meter is neutral,\" and notes that their venture out to Lebanon \"wasn't exactly a bustling social event,\" indicating a lack of significant social interaction but not necessarily a negative social state."}
{"week": 5, "emotion": {"stamina": 5, "knowledge": 80, "stress": 90, "happy": 20, "sleep": 70, "social": 50}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 9, "total_questions": 10, "week": 5}, "weekly_desc": "This week felt like a bit of a blur, honestly. I'm pretty wiped out, and I can tell my happiness levels aren't exactly soaring right now. My stamina is practically non-existent, which is a bit concerning.\n\nLooking at my schedule, it's clear I didn't make it to any of my actual classes this week. That's definitely not ideal, and it's something I need to address. I know I'm usually pretty good about keeping up, and my knowledge levels are still high, so I must be doing a decent job of self-studying or reviewing material on my own time. But showing up is important, not just for the content, but for the structure and engagement.\n\nA big part of why I was so drained, I think, comes down to the boathouse. I spent a lot of time there – Wednesday evening, then Thursday afternoon and evening, and again Friday and Monday, even Tuesday evening. It's a huge commitment, and while I love being out on the water, it really takes it out of me physically. That probably explains the stamina crash. I also found myself at the Admissions Office quite a few times this week. I've been helping out with some prospective student tours and general office tasks, which is rewarding, but it adds another layer to the daily grind.\n\nMy social life feels pretty balanced, I guess. I had some 'active' moments that weren't tied to specific locations, which usually means I was catching up with friends or just getting out and about. And I was at Goldstein Hall on Monday evening, which is always good for a quick chat with people in the dorm. Sleep-wise, I seem to be doing okay, which is a relief, because if I wasn't getting enough sleep on top of everything else, I'd probably be completely burnt out.\n\nThe biggest challenge is definitely balancing everything. The boathouse, helping out at Admissions, trying to keep up with class material even when I'm not physically there, and then seeing that mountain of upcoming deadlines... it's a lot. Especially with so many due on Monday, Tuesday, and Wednesday next week. It feels like I'm constantly playing catch-up.\n\nFor next week, my main goal is to get back into a routine with classes. I need to prioritize attending lectures, even if I'm tired. I'll also try to be more strategic with my time, maybe block out specific study periods to tackle those deadlines head-on. And honestly, I need to find a way to boost my stamina and happiness. Maybe that means scheduling in some actual downtime, or just making sure I'm fueling myself properly. It's all about finding that balance.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: 5 - The student explicitly states, \"I'm pretty wiped out,\" and \"My stamina is practically non-existent,\" and mentions a \"stamina crash\" due to physical commitments.\n-   **Knowledge**: 80 - Despite missing classes, the student believes, \"my knowledge levels are still high, so I must be doing a decent job of self-studying or reviewing material on my own time.\"\n-   **Stress**: 90 - The student describes \"a mountain of upcoming deadlines,\" feeling \"constantly playing catch-up,\" and that \"The biggest challenge is definitely balancing everything,\" indicating very high stress.\n-   **Happy**: 20 - The student notes, \"my happiness levels aren't exactly soaring right now,\" and expresses a need to \"find a way to boost my stamina and happiness.\"\n-   **Sleep**: 70 - The student reports, \"Sleep-wise, I seem to be doing okay, which is a relief,\" suggesting a relatively good and stable sleep pattern.\n-   **Social**: 50 - The student states, \"My social life feels pretty balanced, I guess,\" and mentions \"catching up with friends\" and \"a quick chat with people in the dorm,\" indicating a moderate and stable social engagement."}
{"week": 6, "emotion": {"stamina": 5, "knowledge": 80, "stress": 95, "happy": 20, "sleep": 70, "social": 30}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 9, "total_questions": 10, "week": 6}, "weekly_desc": "This week felt… heavy. Looking back at my schedule, it's clear I didn't really show up. My classes were all there, waiting for me, but I just couldn't bring myself to go. Every morning, the thought of getting up and being \"on\" for lectures felt like climbing a mountain I just didn't have the energy for.\n\nMy stamina is practically non-existent right now, which explains a lot. It's weird because I've actually been getting a decent amount of sleep, but it doesn't seem to translate into actual energy or motivation. I just feel so drained, like my internal battery is stuck at 5%. And that's definitely impacting my happiness, which is pretty low. It's a tough cycle – no energy, so no motivation, which makes me feel worse.\n\nI spent a bit of time at the Boathouse, which was a small escape. Just being by the water, even if I wasn't doing much, felt like a quiet moment away from everything. I also ended up at the Admissions Office on Friday, which was a bit random, but sometimes just having a different place to be helps break the monotony of feeling stuck. Beyond that, it was a lot of \"no activity\" in unknown locations, which probably means I was just holed up, trying to exist.\n\nIt's frustrating because I know I'm capable. My knowledge levels are still high, which is a testament to all the work I've put in, but it's hard to leverage that when I'm feeling so burnt out. The sheer number of deadlines looming over me is a constant source of anxiety. There are so many due dates coming up, especially early next week, and the thought of catching up on all the material I missed while also tackling those assignments feels overwhelming. My conscientiousness is screaming at me to get it together, but the physical and mental exhaustion is just… louder.\n\nSocially, I haven't been very active, even though my social score is average. I think I've been pretty isolated this week, which probably isn't helping the happiness situation.\n\n**Challenges this week:**\n*   **Attendance:** Completely missed all my classes. This is a huge problem and I know it.\n*   **Stamina/Motivation:** Just couldn't find the energy to engage with anything academic.\n*   **Overwhelm:** The pile-up of missed material and upcoming deadlines feels crushing.\n*   **Happiness:** Feeling pretty down and disconnected.\n\n**Goals for next week:**\n1.  **Get back to class.** Even if I just sit there, I need to be present. One step at a time.\n2.  **Prioritize deadlines.** I need to make a realistic plan for those assignments, starting with the ones due earliest. Maybe just pick one or two to really focus on first.\n3.  **Find small ways to recharge.** Maybe a walk, or just sitting outside for a bit. Something to try and boost that stamina, even slightly.\n4.  **Reach out.** Maybe talk to a friend, or even an advisor, about how I'm feeling. I can't keep doing this alone.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina: 5**\n    -   The student explicitly states, \"My stamina is practically non-existent right now\" and \"I just feel so drained, like my internal battery is stuck at 5%.\" They also mention not having \"the energy for\" lectures and feeling \"physical and mental exhaustion.\"\n-   **Knowledge: 80**\n    -   The student states, \"My knowledge levels are still high, which is a testament to all the work I've put in.\" They also acknowledge, \"I know I'm capable,\" indicating their intellectual capacity is intact despite other struggles.\n-   **Stress: 95**\n    -   The student describes \"The sheer number of deadlines looming over me is a constant source of anxiety.\" They find the thought of catching up \"overwhelming\" and the \"pile-up of missed material and upcoming deadlines feels crushing.\"\n-   **Happy: 20**\n    -   The student directly states, \"that's definitely impacting my happiness, which is pretty low\" and \"Feeling pretty down and disconnected.\" They also note that \"no energy, so no motivation, which makes me feel worse.\"\n-   **Sleep: 70**\n    -   The student explicitly mentions, \"I've actually been getting a decent amount of sleep,\" indicating that sleep quantity is not the primary issue, even if it's not translating to energy.\n-   **Social: 30**\n    -   The student states, \"Socially, I haven't been very active\" and \"I think I've been pretty isolated this week.\" They also mention \"a lot of 'no activity' in unknown locations, which probably means I was just holed up, trying to exist,\" and a goal to \"Reach out\" because they \"can't keep doing this alone.\" While they mention their \"social score is average,\" their *actions* and *feelings* this week clearly indicate low social engagement."}
{"week": 7, "emotion": {"stamina": 5, "knowledge": 80, "stress": 95, "happy": 20, "sleep": 60, "social": 30}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 10, "total_questions": 10, "week": 7}, "weekly_desc": "This week felt like a blur, honestly. Looking back, it's pretty clear I wasn't really \"on\" my game. My stamina is just completely shot, and honestly, my happiness levels are pretty low too. It's a weird feeling, because I know I'm capable, my knowledge scores are still high, but actually *doing* things feels like climbing a mountain right now.\n\nClasses were... well, they didn't really happen for me this week. I saw the schedule, I knew where I was supposed to be, but it was like my body just wouldn't cooperate. Wednesday, I was in my dorm during COSC 089, and then later at Sudikoff during TUCK 003, but not actually *in* the TUCK class. Thursday and Friday were pretty much the same story – I was around campus, at the dining hall, or even the gym parking lot, but not in any of my lectures. It's frustrating because I *want* to be there, I really do. My conscientiousness is screaming at me to get it together, but the energy just isn't there.\n\nEven on the weekend, I was mostly just... present. A little activity on Saturday and Sunday, but nothing major. Monday and Tuesday followed the pattern of missed classes. I was at the gym during COSC 089 on Tuesday, and then the Boathouse during COSC 050. It's not like I was completely checked out, I was active at Sarner Underground during TUCK 003, but it wasn't for class. It feels like I'm just drifting through the days, trying to find pockets of energy.\n\nMy social life has definitely taken a hit too. With my stamina so low, I haven't really sought out much interaction, which probably isn't helping the happiness score. It's a bit of a vicious cycle.\n\nThe sheer number of upcoming deadlines is looming over me, and that's probably contributing to the stress and the feeling of being overwhelmed. It's hard to even think about tackling them when I can barely get myself to class.\n\nFor next week, I really need to turn this around. My main goal has to be to get my stamina back up, even if it's just a little bit. I need to:\n1.  **Prioritize rest:** Even if it means cutting back on other things, I need to make sure I'm actually recovering.\n2.  **Attend at least one class a day:** Just one. A small win to build on. Maybe start with COSC 065 on Wednesday, since it's first.\n3.  **Break down those deadlines:** Instead of looking at the whole mountain, I need to pick one or two and just focus on getting *something* done for them. Maybe the earliest Wednesday deadline.\n4.  **Try to connect with someone:** Even a quick chat with a friend. My social score is low, and I know that isolation isn't good for me.\n\nIt's a lot, but I know I can do it. I just need to find that spark again.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states, \"My stamina is just completely shot,\" and \"the energy just isn't there,\" indicating an extremely low level. They also mention \"actually *doing* things feels like climbing a mountain.\"\n-   **Knowledge:** The student directly confirms, \"my knowledge scores are still high,\" suggesting this area is not a concern for them.\n-   **Stress:** The student clearly states, \"The sheer number of upcoming deadlines is looming over me, and that's probably contributing to the stress and the feeling of being overwhelmed.\" This indicates very high stress levels.\n-   **Happy:** The student directly reports, \"my happiness levels are pretty low too,\" and notes that isolation \"isn't helping the happiness score,\" indicating a low emotional state.\n-   **Sleep:** While not explicitly stating poor sleep, the student's goal to \"Prioritize rest\" and the pervasive feeling of \"stamina completely shot\" and \"body just wouldn't cooperate\" suggest that their current rest/sleep is insufficient or not restorative enough to combat their exhaustion, even if they are getting some hours.\n-   **Social:** The student explicitly states, \"My social life has definitely taken a hit too,\" and \"My social score is low,\" indicating a significant decline in social interaction and satisfaction."}
{"week": 8, "emotion": {"stamina": 5, "knowledge": 80, "stress": 95, "happy": 20, "sleep": 40, "social": 30}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "Okay, another week gone. Time to actually sit down and think about what happened, or, more accurately, what *didn't* happen.\n\nHonestly, this week felt like a blur, and not in a good way. Looking at my schedule, I had all these classes – COSC 089, COSC 050, TUCK 003, COSC 065 – and I just… didn't make it to any of them. Not a single one. That's a pretty big deal, and it's weighing on me. My stamina is practically non-existent, which explains a lot. It felt like pulling myself out of bed was a monumental task, let alone getting to Sudikoff or Kemeny for lectures. I'd be near campus, like by the Boathouse or just around Maynard Street, but the energy to actually *go in* and engage just wasn't there.\n\nIt's weird because I feel like I *know* a lot of the material, or at least I did. My knowledge stats are still pretty high, which is a small comfort, but it's not helping me actually *do* anything right now. I'm just so tired. That low stamina score is really hitting home. And my happiness? Yeah, 20. That tracks. It's hard to feel good when you're constantly battling exhaustion and the guilt of not showing up.\n\nSocially, I tried a little. I had some activity on Wednesday and Thursday evening, and then again on Saturday and Monday. I even ended up at Hanover High on Friday night, which was... unexpected. And a quick trip to the Post Office on Sunday. But even with those moments, my social score is still low. It feels like I'm just floating through, not really connecting or getting that boost from being around people. I think the exhaustion just makes me want to retreat.\n\nThe biggest looming cloud is definitely the deadlines. There are so many of them, especially for Wednesday, Sunday, and Monday. It's overwhelming to look at, especially when I haven't been in class to even hear about them properly. I know I'm falling behind, and that just adds to the stress. My neuroticism is probably spiking just thinking about it.\n\nThis can't keep happening. I pride myself on being conscientious, and this week was the opposite of that. I need to figure out what's draining me so much.\n\nFor next week, my goals are pretty clear, even if they feel daunting:\n1.  **Prioritize rest:** I need to get my stamina back up. This means actual, quality sleep, not just lying in bed.\n2.  **Get back to class:** Even if I feel behind, I need to show up. Just being there is a start. I'll aim for at least one class each day to begin with.\n3.  **Tackle deadlines strategically:** I need to break down those assignments. Maybe pick one or two of the most urgent ones and just focus on those first, rather than getting paralyzed by the sheer number.\n4.  **Re-engage socially:** Find a low-key way to connect with friends, even if it's just a quick coffee or a study session. My social battery needs a recharge too.\n\nI know I can do better than this. I just need to find the energy to start.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"My stamina is practically non-existent,\" and mentions being \"so tired\" and battling \"exhaustion,\" making it a monumental task to get out of bed or engage.\n- **Knowledge:** The student notes, \"I feel like I *know* a lot of the material... My knowledge stats are still pretty high,\" indicating a strong grasp of the subject matter despite attendance issues.\n- **Stress:** The student describes deadlines as \"the biggest looming cloud\" and \"overwhelming,\" stating that falling behind \"adds to the stress\" and that their \"neuroticism is probably spiking.\"\n- **Happy:** The student directly confirms their happiness level by saying, \"My happiness? Yeah, 20. That tracks,\" and explains it's \"hard to feel good when you're constantly battling exhaustion and the guilt.\"\n- **Sleep:** The student mentions that \"pulling myself out of bed was a monumental task\" and sets a goal for \"actual, quality sleep, not just lying in bed,\" implying that their current sleep is not restorative or effective, even if they are spending time in bed.\n- **Social:** The student states, \"my social score is still low,\" and feels like they're \"just floating through, not really connecting or getting that boost from being around people,\" attributing this to exhaustion making them \"want to retreat.\""}
{"week": 9, "emotion": {"stamina": 5, "knowledge": 80, "stress": 95, "happy": 20, "sleep": 15, "social": 10}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "Okay, another week down. Or, well, mostly down. Honestly, I'm just feeling completely drained. My stamina is practically non-existent, and I can tell my sleep has been all over the place. It's like I'm constantly playing catch-up, but the finish line keeps moving further away.\n\nAcademically, this week was... rough. I'm looking at my schedule, and it's pretty clear I didn't make it to any of my actual classes. COSC 089, COSC 050, TUCK 003, COSC 065 – I missed them all. It's frustrating because I know the material, my knowledge scores are decent, but actually getting myself to class felt impossible. I spent so much time in Sudikoff, especially late at night, trying to chip away at assignments. Sunday night, I was there until the early hours of Monday morning, just trying to get things done. And then again on Tuesday afternoon. It feels like I'm constantly working, but not on the right things, or not efficiently. The sheer number of deadlines looming over me is just overwhelming – there's something due almost every day next week.\n\nMy sleep has been a mess. I'm seeing these \"Activity: Yes\" timestamps at 1 AM, 2 AM, 2 AM, 2 AM... it's just not sustainable. No wonder my sleep score is so low. And with that, my happiness and social scores have taken a hit too. I haven't really connected with anyone properly. I grabbed food at the Commons on Friday and Saturday, but it was more about fueling up than actually socializing. I feel pretty isolated right now.\n\nI found myself wandering a bit this week. Spent some time at the Boathouse, which is usually a good way to clear my head, but even that felt like a chore. I was at Vail a couple of times, and Fairchild too – just trying to find different spots to work, I guess, or maybe just to escape my dorm for a bit. The Admissions Office visits were a bit random, but sometimes it's good to just be around other people, even if you're not interacting much.\n\nThe biggest challenge is definitely this cycle of missing classes because I'm exhausted from trying to catch up on work, which then makes me fall further behind. It's a vicious loop. My conscientiousness is screaming at me to get it together, but my body just isn't cooperating.\n\nFor next week, I *have* to break this cycle. My main goal is to actually attend my classes. Even if I'm tired, I need to be there. I also need to figure out a better way to manage these deadlines. Maybe breaking them down into smaller chunks, or trying to get a head start on things earlier in the week instead of pulling all-nighters right before they're due. And honestly, I need to prioritize sleep. If I can get my sleep back on track, I think everything else – my stamina, my happiness, even my ability to focus in class – will start to improve. I also want to try and reach out to someone, even just for a quick chat. This feeling of being constantly overwhelmed and alone isn't helping anything.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"I'm just feeling completely drained. My stamina is practically non-existent,\" and later, \"I'm exhausted from trying to catch up on work,\" indicating extremely low physical and mental energy.\n- **Knowledge:** The student confirms, \"I know the material, my knowledge scores are decent,\" suggesting their understanding of the academic content remains strong despite challenges with attendance.\n- **Stress:** The student reports, \"The sheer number of deadlines looming over me is just overwhelming,\" and describes a \"vicious loop\" where \"My conscientiousness is screaming at me to get it together,\" highlighting very high levels of academic pressure and internal conflict.\n- **Happy:** The student notes, \"my happiness... have taken a hit too,\" and even activities usually enjoyed, like going to the Boathouse, \"felt like a chore,\" indicating a significantly reduced sense of well-being.\n- **Sleep:** The student states, \"My sleep has been a mess. I'm seeing these 'Activity: Yes' timestamps at 1 AM, 2 AM, 2 AM, 2 AM... it's just not sustainable. No wonder my sleep score is so low,\" which points to severely disrupted and insufficient sleep.\n- **Social:** The student expresses, \"I haven't really connected with anyone properly,\" and \"I feel pretty isolated right now,\" further emphasizing, \"This feeling of being constantly overwhelmed and alone isn't helping anything,\" indicating very limited and unsatisfying social interaction."}
{"week": 10, "emotion": {"stamina": 2, "knowledge": 85, "stress": 98, "happy": 15, "sleep": 10, "social": 10}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 30.0, "full_text_response": "30/30"}, "weekly_desc": "This week felt like a blur, honestly. I'm looking at my status and it's pretty clear why – my happiness, sleep, social life, and stamina are all in the red. It's a tough pill to swallow, especially when I know I've got a good grasp on the material, but just *getting* to it feels like climbing a mountain right now.\n\nThe biggest thing that stands out is how little I actually made it to my classes. I saw the schedule, I know where I'm supposed to be – Sudikoff for COSC 089, Kemeny for COSC 050, Carson for TUCK 003, LSB for COSC 065. But when I look back, it's just a lot of \"No activity\" during those times. I feel a bit guilty about it, to be honest. My conscientiousness is usually pretty high, and skipping classes isn't something I like to do. It's just that the exhaustion has been so overwhelming. My stamina is practically non-existent, and sleep feels like a luxury I can't afford with all these deadlines looming.\n\nSpeaking of deadlines, that's definitely the elephant in the room. Looking at the sheer number of assignments due in the coming days – multiple ones on Wednesday, Sunday, Monday, Tuesday, Thursday, Friday – it's just a constant weight. It feels like I'm always playing catch-up, and every time I think I'm getting ahead, another one pops up. That's probably why my sleep is so low; I've been trying to cram in work whenever I can, even if it means sacrificing rest.\n\nMy \"activity\" outside of class seems to have been pretty sporadic too. I remember that quick trip to the real estate office on Wednesday – just trying to sort out some future housing stuff, which felt like another chore on top of everything else. And then there were those random bursts of \"Activity: Yes\" at unknown locations. Those were probably me just hunkering down wherever I could find a quiet spot to try and chip away at assignments, or maybe just trying to get some basic life stuff done. I even found myself near the Boathouse and Vail, but I wasn't really *doing* anything there, just kind of existing.\n\nMy social life has taken a huge hit, which makes me feel a bit isolated. I haven't really connected with anyone this week, and that's probably contributing to the low happiness score. It's hard to be outgoing when you're running on fumes.\n\nThe main challenge this week has been managing the sheer volume of work while feeling completely drained. It's a vicious cycle: I'm tired, so I don't go to class, then I have to teach myself the material, which takes more time, leading to less sleep, and so on.\n\nFor next week, I really need to turn this around. My goals are:\n1.  **Prioritize sleep:** I know it sounds counterintuitive with all the deadlines, but I can't function like this. I need to aim for at least 6-7 hours, even if it means being strategic about what I can realistically get done.\n2.  **Strategic attack on deadlines:** Instead of just feeling overwhelmed, I need to break down each assignment into smaller, manageable chunks. I'll use my high conscientiousness to plan this out properly.\n3.  **Attempt class attendance:** Even if I'm tired, I need to try and make it to at least some of my classes. Being there, even if I'm just absorbing passively, is better than nothing.\n4.  **Find a moment for myself:** Whether it's a quick walk, listening to music, or just five minutes of quiet, I need to intentionally carve out some time for self-care to try and boost my happiness and stamina, even slightly.\n5.  **Reach out:** Maybe just a quick text to a friend, or a coffee break with someone. My social score is too low, and I know connecting with people helps.\n\nI know I have the knowledge, I just need to find a way to channel it without completely burning out. This week was a wake-up call.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states \"my stamina is practically non-existent\" and describes feeling \"exhaustion has been so overwhelming,\" \"running on fumes,\" and \"completely drained.\" This indicates an extremely low level of physical and mental energy.\n- **Knowledge**: The student clearly states, \"I know I've got a good grasp on the material\" and later reiterates, \"I know I have the knowledge.\" This suggests their understanding of the academic content remains strong despite other struggles.\n- **Stress**: Stress is very high due to \"deadlines looming,\" described as \"the elephant in the room\" and \"just a constant weight.\" The student feels \"always playing catch-up\" and overwhelmed by the \"sheer number of assignments.\"\n- **Happy**: Happiness is very low, as the student notes it's \"in the red\" and links it directly to their social isolation (\"My social life has taken a huge hit, which makes me feel a bit isolated. I haven't really connected with anyone this week, and that's probably contributing to the low happiness score\").\n- **Sleep**: Sleep is extremely low. The student states it's \"in the red,\" \"feels like a luxury I can't afford,\" and admits to \"sacrificing rest\" to \"cram in work whenever I can.\"\n- **Social**: The student's social life has \"taken a huge hit,\" they feel \"a bit isolated,\" and \"haven't really connected with anyone this week,\" explicitly stating \"My social score is too low.\""}
