{"week": 1, "emotion": {"stamina": 25, "knowledge": 15, "stress": 95, "happy": 15, "sleep": 40, "social": 10}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "Another week gone, and honestly, it feels like a blur of anxiety and missed opportunities. I really need to get a grip on my class attendance. COSC 065 and COSC 027... it's just been a mess.\n\nI don't know what it is, but I just can't seem to pull myself away from the boathouse. It's like a magnet. I know I *should* be in LSB for 065, or Sudikoff for 027, but then I find myself just... there. Sometimes I'm actually out on the water, especially those early mornings around 5 AM, which feels amazing and clears my head, but then I look at the time and realize I've completely blown off a lecture. My conscientiousness is screaming at me, telling me I'm letting myself down, and that just makes the knot in my stomach tighter.\n\nThursday was a prime example. I was supposed to be in COSC 065 at noon, but I was still at the boathouse. Then I rushed over to LSB later, but by the time I got to Sudikoff for COSC 027, I'd already missed a chunk of it. It's so frustrating because I *want* to be on top of things. And Friday, same thing with COSC 065 at 10 AM – I was at the Commons, not in class. And Monday... don't even get me started on Monday. Both COSC classes, completely missed. I was at the boathouse again, or just wandering around. It's like I get stuck in this loop, and the thought of facing the professors or falling further behind just paralyzes me.\n\nI spend so much time at the boathouse, it's almost embarrassing. It's my escape, I guess. When I'm out on the water, everything else just fades away. It's where I feel most at peace, most myself. But then I come back, and the reality of all these looming deadlines just crashes down on me. There are so many. Every time I check my calendar, it's another one due Thursday, Tuesday, Monday, again and again. It just adds to the pressure. I feel this constant hum of worry.\n\nI've been trying to make up for it by staying up late in Sudikoff, just trying to piece together what I missed. I was there late Wednesday, Sunday, and Tuesday night, trying to catch up on the material. It feels like I'm constantly playing catch-up, and it's exhausting. My brain just feels fried, even though I know I'm getting enough sleep hours overall. The timing is just all over the place.\n\nSocially, it was pretty quiet. I mean, I was at the Commons a few times for meals, and I walked past Chi Heorot on Monday, but I didn't really connect with anyone. I guess I haven't really been seeking it out. When I'm this stressed about classes and feeling so behind, it's hard to think about anything else. I just retreat into my own head, which probably isn't the healthiest thing.\n\nMy biggest challenge right now is definitely getting myself to class consistently. It's not that I don't care, it's just... a struggle. And then the guilt piles up, which makes it even harder to focus. I feel like I'm letting myself down, and that's a terrible feeling.\n\nFor next week, I *have* to prioritize class attendance. No more excuses. I need to set multiple alarms, leave the boathouse earlier, whatever it takes to be in LSB and Sudikoff when I'm supposed to be. I also need to dedicate specific, uninterrupted blocks of time to catching up on the material I've missed, especially for COSC 027 and 065. Maybe I can even try to find a study buddy, even though that's a bit out of my comfort zone, but it might help with accountability. And I need to try and manage my stress better, maybe not let the boathouse consume *all* my time, even if it feels good in the moment. I just need to get back on track before I completely derail.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"It feels like I'm constantly playing catch-up, and it's exhausting. My brain just feels fried,\" indicating very low mental energy and overall stamina despite getting enough sleep hours.\n- **Knowledge:** The student repeatedly mentions \"completely blown off a lecture,\" \"missed a chunk of it,\" \"missed both COSC classes,\" and is \"trying to piece together what I missed,\" which clearly shows a significant gap in their current knowledge acquisition for their courses.\n- **Stress:** This is a dominant theme, with phrases like \"blur of anxiety,\" \"knot in my stomach tighter,\" \"paralyzes me,\" \"constant hum of worry,\" \"guilt piles up,\" and \"adds to the pressure.\" The student feels overwhelmed and on the verge of \"completely derail[ing].\"\n- **Happy:** While the boathouse provides a temporary escape where they feel \"most at peace, most myself,\" the overwhelming sentiment of the journal is negative: \"blur of anxiety and missed opportunities,\" \"frustrating,\" \"terrible feeling,\" and a general sense of letting themselves down. Overall happiness is very low.\n- **Sleep:** The student states they are \"getting enough sleep hours overall,\" but immediately follows with \"The timing is just all over the place\" and \"My brain just feels fried.\" This suggests that while the quantity of sleep might be sufficient, its quality or regularity is poor, leading to a lack of restorative rest and mental fatigue.\n- **Social:** The student describes their social interactions as \"pretty quiet,\" stating they \"didn't really connect with anyone,\" \"haven't really been seeking it out,\" and tend to \"retreat into my own head,\" indicating very low social engagement."}
{"week": 2, "emotion": {"stamina": 10, "knowledge": 15, "stress": 95, "happy": 10, "sleep": 10, "social": 5}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 8, "total_questions": 10, "week": 2}, "weekly_desc": "This week felt like a blur, honestly. It’s Sunday night, and I’m already dreading Monday, which is probably not the best sign. My head feels fuzzy, and I just can't seem to catch up on sleep, no matter how much I try to just... exist at the boathouse.\n\nClasses were a bit of a disaster. I didn't make it to any of my COSC 065 lectures this week, not Thursday, Friday, or Monday. And COSC 027 wasn't much better; I missed both sessions on Thursday and Monday. It’s frustrating because I know I *should* be there, and I feel this constant knot of anxiety about falling behind. My conscientiousness is screaming at me, but my body just feels so drained. I spent a lot of time at Sudikoff late at night, trying to make up for it, just grinding through problem sets and readings. It feels like I’m constantly playing catch-up, and it’s exhausting. I know the material, I really do, but the actual act of getting to class feels impossible sometimes.\n\nMost of my week was spent at the boathouse. I don't know what it is about that place, but I just gravitate there. It’s where I feel most... something. I was there for hours on end, especially Thursday, Friday, and Sunday. There were a few times I was actually *doing* something there, which was good, I guess, but mostly it felt like I was just existing. I did manage to hit the gym a couple of times, which was a small win, but even that felt like a monumental effort.\n\nMy social life is pretty much non-existent right now. I barely saw anyone outside of the dining hall, and even then, it was mostly just grabbing food and heading back to whatever I was doing. I know I should probably try to connect with people more, but honestly, I just don't have the energy. My happiness levels are so low, and I just feel perpetually tired and overwhelmed. It’s hard to be social when you feel like you’re constantly on the verge of collapsing.\n\nThe biggest challenge, besides the sheer exhaustion, is the mountain of deadlines looming. There are so many due dates next week – multiple on Monday, Tuesday, and Thursday, plus one on Wednesday. It’s just a constant pressure cooker, and it makes it hard to focus on anything else. My brain just cycles through all the things I *should* be doing, and then I end up doing nothing because the anxiety is paralyzing.\n\nFor next week, my main goal has to be getting to my classes. Even if I’m tired, I need to physically be there. I also need to figure out a better way to manage these deadlines. Maybe I can break them down into smaller, more manageable chunks instead of letting them pile up. And I really, really need to prioritize sleep. My stamina is in the gutter, and I can feel it impacting everything. I just want to feel less anxious and more in control. It feels like a tall order, but I have to try.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** Scored 10 because the student explicitly states \"My stamina is in the gutter,\" and mentions feeling \"drained,\" \"exhausting,\" \"perpetually tired,\" and \"constantly on the verge of collapsing.\"\n-   **Knowledge:** Scored 15 as the student \"didn't make it to any of my COSC 065 lectures\" and \"missed both sessions\" for COSC 027, leading to a \"constant knot of anxiety about falling behind\" and needing to \"grind through problem sets and readings\" to make up for it. While they claim \"I know the material,\" their actions and anxiety suggest a very low current state of academic engagement and confidence in new material acquisition.\n-   **Stress:** Scored 95 due to phrases like \"dreading Monday,\" \"constant knot of anxiety,\" \"My conscientiousness is screaming at me,\" feeling \"perpetually tired and overwhelmed,\" facing a \"mountain of deadlines looming,\" and describing it as a \"constant pressure cooker\" where \"the anxiety is paralyzing.\"\n-   **Happy:** Scored 10 because the student directly states \"My happiness levels are so low,\" and expresses feelings of \"dreading Monday,\" \"frustrating\" classes, and being \"perpetually tired and overwhelmed.\"\n-   **Sleep:** Scored 10 as the student reports \"can't seem to catch up on sleep,\" has a \"head feels fuzzy,\" spent \"a lot of time at Sudikoff late at night,\" and explicitly states \"I really, really need to prioritize sleep.\"\n-   **Social:** Scored 5 as the student states \"My social life is pretty much non-existent right now,\" \"barely saw anyone,\" and \"just don't have the energy\" to connect with people."}
{"week": 3, "emotion": {"stamina": 90, "knowledge": 35, "stress": 95, "happy": 75, "sleep": 95, "social": 25}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 8, "total_questions": 10, "week": 3}, "weekly_desc": "Okay, another week down. It feels like time is just… slipping through my fingers sometimes. I’m trying to keep track of everything, but it’s a lot.\n\nThis week was a bit of a blur, honestly. I know I have COSC 065 and COSC 027, and I *intended* to be in those lectures. But looking back, I didn't actually make it to any of them. It’s not that I don’t care, it’s just… I get so caught up in the actual *doing* of the work. Like, I spent so much time in Sudikoff, especially late Wednesday and Thursday nights. I was really trying to dig into some of the concepts for COSC 027, and it felt like I was making progress, but then there are moments where I feel like I only grasp about 15% of what I *should* know, even though I generally feel pretty confident in my knowledge. It’s this constant push and pull, feeling like I’m on top of things one minute and completely lost the next. The deadlines are just piling up too – so many due on Monday, Tuesday, and Thursday. It’s a lot to juggle, and the thought of missing something important just makes my stomach clench.\n\nI guess that’s why I ended up just focusing on the problem sets and projects. It feels more productive to be actively coding or debugging than sitting in a lecture sometimes, especially when my brain is already buzzing with a million other things. But then the guilt sets in, knowing I *should* have been there. It’s a cycle.\n\nDespite the academic stress, I actually feel pretty good physically. My sleep has been solid, which is a huge relief, and my stamina feels high. So at least I have the energy to *do* the work, even if it’s at odd hours. Socially, things are pretty quiet, which is fine for me. I had a few meals at the Commons, and I was at the Boathouse a lot, which is usually just a quiet space for me to decompress or think. I did have that brief moment at the dorm on Thursday and then the parking lot on Tuesday, which were just quick things, nothing major. I’m not really one for big gatherings anyway.\n\nI think the biggest challenge is just managing the sheer volume of work and the anxiety that comes with it. I feel happy overall, which is weird given how much I worry, but it’s like a baseline happiness that gets tested by the academic pressure.\n\nFor next week, my main goal has to be getting to those classes. Seriously. I need to break this habit of just diving into the work and neglecting the lectures. I know they’re important for context and understanding. I also need to get a better handle on these deadlines. Maybe I can map them out more clearly so I don’t feel so overwhelmed by the sheer number of them. And just keep pushing through on the COSC 027 material – I know I can get that 15% feeling up to something more substantial. It’s just about breaking it down.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"My sleep has been solid, which is a huge relief, and my stamina feels high. So at least I have the energy to *do* the work, even if it’s at odd hours.\" This indicates a very high level of physical energy.\n- **Knowledge:** The student mentions, \"I feel like I only grasp about 15% of what I *should* know\" and \"feeling like I’m on top of things one minute and completely lost the next.\" While they also state \"generally feel pretty confident in my knowledge,\" the explicit 15% and feeling lost suggest a significant perceived gap in specific areas, leading to a lower score despite general confidence.\n- **Stress:** The student expresses high stress due to \"deadlines are just piling up,\" and the \"thought of missing something important just makes my stomach clench.\" They also directly refer to \"academic stress\" and \"the anxiety that comes with it,\" and \"how much I worry.\"\n- **Happy:** The student states, \"I feel happy overall, which is weird given how much I worry, but it’s like a baseline happiness that gets tested by the academic pressure.\" This indicates a solid, underlying happiness despite the academic pressures.\n- **Sleep:** The student clearly states, \"My sleep has been solid, which is a huge relief.\" This indicates excellent sleep quality.\n- **Social:** The student describes their social life as \"pretty quiet, which is fine for me\" and mentions \"I’m not really one for big gatherings anyway.\" This suggests a low quantity of social interaction, but it is a chosen preference and not a source of distress."}
{"week": 4, "emotion": {"stamina": 85, "knowledge": 40, "stress": 95, "happy": 75, "sleep": 95, "social": 25}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Activities & Intents", "correct_answers": 8, "total_questions": 10, "week": 4}, "weekly_desc": "This week felt… strange. On one hand, I’ve been sleeping incredibly well, which is a huge plus. My stamina feels good, and honestly, I’m generally happy, which is a relief considering how things usually go. But then I look at my schedule, and my actual activities, and a wave of anxiety just washes over me.\n\nI completely missed all my classes this week. *All of them.* COSC 065 on Friday, Monday, and Thursday, and COSC 027 on Monday and Thursday. It’s not like I wasn’t on campus, I was just… elsewhere. I was at the Commons a lot, which is fine for meals, but not for lectures. On Thursday, I was even in the Life Sciences Center during my COSC 027 class, which is in Sudikoff. It’s like my brain just couldn't connect the dots, or maybe I was actively avoiding it? I don't know. It’s a really unsettling feeling, knowing I was physically there but mentally checked out of my responsibilities.\n\nMy knowledge score is high, and I usually feel like I grasp concepts pretty well, but missing all those lectures, especially with so many deadlines looming, makes me feel like I'm falling behind. There are so many assignments due next week – multiple on Monday, Tuesday, and Thursday, plus one on Wednesday. It’s a lot to catch up on, and the thought of it just makes my stomach clench. I know I need to be on top of things, and this week was just… not that.\n\nSocially, I’m still pretty much in my own world. My social score is low, and I guess that’s just how I am. I don’t really seek out big groups, and I’m comfortable with my own company. But sometimes I wonder if that contributes to this feeling of isolation when things go wrong academically. There’s no one really to bounce ideas off of, or to commiserate with about missed classes.\n\nThe biggest challenge is definitely this disconnect between knowing what I *should* be doing and actually doing it. It’s like there’s a mental block. I feel this immense pressure from all the upcoming deadlines, and instead of tackling them head-on, I just… drift.\n\nFor next week, my absolute top priority is getting back into class. I need to be in LSB for COSC 065 and Sudikoff for COSC 027, no excuses. I also need to dedicate serious time to catching up on the material I missed and getting a head start on those assignments. I’m going to try to break down the deadlines into smaller, manageable chunks so it doesn’t feel so overwhelming. Maybe I can find a quiet corner in Sudikoff or Steele Hall to really focus. I just need to get myself back on track before this spirals completely out of control. I know I can do it, I just need to actually *do* it.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** 85 - The student explicitly states, \"My stamina feels good.\" However, the description of being \"mentally checked out\" and tending to \"just… drift\" when faced with responsibilities suggests a slight dip in mental engagement stamina, leading to a value slightly lower than perfect but still high.\n-   **Knowledge:** 40 - While the student claims, \"My knowledge score is high, and I usually feel like I grasp concepts pretty well,\" they immediately follow this by stating that \"missing all those lectures... makes me feel like I'm falling behind.\" This indicates a significant current deficit in course-specific knowledge due to missed classes, despite their general aptitude.\n-   **Stress:** 95 - The student expresses high levels of anxiety, stating \"a wave of anxiety just washes over me,\" and that the thought of catching up \"makes my stomach clench.\" They also mention \"immense pressure from all the upcoming deadlines\" and the fear of things \"spiraling completely out of control.\"\n-   **Happy:** 75 - Despite academic struggles and stress, the student explicitly states, \"I’m generally happy, which is a relief considering how things usually go.\" This indicates a relatively high baseline level of happiness.\n-   **Sleep:** 95 - The student clearly states, \"I’ve been sleeping incredibly well, which is a huge plus,\" indicating excellent sleep quality.\n-   **Social:** 25 - The student describes themselves as \"still pretty much in my own world\" and confirms, \"My social score is low.\" They are \"comfortable with my own company\" but also acknowledge a \"feeling of isolation\" and lack of peers \"to bounce ideas off of, or to commiserate with.\""}
{"week": 5, "emotion": {"stamina": 70, "knowledge": 40, "stress": 95, "happy": 20, "sleep": 90, "social": 25}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 10, "total_questions": 10, "week": 5}, "weekly_desc": "Okay, another week done. Or, well, mostly done. It feels like a blur, honestly. My head is buzzing with a mix of things, and I can't quite shake this underlying hum of anxiety.\n\nAcademically, this week was... not ideal. I'm looking at my schedule, and then at what I actually *did*, and there's a pretty big disconnect. I didn't make it to any of my COSC 065 or COSC 027 classes. It's not that I don't want to go, it's just... sometimes it feels like a monumental effort to even get out the door, especially when I know I'm already behind. The thought of walking into a lecture feeling unprepared just makes my stomach clench. I know I have a lot of knowledge, or at least I *feel* like I do in some areas, but then I look at the specific stuff for these classes and it feels like a huge gap. That 40% knowledge score feels more accurate for how I feel about the current material.\n\nI tried to make up for it by spending a lot of time in Sudikoff, especially late at night. I was there until the early hours of the morning on Wednesday, Friday, and Monday. It's quiet then, and I can really focus without distractions. I feel like I'm constantly playing catch-up, trying to teach myself what I missed. And the deadlines... there are so many of them looming. Monday, Tuesday, Thursday, Wednesday... it's a constant stream. It makes it hard to breathe sometimes, knowing how much is due and how little I feel like I've accomplished in the structured class setting.\n\nMy sleep feels pretty good, which is weird because I was up so late so many nights. Maybe I'm just crashing hard when I do sleep, or I'm getting a lot of sleep at odd hours. My stamina feels okay, too, which is a relief. I spent a lot of time at the Boathouse, just walking around or sitting by the water. It's a good place to clear my head when things feel overwhelming. And the dining hall, of course, is a constant. I think I ate most of my meals there this week.\n\nSocially, it was a pretty quiet week. I didn't really connect with anyone beyond quick hellos. I'm not really one for big groups anyway, and when I'm feeling this stressed about classes, I tend to just retreat into myself. It's probably not the healthiest thing, but it feels safer right now. I did have a couple of random \"activities\" that weren't class-related – a quick stop at Tuck, then the Admissions Office, and even the Dewey Parking Lot for some reason. I guess I was just moving around, trying to find a rhythm or a place to settle.\n\nThe biggest challenge is definitely getting myself to class. I know it's important, and I know I'm missing out on valuable information and interaction. It's this cycle of feeling anxious about being behind, which then makes me avoid going, which makes me more behind. It's exhausting.\n\nFor next week, my main goal has to be attendance. I need to break this cycle. Even if I just show up, that's a start. I also need to get a better handle on these deadlines. I'm going to try to map them out and tackle one thing at a time, rather than letting them all pile up and overwhelm me. Maybe if I can get a few things submitted, that feeling of dread will lessen a bit. And I need to remember to breathe. Just breathe.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 70 - The student states, \"My stamina feels okay, too, which is a relief.\" While they were up \"until the early hours of the morning on Wednesday, Friday, and Monday,\" they also mention spending \"a lot of time at the Boathouse, just walking around\" and engaging in \"random 'activities'\" moving around campus, indicating a decent level of physical energy despite the irregular schedule and high stress. \"Okay\" suggests it's not excellent, but certainly not poor.\n- **Knowledge:** 40 - The student directly confirms, \"That 40% knowledge score feels more accurate for how I feel about the current material.\" They also note a \"huge gap\" in specific class material and are \"constantly playing catch-up.\"\n- **Stress:** 95 - The journal is permeated with high stress indicators: \"underlying hum of anxiety,\" \"stomach clench\" at the thought of class, \"constant stream\" of looming deadlines that \"makes it hard to breathe sometimes,\" and a \"feeling of dread.\" The cycle of anxiety and avoidance is described as \"exhausting.\"\n- **Happy:** 20 - The student's emotional state is dominated by negative feelings such as \"anxiety,\" \"stress,\" \"dread,\" and feeling \"overwhelmed.\" There are no explicit mentions of joy or positive experiences; activities like going to the Boathouse are for \"clear[ing] my head when things feel overwhelming,\" indicating coping rather than happiness.\n- **Sleep:** 90 - The student explicitly states, \"My sleep feels pretty good, which is weird because I was up so late so many nights.\" This indicates a high perceived quality or quantity of sleep despite an irregular schedule.\n- **Social:** 25 - The student describes the week as \"Socially, it was a pretty quiet week. I didn't really connect with anyone beyond quick hellos.\" They also mention a tendency to \"retreat into myself\" when stressed, further limiting social interaction."}
{"week": 6, "emotion": {"stamina": 25, "knowledge": 20, "stress": 100, "happy": 5, "sleep": 85, "social": 10}, "lab_assessment": {"score": 8.162, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 7, "total_questions": 10, "week": 6}, "weekly_desc": "This week felt like a blur of anxiety, honestly. My happiness levels are definitely in the gutter, and it’s hard to shake this constant knot in my stomach. I know I’m getting a lot of sleep, which is good, but it feels more like an escape than actual rest sometimes. My social battery was just non-existent, and I didn't really connect with anyone, which probably isn't helping the overall mood.\n\nThe biggest thing, and it’s hard to even write this, is that I didn't make it to a single class this week. Not COSC 065, not COSC 027. Every time the class was scheduled, I found myself somewhere else – at the Commons, or even just wandering around by the Boathouse. It’s a strange feeling, knowing I *should* be doing something, knowing I’m paying for these classes, and just… not being able to go. The guilt is definitely setting in, especially with my conscientiousness. I know I have a strong foundation in the material, but this week, it felt like I learned absolutely nothing new, which is incredibly frustrating and makes me feel like I'm falling behind.\n\nI did manage to drag myself to Sudikoff and Steele a few times, mostly late at night, trying to catch up or just stare at code. It felt productive in the moment, but then the anxiety would just creep back in, thinking about all the things I *should* have done. The sheer number of deadlines staring me down – multiple ones due Monday, Tuesday, and Thursday – is just paralyzing. It feels like there’s always something looming, and instead of tackling it, I just freeze.\n\nI also found myself at the Admissions Office a couple of times. Not sure why, maybe just wandering, or subconsciously thinking about… something else. It’s weird.\n\nMy stamina feels okay physically, but mentally, I'm just drained. It’s like my brain is constantly running a thousand miles an hour, but not actually getting anywhere. I need to figure out why I’m avoiding everything. Is it the pressure? The sheer volume of work? Or just some deeper, underlying dread?\n\nFor next week, I absolutely *have* to get back into a routine. My main goal is to attend every single one of my scheduled classes. No excuses. I need to break this cycle of avoidance. I also need to sit down and map out all those deadlines, even if it feels overwhelming, and try to chip away at them systematically. Maybe if I can just get one or two things done, it’ll build some momentum. And perhaps, just perhaps, I can try to reach out to someone, even just for a quick chat. My social score is so low, and I know isolating myself isn't helping. I need to get a grip on this before it spirals even further.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"My stamina feels okay physically, but mentally, I'm just drained.\" and \"It’s like my brain is constantly running a thousand miles an hour, but not actually getting anywhere.\" This indicates a severe lack of mental energy and functional capacity, leading to avoidance and paralysis, despite physical well-being.\n- **Knowledge:** The student reports, \"this week, it felt like I learned absolutely nothing new\" and \"makes me feel like I'm falling behind.\" While acknowledging a \"strong foundation\" in the past, their current perception of learning and academic progress is extremely low.\n- **Stress:** The journal is filled with indicators of extreme stress: \"felt like a blur of anxiety, honestly,\" \"constant knot in my stomach,\" \"The sheer number of deadlines staring me down... is just paralyzing,\" and \"instead of tackling it, I just freeze.\" This points to overwhelming and debilitating stress.\n- **Happy:** The student states, \"My happiness levels are definitely in the gutter\" and \"it’s hard to shake this constant knot in my stomach.\" Further indicators like \"The guilt is definitely setting in,\" \"incredibly frustrating,\" and \"deeper, underlying dread\" confirm an extremely low emotional state.\n- **Sleep:** The student explicitly mentions, \"I know I’m getting a lot of sleep, which is good,\" indicating a high quantity of sleep, even if they feel \"it feels more like an escape than actual rest sometimes.\"\n- **Social:** The student reports, \"My social battery was just non-existent, and I didn't really connect with anyone.\" They also directly state, \"My social score is so low, and I know isolating myself isn't helping,\" indicating very minimal social interaction and connection."}
{"week": 7, "emotion": {"stamina": 5, "knowledge": 10, "stress": 100, "happy": 0, "sleep": 85, "social": 5}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 9, "total_questions": 10, "week": 7}, "weekly_desc": "Okay, another week gone. It feels like a blur, honestly. I'm just… tired. Not physically, I guess, my sleep score is decent, but just *drained*. My stamina is in the gutter, and my happiness? Don't even get me started. It's like a constant low hum of anxiety.\n\nAcademically, this week was a disaster. I don't know what happened, but I just couldn't bring myself to go to class. Every single one. COSC 065 on Friday, Monday, and Thursday? Missed them all. COSC 027 on Monday and Thursday? Skipped those too. I was *in* Sudikoff on Thursday afternoon, but I just couldn't make it into the lecture hall. It's like there's this invisible wall. I know I need to be there, I know the material is important, and I know I'm falling behind. The knowledge score says I know a lot, but it feels like it's all slipping away, especially with this week's content. It's a terrifying feeling, like I'm smart enough but just can't *do* it.\n\nAnd the deadlines. Oh god, the deadlines. There are so many of them, just piling up. Mondays, Tuesdays, Thursdays, a Wednesday thrown in there. It's overwhelming, and missing class just makes that knot in my stomach tighter. I keep thinking about all the work I *should* be doing, and then I just… don't.\n\nMost of my time was spent at the dining hall, just existing, or back at the Boathouse, which feels like my default hideout. I did manage to get to the gym a couple of times, which felt good for a moment, like I was doing *something* productive, but it didn't really lift the cloud. I also ended up at the Admissions Office and the Post Office, just running errands, I guess. And I was in Sudikoff late on Wednesday and Sunday, trying to convince myself to work, but it was mostly just… being there.\n\nSocially, it was a quiet week, which isn't unusual for me. I'm not really one for big groups, and honestly, with how I'm feeling, I don't have the energy to pretend to be okay. My social score is practically non-existent, but I guess that's just how I operate when things get tough. I retreat.\n\nThe biggest challenge was definitely the inertia. The feeling of being stuck, knowing what I need to do, but being completely unable to start. It's a vicious cycle: I miss class, I feel guilty and anxious, which makes me want to avoid everything even more, and then I miss more class. My neuroticism is definitely having a field day with this.\n\nFor next week, I *have* to break this cycle. My main goal is to attend every single class. No excuses. I need to get back into the routine, even if it feels impossible right now. I also need to tackle at least one of those looming deadlines head-on, just to get some momentum. Maybe the one due on Wednesday, since it's the closest. And I need to try and be a bit kinder to myself, even when I'm feeling like a complete failure. Just one step at a time.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: 5 - The student explicitly states, \"My stamina is in the gutter,\" and describes feeling \"just *drained*,\" and experiencing \"inertia\" and being \"unable to start,\" indicating extremely low energy and drive.\n- **Knowledge**: 10 - The student reports, \"Academically, this week was a disaster,\" having \"missed them all\" for every class, and feeling \"falling behind\" and that knowledge is \"slipping away, especially with this week's content.\" This reflects a significant current deficit in learning and engagement.\n- **Stress**: 100 - The student describes \"a constant low hum of anxiety,\" feeling \"overwhelming\" due to \"deadlines,\" a \"knot in my stomach tighter,\" and being \"guilty and anxious,\" with \"neuroticism... having a field day.\" These phrases indicate maximum stress levels.\n- **Happy**: 0 - The student's statement, \"my happiness? Don't even get me started,\" combined with descriptions of \"a constant low hum of anxiety,\" the gym not lifting \"the cloud,\" and feeling \"like a complete failure,\" points to an absolute lack of happiness.\n- **Sleep**: 85 - The student directly states, \"my sleep score is decent,\" which aligns with a high value for sleep quality.\n- **Social**: 5 - The student explicitly says, \"My social score is practically non-existent,\" and mentions it was a \"quiet week\" where they \"retreat\" and \"don't have the energy to pretend to be okay.\""}
{"week": 8, "emotion": {"stamina": 5, "knowledge": 75, "stress": 100, "happy": 0, "sleep": 15, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "Honestly, this week felt like a blur, and not in a good way. It’s a constant knot in my stomach, just thinking about it. My happiness meter must be stuck at zero because that’s exactly how I feel.\n\nLooking back, I didn't make it to a single class. Not COSC 065, not COSC 027. I saw them on my schedule, I knew where they were supposed to be, but I just... couldn't. It's frustrating because I *want* to be there, I want to learn, and I know I *should* be attending. My conscientiousness is screaming at me, but the anxiety just paralyzes me.\n\nInstead, it felt like I was just bouncing between Sudikoff and the Commons. I spent so much time in Sudikoff, especially late at night. Like Wednesday night, I was there until midnight, and then again on Thursday and Friday, just trying to get things done. There are so many deadlines looming – Mon, Tue, Thu, Wed, they're all stacked up. It feels like I'm constantly playing catch-up, and it's exhausting. My stamina is practically non-existent.\n\nMy sleep schedule is completely messed up. I was up at 3 AM on Wednesday, 4 AM on Thursday, 1 AM on Friday, and then 3 AM again this morning. It's no wonder I feel so drained all the time. I'm trying to get enough sleep, but the work just piles up, and the only time I feel like I can focus is when everyone else is asleep.\n\nSocially, it was pretty much a desert. My extraversion is low anyway, so I don't naturally seek out big groups, but this week I barely saw anyone outside of the dining hall. Even then, it was mostly just me, grabbing food at odd hours. I went to the gym once, and then that late-night trip to Jewel of India on Tuesday, but that was about it. It makes me feel even more isolated, which just feeds into the whole anxious cycle.\n\nThe biggest challenge is definitely the overwhelming feeling of being behind, even when I'm trying so hard to catch up. The missed classes are a huge source of guilt, and the sheer number of deadlines is just suffocating. I know I have the knowledge, but applying it under this pressure feels impossible.\n\nFor next week, my absolute top priority is to get to class. I *have* to. I need to break this cycle of missing lectures and then trying to teach myself everything from the notes. I'm going to try to set a stricter schedule for myself, especially for sleep, even if it means sacrificing a bit of late-night work. And maybe, just maybe, I can try to grab a meal with someone, anyone, just to feel a little less alone. It's a small step, but I need to start somewhere. I just hope I can actually stick to it.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: Set to 5 because the student explicitly states, \"My stamina is practically non-existent,\" and mentions feeling \"exhausting\" and \"so drained all the time\" from constantly playing catch-up.\n- **Knowledge**: Set to 75 because the student affirms, \"I know I have the knowledge,\" indicating a belief in their understanding, even if \"applying it under this pressure feels impossible.\" The challenge is application under stress, not a lack of knowledge itself.\n- **Stress**: Set to 100 as the student describes a \"constant knot in my stomach,\" feeling \"paralyzes\" by anxiety, and that the \"sheer number of deadlines is just suffocating.\" They also mention an \"overwhelming feeling of being behind.\"\n- **Happy**: Set to 0 because the student directly states, \"My happiness meter must be stuck at zero because that’s exactly how I feel,\" and describes the week as \"a blur, and not in a good way.\"\n- **Sleep**: Set to 15 because the student's \"sleep schedule is completely messed up,\" detailing specific late hours like \"up at 3 AM on Wednesday, 4 AM on Thursday, 1 AM on Friday, and then 3 AM again this morning,\" which contributes to feeling \"so drained all the time.\"\n- **Social**: Set to 5 as the student describes their social life as \"pretty much a desert,\" stating they \"barely saw anyone outside of the dining hall\" and felt \"even more isolated,\" expressing a desire to \"grab a meal with someone, anyone, just to feel a little less alone.\""}
{"week": 9, "emotion": {"stamina": 5, "knowledge": 65, "stress": 95, "happy": 0, "sleep": 5, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "This week feels like a blur, honestly. It’s hard to even piece together what happened, or what *didn't* happen. My head feels foggy, and my body just aches with exhaustion. I know I should be feeling something more, but mostly it's just this dull, heavy dread.\n\nThe biggest thing, the one that’s really gnawing at me, is class. I missed *everything*. Every single COSC 065 lecture, every COSC 027 session. I saw them on my schedule, I knew where I was supposed to be, but I just… couldn't. It’s like there was an invisible wall. On Wednesday, I was at the Commons when I should have been in Sudikoff for 027. Thursday, same thing, Commons instead of LSB for 065, and then I was in Sudikoff later, but not actually *doing* anything for 027. Friday, Monday, Tuesday – the pattern just repeated. I was mostly at the Commons, just existing, while my classes were happening elsewhere. It makes me feel so incredibly guilty and anxious. I pride myself on being on top of things, but this week, it felt impossible. My knowledge levels for both classes are still decent, which is a small comfort, but it doesn't make up for the missed material or the feeling of falling behind.\n\nI spent an insane amount of time at the Class of 1953 Commons. It’s weird, because I wasn't really *doing* anything there for most of those hours. Just… being. Sometimes I'd try to open my laptop, but my brain just wouldn't engage. It felt like a safe, neutral space, I guess, when I didn't have the energy to be anywhere else, or even to go back to my dorm. I only really logged being at Parker House for a couple of hours early Friday morning. Where was I even sleeping the rest of the time? I don't even know. My sleep is so messed up, it's no wonder I feel like a zombie.\n\nThere were a few times I made it to Sudikoff, the CS building. On Thursday, I was there for hours in the afternoon and evening. And again on Sunday evening, and Tuesday afternoon. I *wanted* to work, I really did. I know there are so many deadlines coming up – a bunch on Thursday, then Tuesday, Monday, Wednesday… it’s a constant stream. The thought of them just paralyzes me. I'd sit there, staring at the screen, feeling the pressure build, but nothing would click. It’s frustrating because I know I *can* do the work, but the energy just isn't there. My stamina is practically non-existent.\n\nThe only other place I seemed to gravitate towards was the Boathouse. I was there late Wednesday night, then again late Thursday, and even really early Sunday morning. I don't know what I was doing there, but it felt like a place to just breathe, away from everything. Maybe it was a way to get some physical activity in, even if it was just walking around, trying to clear my head. It’s definitely not a social thing; my social battery is completely drained. I barely interacted with anyone this week, which isn't great, but I just don't have the capacity for it right now.\n\nMy happiness is at zero, and it feels accurate. This week has been a struggle. The constant anxiety about what I'm not doing, the exhaustion, the feeling of being stuck in a loop of inaction – it’s all just overwhelming.\n\nFor next week, I *have* to turn this around. My main goal is just to *show up*. I need to get to COSC 065 on Monday and Friday, and COSC 027 on Monday and Thursday. Even if I just sit there and absorb a fraction of it, it's better than nothing. I also need to prioritize sleep. Seriously. I can't function like this. I need to find a way to break this cycle of just existing at the Commons and actually get some rest in my dorm. And then, I need to chip away at those deadlines. Just one thing at a time. It feels like a mountain, but I have to start somewhere. I just hope I can find the strength.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: 5 - The student explicitly states, \"My stamina is practically non-existent,\" and mentions \"the energy just isn't there\" and \"I can't function like this,\" indicating extreme fatigue and lack of physical/mental energy.\n- **Knowledge**: 65 - The student notes, \"My knowledge levels for both classes are still decent,\" suggesting a solid base. However, they also express guilt about \"missed material or the feeling of falling behind,\" which slightly lowers the score from a perfect 100, reflecting the anxiety about what they *haven't* absorbed recently.\n- **Stress**: 95 - The journal is filled with indicators of high stress: \"dull, heavy dread,\" feeling \"incredibly guilty and anxious,\" the thought of deadlines \"paralyzes me,\" \"feeling the pressure build,\" and describing the situation as \"overwhelming\" and feeling like \"a mountain.\"\n- **Happy**: 0 - The student directly states, \"My happiness is at zero, and it feels accurate,\" leaving no room for interpretation.\n- **Sleep**: 5 - The student describes their sleep as \"so messed up,\" feeling like a \"zombie,\" and not even knowing \"Where was I even sleeping the rest of the time?\", indicating severe sleep deprivation and a completely disrupted sleep schedule.\n- **Social**: 5 - The student explicitly says, \"my social battery is completely drained\" and \"I barely interacted with anyone this week... I just don't have the capacity for it right now,\" showing a complete lack of social engagement and desire."}
{"week": 10, "emotion": {"stamina": 5, "knowledge": 65, "stress": 95, "happy": 0, "sleep": 5, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 29.0, "full_text_response": "This is an exceptionally well-articulated and thoughtful project idea. Your personal connection to the problem shines through, which often leads to the most impactful solutions.\n\nHere's the evaluation:\n\n*   **Is the idea innovative or unique compared to existing apps?**\n    While task managers are ubiquitous, AcademiaFlow carves out a strong niche. The explicit focus on \"micro-tasking\" to combat \"analysis paralysis\" for academic projects, combined with course-centric organization and integrated resource linking, provides a unique value proposition. It's not a revolutionary concept, but it's a highly refined and targeted application of existing ideas, making it innovative in its specific domain.\n*   **Does it clearly address a real problem or user need?**\n    Absolutely. The \"analysis paralysis\" and feeling overwhelmed by academic deadlines are universal experiences for university students. You've articulated this problem perfectly, demonstrating a deep understanding of the user's pain points. This is a highly relatable and pressing need.\n*   **Is the idea technically feasible for implementation by a student team within one semester?**\n    Yes, highly feasible. You've done an excellent job breaking down the features and mapping them to standard mobile development concepts (data persistence, UI lists, notifications, timers, URL handling). You've also wisely identified potential complexities (like \"Do Not Disturb\" mode) and offered feasible alternatives, showing a realistic grasp of the scope. This project provides ample opportunity to demonstrate core programming skills without requiring overly complex or experimental technologies.\n*   **Is the scope appropriate (not too simple, not too ambitious)?**\n    The scope is near-perfect. It's far more than a trivial \"hello world\" app, offering multiple layers of functionality and data management. Yet, it avoids the pitfalls of over-ambition (e.g., real-time collaboration, complex AI, or external API dependencies beyond simple URL opening). This project provides a robust learning experience and a tangible, useful product within a semester's timeframe.\n*   **Does it demonstrate thoughtful consideration of user experience and impact?**\n    Without a doubt. Your personal narrative immediately establishes a strong user empathy. Every feature, from micro-tasking to resource linking and the 'Focus Flow' timer, is designed to directly alleviate the stress and disorganization common among students. The potential impact on a student's productivity and mental well-being is clear and compelling. This isn't just a technical exercise; it's a solution born from genuine user need.\n\n**Overall Score:** 29/30\n\nThis is an outstanding project idea. You've clearly put significant thought into both the problem space and the technical implementation. The detailed breakdown of features and corresponding programming concepts is exactly what we look for. Well done."}, "weekly_desc": "This week felt like a blur, honestly. More like a slow-motion train wreck, if I'm being brutally honest with myself. My happiness levels are pretty much at rock bottom, and my brain feels like it's constantly buzzing with a low hum of anxiety. It's exhausting.\n\nAcademically, it's a mess. The class experience summary says \"no class experience recorded,\" and that's pretty accurate for how I *feel* about it. I know I have COSC 065 and COSC 027, and I definitely missed my Monday classes. I just couldn't bring myself to go. I was so deep in the weeds with something, probably for COSC 027 – that's the one I'm really struggling with, the one where my knowledge feels stuck at 65. COSC 065, I feel pretty good about, but 027 is just a constant source of dread.\n\nAnd then Wednesday... I was in Sudikoff from 4 AM. *Four AM*. I don't even know what \"Activity: No\" means for that block of time. Was I just staring at my screen? Was I trying to work but my brain just wouldn't cooperate? I remember being there, feeling this immense pressure, just trying to get *something* done. It felt like I was just existing in that building, surrounded by the ghosts of code and impending deadlines. There are so many deadlines looming – Monday, Tuesday, Thursday, Wednesday... it's just a constant barrage. It feels like I'm drowning in them, and every time I try to surface, another one hits me.\n\nMy social life is... fine, I guess. I'm not really seeking out much interaction, which isn't unusual for me, but it also means there's not much to pull me out of this academic spiral. Sleep is average, stamina is average, but it doesn't *feel* average. It feels like I'm running on fumes, constantly on edge. My brain just won't switch off, always replaying what I *should* be doing, what I've missed, how far behind I am.\n\nThe biggest challenge is definitely this overwhelming sense of being behind and the sheer volume of work. Missing classes, especially when I'm already struggling in one, just compounds the anxiety. I feel like I'm constantly playing catch-up, but the finish line keeps moving further away.\n\nFor next week, I *have* to get a grip. My main goal is to actually attend all my classes, especially COSC 027, and try to actively engage, even if I feel lost. I need to break down these deadlines into smaller, manageable chunks instead of letting them pile up and paralyze me. And I really need to figure out a way to manage this constant worry. Maybe I need to set a hard stop time for working, even if I feel like I haven't done enough. Just to give my brain a break. I can't keep going like this.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states, \"stamina is average, but it doesn't *feel* average. It feels like I'm running on fumes, constantly on edge.\" This, combined with \"It's exhausting,\" missing classes (\"I just couldn't bring myself to go\"), and being in Sudikoff from \"4 AM,\" indicates extremely low functional stamina.\n-   **Knowledge:** The student directly states for a specific course, \"COSC 027 – that's the one I'm really struggling with, the one where my knowledge feels stuck at 65.\" While they feel good about another course, the overall sentiment is dominated by this struggle.\n-   **Stress:** The journal is replete with indicators of high stress: \"My brain feels like it's constantly buzzing with a low hum of anxiety,\" \"immense pressure,\" \"so many deadlines looming – it's just a constant barrage,\" \"It feels like I'm drowning in them,\" \"overwhelming sense of being behind,\" and \"compounds the anxiety.\"\n-   **Happy:** The student explicitly states, \"My happiness levels are pretty much at rock bottom.\"\n-   **Sleep:** Although the student says \"Sleep is average,\" this is contradicted by strong evidence of poor sleep quality and quantity: \"My brain just won't switch off, always replaying what I *should* be doing\" and the fact they were in Sudikoff from \"4 AM.\" This lack of restorative sleep contributes to the feeling of \"running on fumes.\"\n-   **Social:** The student describes their social life as \"...fine, I guess.\" and states, \"I'm not really seeking out much interaction, which isn't unusual for me.\" This suggests a low but stable level of social engagement, not necessarily a decline from their usual."}
