{"week": 1, "emotion": {"stamina": 95, "knowledge": 10, "stress": 95, "happy": 10, "sleep": 95, "social": 20}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "This week felt... off. I know I had a full schedule, and looking back, it's pretty clear I didn't stick to it at all. It's frustrating, honestly, because I *want* to be on top of things, but somehow the days just slipped away from me.\n\nI completely missed all my classes this week. Every single one. CHIN, COSC 065, COSC 089, TUCK... I was supposed to be in Reed, LSB, Sudikoff, Carson, and I just... wasn't. Or if I was in the building, it was at the wrong time, or I wasn't actually engaged. Like, I was at Reed on Wednesday and Thursday, but way after my Chinese class. And I was at LSB on Monday, but again, not for COSC 065. It's like I was orbiting around where I *should* be, but never quite landing. I even ended up at Sudikoff super early Friday morning, which makes no sense for a class. I don't know what I was doing there.\n\nMost of my time was spent in Parker House, which is just my dorm. It feels like I was hiding away, even though I know I shouldn't be. I did get out a bit – spent some time at the Boathouse, which is always a good escape, and even got some activity in there on Saturday, Sunday, and Tuesday. I also found myself at the Admissions Office a couple of times, and visited Bartlett Hall. So I wasn't completely holed up, but it wasn't for productive academic reasons.\n\nThe weirdest part is, I'm not even physically tired. My sleep and stamina are actually pretty good. But mentally? It's a mess. There's this constant hum of anxiety, especially with all these deadlines piling up. I've got so many things due on Monday and Friday, and even some on Tuesday and Wednesday next week. Knowing I've missed a whole week of lectures just makes that knot in my stomach tighter. I feel this immense pressure to catch up, but it's almost paralyzing.\n\nI really need to get a grip. For next week, my absolute top priority is getting back into the classroom. I need to attend every single one of my scheduled classes. No more excuses, no more just being *near* the building. I also need to start chipping away at these assignments. I'm going to make a detailed plan for each deadline and try to stick to it. And maybe, just maybe, I can figure out why I'm avoiding things so much. This level of stress isn't sustainable.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 95 - The student explicitly states, \"My sleep and stamina are actually pretty good,\" indicating high physical energy levels.\n- **Knowledge:** 10 - The student reports, \"I completely missed all my classes this week. Every single one,\" and expresses concern that \"Knowing I've missed a whole week of lectures just makes that knot in my stomach tighter,\" indicating a significant lack of academic engagement and knowledge acquisition for the week.\n- **Stress:** 95 - The student describes \"this constant hum of anxiety, especially with all these deadlines piling up,\" feeling \"immense pressure to catch up, but it's almost paralyzing,\" and concludes, \"This level of stress isn't sustainable,\" all pointing to extremely high stress levels.\n- **Happy:** 10 - The overall tone is negative, with phrases like \"This week felt... off,\" \"It's frustrating, honestly,\" and feeling \"paralyzing\" pressure, suggesting a very low state of happiness or contentment.\n- **Sleep:** 95 - The student directly states, \"My sleep and stamina are actually pretty good,\" indicating sufficient and restful sleep.\n- **Social:** 20 - The student mentions, \"Most of my time was spent in Parker House, which is just my dorm. It feels like I was hiding away,\" suggesting a significant withdrawal from social interaction, despite some non-academic outings."}
{"week": 2, "emotion": {"stamina": 15, "knowledge": 60, "stress": 98, "happy": 5, "sleep": 85, "social": 8}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 9, "total_questions": 10, "week": 2}, "weekly_desc": "This week felt… heavy. Like I was moving through thick mud, even when I wasn't actually moving at all. My schedule was packed with classes, but looking back, it’s clear I barely made it to any of them. I saw the \"No class experience recorded this week\" summary, and honestly, it just confirmed what I already knew, but it still hit hard.\n\nWednesday started the pattern. I had CHIN 033, COSC 065, and COSC 089 all lined up, but I just couldn't get myself out of Parker House. It felt like a physical weight keeping me in bed. I know I *should* have been in Reed, then LSB, then Sudikoff, but the thought of facing everyone, of being behind, it just paralyzed me. I did manage to get out later, heading to LSB and then Sudikoff in the afternoon, trying to make up for lost time, I guess. I was there pretty late too, until 2 or 3 AM, just trying to get some COSC work done. It’s a constant battle between knowing what I need to do and actually being able to do it.\n\nThursday was even worse. Another full day of classes missed – CHIN 033, COSC 065, TUCK 003. I spent almost the entire day cooped up in my dorm. I felt this immense pressure, but it just made me want to hide more. I did get out to the Boathouse for a bit in the late afternoon, just to get some air, but it wasn't for anything specific, just needed to clear my head.\n\nFriday, same story. Missed all my morning classes again. CHIN 033, COSC 065, COSC 089. It’s like a broken record. I was in Parker House all morning. I did make it to LSB in the afternoon, and then the Boathouse again, but it felt more like I was just drifting, not really accomplishing anything.\n\nThe weekend was mostly spent in the dorm too, except for a few hours at Sudikoff on Saturday afternoon. I was trying to chip away at some assignments, but it felt like I was just treading water.\n\nAnd then Monday, the cycle repeated. Missed CHIN 033, COSC 065, COSC 089. I was in Parker House for most of the day, except for a brief trip to Reed and LSB in the early afternoon. I don't even know what I was doing there, just wandering, I think. The early morning trip to the Boathouse on Monday was weird, I just couldn't sleep, even though my sleep tracker says I'm getting plenty. It's like my body is rested, but my mind is just racing.\n\nTuesday was the absolute worst. I didn't leave Parker House until late at night. Missed CHIN 033, COSC 089, TUCK 003. All of them. I just couldn't face it. I ended up at Sudikoff again really late, working until 3 AM. It’s this awful loop: I get anxious about falling behind, which makes me not want to go to class, which makes me fall further behind, which makes me even more anxious.\n\nMy happiness is at an all-time low. I feel so isolated. My social score is abysmal, and it's my own fault, I know. I'm not reaching out, and I'm not showing up. It's hard to connect with people when you're constantly feeling like you're failing. The sheer number of deadlines coming up – so many on Monday and Friday, plus a few on Tuesday and Wednesday – it’s just overwhelming. I feel like I have all this knowledge, but I can't seem to apply it or even get myself to the places where I'm supposed to be learning more.\n\nMy biggest challenge right now is just getting out of my dorm and into class. It feels like such a simple thing, but it's become this huge hurdle. I'm worried about what my professors think, and I'm worried about how much I'm missing.\n\nFor next week, my goals are simple, but they feel monumental.\n1.  **Attend every single class.** No excuses. I need to break this cycle. Even if I just sit there, I need to be present.\n2.  **Prioritize the upcoming deadlines.** I need to make a concrete plan for each of those assignments, especially the COSC ones. The late nights at Sudikoff aren't sustainable if I'm not even going to class during the day.\n3.  **Try to engage, even a little.** Maybe ask one question in class, or just say hi to someone. My social life is non-existent, and while I don't feel like being a social butterfly, I need to at least try to feel less like a hermit.\n4.  **Find a way to manage this anxiety.** It's crippling. I'm sleeping a lot, and I have stamina, but it's not translating into mental well-being. I need to figure out how to stop this spiral.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student describes feeling \"heavy\" and \"moving through thick mud,\" indicating a profound lack of energy and motivation to act. They explicitly state, \"I just couldn't get myself out of Parker House. It felt like a physical weight keeping me in bed,\" demonstrating an inability to perform basic tasks like attending class, despite later mentioning \"I have stamina.\" This suggests a severe deficit in functional or mental stamina.\n-   **Knowledge**: The student states, \"I feel like I have all this knowledge,\" indicating a perceived understanding of their current academic material. However, they immediately follow this by saying, \"but I can't seem to apply it or even get myself to the places where I'm supposed to be learning more,\" suggesting a functional barrier to utilizing or expanding their knowledge, rather than a lack of foundational understanding.\n-   **Stress**: The student uses strong language to describe their stress, stating they were \"paralyzed\" by the thought of being behind and felt \"immense pressure.\" They explicitly mention an \"awful loop\" of anxiety and being \"overwhelmed\" by deadlines. Most critically, they describe their anxiety as \"crippling,\" indicating an extremely high and debilitating level of stress.\n-   **Happy**: The student directly states, \"My happiness is at an all-time low.\" This is further supported by feelings of isolation and the difficulty of connecting with others due to \"constantly feeling like you're failing,\" all contributing to a profoundly unhappy state.\n-   **Sleep**: The student explicitly states, \"my sleep tracker says I'm getting plenty\" and \"I'm sleeping a lot.\" While they note that this sleep isn't translating into mental well-being (\"my mind is just racing\"), the quantity of sleep itself appears to be high and sufficient according to their own report and tracker.\n-   **Social**: The student directly states, \"I feel so isolated\" and that \"My social score is abysmal.\" They further emphasize this by saying \"My social life is non-existent\" and expressing a need to \"feel less like a hermit,\" clearly indicating a very low level of social connection and satisfaction."}
{"week": 3, "emotion": {"stamina": 5, "knowledge": 60, "stress": 98, "happy": 5, "sleep": 85, "social": 8}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 10, "total_questions": 10, "week": 3}, "weekly_desc": "This week felt like a blur, honestly. It’s hard to even pinpoint where the days went. I know I had classes, but looking back, I barely made it to any of them. CHIN, COSC 089, TUCK, COSC 065… I just couldn't bring myself to go. Every morning, the thought of getting up and facing another lecture felt like climbing a mountain. I’d just stay in Parker House, even though I knew I should be in Reed or Sudikoff. The guilt is really eating at me, especially with all these deadlines piling up. It’s like I know exactly what I *should* be doing, but I just can’t *do* it. My conscientiousness is screaming at me, but my body just won't cooperate.\n\nI did manage to get out sometimes, though. I was at Reed Hall a few times in the afternoons, and even the Life Sciences Center. Not for my actual classes, just… being there. Trying to study, I guess, or at least feel like I was being productive. And I was at Sudikoff late one night, trying to get some COSC work done. It feels like I'm constantly trying to catch up, but I'm just digging myself deeper.\n\nThe weirdest thing was going to the Admissions Office twice. I don't even know why, really. Just felt like I needed to talk to someone, or figure something out. It didn't help, just added to the general sense of dread.\n\nMy stamina is just completely shot. I feel drained all the time, even though I'm getting a decent amount of sleep. It's like my brain is just too tired to function properly. And I'm so unhappy. I know my social life is basically non-existent right now, and that probably doesn't help, but it's hard to even think about reaching out when I feel this overwhelmed. The anxiety is just constant, a knot in my stomach that won't go away. Every time I think about the assignments due Monday and Friday, it just gets worse. There are so many of them.\n\nI feel like I know the material, or at least I *should* know it, but the pressure of actually performing and attending classes is just crushing me. It's a terrible feeling, knowing you're capable but being completely paralyzed by stress.\n\nNext week, I *have* to get back on track. My main goal is just to show up. To every single class. Even if I just sit there and absorb a fraction of it, it's better than nothing. I need to break this cycle of avoidance. I also need to make a proper plan for all these deadlines. Just seeing them listed out like that makes my head spin. Maybe if I break them down into smaller, manageable chunks, it won't feel so impossible. And I really need to try and connect with someone, anyone. This isolation is making everything so much harder. I just need to find a way to push through this.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: Chosen as 5 because the student explicitly states, \"My stamina is just completely shot. I feel drained all the time,\" and describes their brain as \"too tired to function properly,\" indicating extreme mental and physical fatigue despite adequate sleep. They also mention their \"body just won't cooperate\" and the thought of lectures feels \"like climbing a mountain.\"\n- **Knowledge**: Chosen as 60 because the student expresses, \"I feel like I know the material, or at least I *should* know it,\" and acknowledges \"knowing you're capable.\" This suggests an underlying understanding of the course content, but their ability to apply or demonstrate it is severely hindered by stress, not a lack of knowledge itself.\n- **Stress**: Chosen as 98 due to overwhelming evidence of severe stress and anxiety. The student reports \"The guilt is really eating at me,\" a \"general sense of dread,\" \"The anxiety is just constant, a knot in my stomach that won't go away,\" and feeling \"completely paralyzed by stress.\" They also mention \"deadlines piling up\" and that the \"pressure...is just crushing me.\"\n- **Happy**: Chosen as 5 because the student directly states, \"I’m so unhappy,\" and describes their overall state with phrases like \"general sense of dread\" and \"It's a terrible feeling.\" The constant anxiety and guilt further contribute to a very low emotional state.\n- **Sleep**: Chosen as 85 because the student explicitly mentions, \"even though I'm getting a decent amount of sleep.\" This indicates that sleep quantity is not the primary issue contributing to their fatigue or other emotional states.\n- **Social**: Chosen as 8 because the student clearly states, \"I know my social life is basically non-existent right now,\" and acknowledges that \"This isolation is making everything so much harder.\" They also express a desire to \"try and connect with someone, anyone,\" highlighting their current lack of social interaction."}
{"week": 4, "emotion": {"stamina": 5, "knowledge": 60, "stress": 98, "happy": 5, "sleep": 35, "social": 8}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Activities & Intents", "correct_answers": 9, "total_questions": 10, "week": 4}, "weekly_desc": "This week felt like a blur, honestly. It’s Sunday night now, and I’m just… exhausted. My happiness is at a 5, and yeah, that feels about right. My stamina is also shot. It’s like I’m constantly running on fumes, even though the sleep tracker says I’m getting decent hours when I actually crash. I guess it’s the quality, or maybe just the sheer mental load.\n\nThe biggest thing, and it’s hard to even write this down, is that I didn't make it to a single one of my scheduled classes this week. Not one. CHIN 033, COSC 089, COSC 065, TUCK 003 – I missed them all. Every time the alarm went off, or I looked at the clock, the thought of getting up, getting ready, and facing another lecture just felt impossible. It’s not that I don’t want to learn, my knowledge score is still high, but the *act* of going… it just felt like too much.\n\nInstead, I spent most of my time either holed up in Parker House or, more often, practically living in Sudikoff. Wednesday, Thursday, Friday, I was mostly in my dorm, just trying to process things, I guess. But then the panic about all the deadlines started to set in. There are so many of them, especially for Monday and Friday. It’s like a never-ending wave.\n\nSo, Saturday, Sunday, Monday, and Tuesday, I was basically glued to Sudikoff. I pulled some serious late nights there, trying to catch up on COSC assignments. I was there until 2 AM on Sunday, and then again until 7 AM on Tuesday morning. It’s a desperate attempt to stay afloat, but it feels like I’m just treading water. I know I *should* have been in class, learning the material properly, but I was so deep in trying to finish the previous week’s work that I couldn’t even think about new content. It’s a vicious cycle.\n\nI did manage to get out a few times. I was at Reed Hall on Wednesday and Thursday afternoons, and again on Tuesday afternoon. Not for my scheduled Chinese class, but I was in a classroom, so maybe I was trying to get some work done there, or maybe I just needed a change of scenery. I also went to the Admissions Office on Wednesday, which was… something. And I made it to the Boathouse a couple of times, and Leverone Field House once. Those moments were brief breaks, but they didn't really alleviate the underlying stress. I even made it to the library on Thursday night, which felt like a small victory, but then it was back to the grind.\n\nMy social life is basically non-existent right now, which isn't helping my mood. My social score is an 8, and I feel it. I barely saw anyone outside of the occasional nod in the dorm or a quick trip to the dining hall on Friday night. It’s isolating, and that just makes the anxiety worse. I know I need to connect with people, but when I’m this overwhelmed, it feels like another task I can’t manage.\n\nThe biggest challenge is definitely this feeling of being perpetually behind. The deadlines are piling up, and I’m just trying to survive each one. It’s hard to feel happy or energetic when every waking moment is dominated by the thought of what I *haven't* done yet.\n\nFor next week, my goals are pretty clear, even if they feel daunting.\n1.  **Attend every single class.** I *have* to break this cycle of missing lectures. I need to be there, even if I feel behind. Just showing up is a start.\n2.  **Prioritize.** I need to figure out a way to tackle these assignments without pulling all-nighters every other day. Maybe breaking them down into smaller chunks, or asking for help.\n3.  **Reach out.** Even if it’s just a quick coffee with someone, I need to try and get some social interaction. Being alone with my thoughts and the workload is just making everything worse.\n4.  **Manage the anxiety.** I don't know how yet, but I need to find a way to cope with the overwhelming feeling. Maybe a walk, or just five minutes of quiet. Anything to stop the spiral.\n\nThis week was rough. I just hope next week can be different.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"I’m just… exhausted,\" \"My stamina is also shot,\" and \"It’s like I’m constantly running on fumes.\" This indicates extremely low energy levels.\n- **Knowledge:** The student directly states, \"It’s not that I don’t want to learn, my knowledge score is still high.\" While they acknowledge missing classes and struggling with new content, they self-assess their current knowledge as high.\n- **Stress:** The journal is filled with indicators of extreme stress and anxiety: \"the panic about all the deadlines started to set in,\" \"It’s like a never-ending wave,\" \"feels like I’m just treading water,\" \"underlying stress,\" \"makes the anxiety worse,\" \"overwhelmed,\" and \"every waking moment is dominated by the thought of what I haven't done yet.\"\n- **Happy:** The student explicitly states, \"My happiness is at a 5, and yeah, that feels about right.\" They also note, \"It’s hard to feel happy or energetic.\"\n- **Sleep:** While the student mentions \"the sleep tracker says I’m getting decent hours,\" they immediately question the \"quality\" and describe pulling \"serious late nights... until 2 AM on Sunday, and then again until 7 AM on Tuesday morning.\" This indicates highly disrupted and poor quality sleep, despite potentially accumulating some hours.\n- **Social:** The student directly states, \"My social score is an 8, and I feel it.\" They also mention, \"My social life is basically non-existent right now\" and \"I barely saw anyone... It’s isolating.\""}
{"week": 5, "emotion": {"stamina": 5, "knowledge": 10, "stress": 98, "happy": 5, "sleep": 5, "social": 5}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 10, "total_questions": 10, "week": 5}, "weekly_desc": "This week felt like a blur, honestly. I’m just so tired, all the time. My sleep is completely shot, and it’s making everything else feel impossible. I can barely drag myself out of bed, let alone focus on anything.\n\nLooking at my schedule, it’s pretty clear I didn’t make it to a single class. Not one. CHIN 033, COSC 065, COSC 089, TUCK 003… I missed them all. It’s a horrible feeling, knowing I should be there, that I’m paying for these classes, and I just can’t seem to get myself to go. I was in Sudikoff a lot, especially late at night and early in the morning, but it was mostly just… being there. Staring at my screen, trying to get something done for COSC, but my brain just wouldn't cooperate. It’s like I’m physically present in the right buildings sometimes, like Reed Hall or Sudikoff, but mentally I’m just not there. I was even in my dorm, Parker House, for most of Wednesday and Monday, just doing nothing, which is probably the worst part.\n\nMy stamina is non-existent, which makes sense when I’m barely sleeping. And my happiness? Yeah, that’s pretty much at rock bottom. I feel constantly on edge, like there’s a huge weight on my shoulders. The sheer number of deadlines coming up is just overwhelming. Every Monday and Friday seems to have multiple things due, and then there are Tuesdays and Wednesdays too. It’s a constant reminder of how far behind I’m getting.\n\nI did manage to get out a few times, which is something, I guess. I was at the Boathouse a couple of times, which was a brief escape, and I had to deal with some stuff at the Admissions Office and even the Medical Center admin building, which just added to the stress. I even made it to the Hopkins Center on Sunday night, but it wasn't really a social thing. My social life is basically non-existent right now, which probably isn't helping my mood. I just feel so isolated and overwhelmed.\n\nThe biggest challenge this week was just getting started on anything. The inertia is crushing. I know I have so much to do, and the more I miss, the more anxious I get, and then the harder it is to actually do anything. It’s a terrible cycle.\n\nFor next week, I *have* to break this cycle. My main goal is to actually attend my classes. Even if I just sit there and absorb a fraction of it, it’s better than nothing. I need to prioritize getting some actual sleep, even if it means sacrificing a bit of study time – because right now, the lack of sleep is making any study time I *do* have completely unproductive. I also need to try and chip away at those deadlines, even if it’s just one small task at a time. I can’t keep letting this spiral. I just can’t.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student explicitly states, \"My stamina is non-existent,\" and reports being \"so tired, all the time,\" barely able to \"drag myself out of bed.\"\n-   **Knowledge**: The student \"didn’t make it to a single class\" and notes that their \"brain just wouldn't cooperate\" when trying to work, leading to \"unproductive\" study time and feeling \"how far behind I’m getting.\"\n-   **Stress**: The student feels \"constantly on edge,\" describes \"a huge weight on my shoulders,\" and finds \"The sheer number of deadlines coming up is just overwhelming,\" which \"added to the stress.\"\n-   **Happy**: The student states their \"happiness? Yeah, that’s pretty much at rock bottom,\" and describes a \"horrible feeling\" and feeling \"so isolated and overwhelmed.\"\n-   **Sleep**: The student reports their \"sleep is completely shot\" and that they are \"barely sleeping,\" highlighting \"the lack of sleep.\"\n-   **Social**: The student explicitly states, \"My social life is basically non-existent right now,\" and feels \"so isolated.\""}
{"week": 6, "emotion": {"stamina": 10, "knowledge": 5, "stress": 95, "happy": 15, "sleep": 75, "social": 35}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 9, "total_questions": 10, "week": 6}, "weekly_desc": "Okay, another week done. Or, well, another week *passed*, I guess. It feels like I'm just watching the days go by sometimes, especially when I look back at what I actually *did*.\n\nThis week was... a lot of nothing, and then a sudden burst of panic. I really didn't make it to any of my classes, did I? It's embarrassing to even write that down. CHIN 033, COSC 065, COSC 089, TUCK 003 – I had them all scheduled, and I just... didn't go. I don't know what it is. I wake up, and the thought of getting out of Parker House, getting dressed, and actually sitting in a lecture just feels impossible. Like there's this invisible wall. I know I *should* be there, especially with how much I feel like I'm falling behind. My knowledge feels like it's at an all-time low, which is just terrifying.\n\nI did manage to get out a few times, which is something. I was at the Boathouse on Thursday, Monday, and even super late Tuesday night/early Wednesday morning. It's good to get some physical activity in, I guess, and clear my head. And I was at the Field House on Friday too. I even popped into Reed Hall a couple of times, but it wasn't for class, just... being there. And the Admissions Office, that was random. It's like I'm doing everything *but* what I'm supposed to be doing.\n\nThe worst part is the guilt. I know I'm letting myself down. And then I see all these deadlines piling up – seriously, so many for Monday and Friday, and even a few for Tuesday and Wednesday. It's overwhelming. I spent some time in Sudikoff on Saturday evening and then again really late Tuesday night, trying to get *something* done for COSC, but it felt like I was just staring at the screen, not actually processing anything. It's this cycle of feeling completely paralyzed, then panicking about how much I'm not doing, and then trying to cram everything in at the last minute, which just makes me more anxious.\n\nMy sleep feels okay, and I'm not exactly unhappy, but I'm definitely not thriving. My social life feels pretty neutral too, which is fine, but also a bit isolating when I'm spending so much time just... in my room.\n\nNext week, I *have* to turn this around. My main goal is just to *show up*. Seriously, just get to class. Even if I feel completely lost, just being there is a start. I need to break this cycle of avoidance. I also need to make a proper plan for those deadlines. There are so many, and I can't afford to just let them all slip. I need to prioritize and actually dedicate focused time to each one, instead of just hoping it'll magically get done. It's going to be tough, but I can't keep doing this. I just can't.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student describes feeling \"impossible\" to get out for classes, like \"there's this invisible wall,\" and a \"cycle of feeling completely paralyzed.\" They also mention \"staring at the screen, not actually processing anything,\" indicating very low mental and physical energy for productive tasks. While they did get out for non-academic activities, their core academic stamina is extremely low.\n- **Knowledge:** The student explicitly states, \"My knowledge feels like it's at an all-time low, which is just terrifying,\" and mentions feeling \"completely lost\" in class. This indicates a profound perceived deficit in their understanding.\n- **Stress:** The journal is filled with indicators of high stress: \"a sudden burst of panic,\" \"The worst part is the guilt,\" \"deadlines piling up... It's overwhelming,\" and a cycle that \"just makes me more anxious.\" The concluding \"I can't keep doing this. I just can't\" highlights extreme distress.\n- **Happy:** The student states, \"I'm not exactly unhappy, but I'm definitely not thriving.\" However, the overall tone is dominated by negative emotions like \"guilt,\" \"terrifying,\" \"overwhelming,\" and \"anxious,\" indicating a very low level of overall well-being and joy.\n- **Sleep:** The student directly states, \"My sleep feels okay.\" This is a clear positive point, suggesting sleep is not a current source of distress or impairment.\n- **Social:** The student describes their social life as \"pretty neutral too, which is fine, but also a bit isolating when I'm spending so much time just... in my room.\" This indicates it's not actively bad, but also not a source of strong positive connection or support, leaning towards isolation."}
{"week": 7, "emotion": {"stamina": 5, "knowledge": 65, "stress": 98, "happy": 10, "sleep": 75, "social": 15}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 9, "total_questions": 10, "week": 7}, "weekly_desc": "This week felt like a blur, honestly. My energy levels are just completely shot, which is probably why I'm feeling so down. It's hard to feel happy when every movement feels like a monumental effort. I'm sleeping a lot, which is good, but it doesn't seem to be making a dent in how utterly exhausted I feel.\n\nThe biggest thing weighing on me is that I didn't make it to any of my classes this week. Not a single one. I know I should have been in CHIN 033, COSC 065, COSC 089, and TUCK 003, but I just couldn't bring myself to go. The guilt is immense, and it's just adding to the anxiety that's already bubbling under the surface. I was at the dorm for most of the time, just... existing. I did manage to be active for a couple of hours on Tuesday night, but even that felt like a struggle. I even ended up at Sudikoff late Tuesday, but I wasn't really *doing* anything. It's like my body is moving, but my brain isn't engaged.\n\nIt's frustrating because I feel like I *know* the material, or at least I have a good grasp on things generally, but missing class just makes me feel like I'm falling behind anyway. The thought of all those upcoming deadlines – there are so many, scattered across every day of the week – is just paralyzing. It feels like a mountain I can't even begin to climb when I'm this drained.\n\nSocially, I haven't really connected with anyone much either. When I'm feeling this low and tired, it's hard to put myself out there. I just want to curl up and disappear.\n\nMy biggest challenge right now is definitely getting myself back on track with classes and finding some way to boost my stamina. This exhaustion is making everything so much harder than it needs to be.\n\nFor next week, my goals are pretty clear, even if they feel daunting:\n1.  **Attend every single class.** No excuses. I need to be there, even if I just sit and listen.\n2.  **Start tackling those deadlines.** I need to break them down into smaller, manageable chunks so they don't feel so overwhelming. I'll pick one or two to focus on first.\n3.  **Figure out this stamina issue.** Maybe it's not just about sleep, but about what I'm doing when I'm awake. I need to find a way to feel less drained.\n4.  **Try to engage more.** Even if it's just a quick chat with someone, I need to try and push past this isolation.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student explicitly states, \"My energy levels are just completely shot,\" and \"every movement feels like a monumental effort,\" indicating extremely low physical and mental energy. They also mention \"utterly exhausted\" and that \"This exhaustion is making everything so much harder.\" This points to a very low stamina level, even lower than the previous status.\n-   **Knowledge**: Despite missing classes, the student states, \"I feel like I *know* the material, or at least I have a good grasp on things generally.\" This suggests a foundational understanding of the course material, even if they feel like they are \"falling behind\" due to attendance and deadlines, not comprehension.\n-   **Stress**: The student expresses \"immense guilt\" over missing classes, \"anxiety that's already bubbling under the surface,\" and describes the thought of \"all those upcoming deadlines... is just paralyzing.\" This indicates a very high and overwhelming level of stress.\n-   **Happy**: The student reports \"feeling so down\" and finds \"It's hard to feel happy.\" They also mention \"feeling this low and tired,\" which collectively points to a very low emotional state of happiness.\n-   **Sleep**: The student notes, \"I'm sleeping a lot, which is good.\" This indicates a high quantity of sleep, even if it's not fully alleviating their exhaustion, suggesting the issue might be quality or other factors, but not lack of sleep itself.\n-   **Social**: The student states, \"Socially, I haven't really connected with anyone much either,\" finds \"it's hard to put myself out there,\" and expresses a desire to \"curl up and disappear.\" They also mention needing to \"push past this isolation,\" all of which indicate a very low level of social engagement and connection."}
{"week": 8, "emotion": {"stamina": 5, "knowledge": 35, "stress": 95, "happy": 5, "sleep": 25, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "Another week gone, and honestly, it feels like I barely lived it. I’m just so… drained. My happiness is practically non-existent, and my stamina is in the single digits. It’s a miracle I even managed to drag myself out of bed most days, let alone actually *do* anything.\n\nClasses this week were a complete write-off. Every single one. CHIN 033, COSC 065, COSC 089, TUCK 003 – I missed them all. I don't even know how that happened. One minute it's morning, and I'm just... stuck. The thought of getting up, getting ready, walking to class, it just feels insurmountable. I know I *should* be there, I *want* to be there, but it's like there's this invisible wall. The guilt is eating at me, especially with all those deadlines piling up. So many Mon and Fri deadlines, it's just a constant pressure. I keep telling myself I'll catch up, but then the day just slips away.\n\nI spent most of the week holed up in Parker House. It’s embarrassing, really. Just hours and hours of nothing. I barely left my room. I think I made it to Reed Hall a couple of times on Wednesday and Thursday, but it wasn't for class, just... being there, I guess? And Fairchild too. I don't even remember what I was doing. It’s all a blur.\n\nThe only times I really felt like I was *doing* something were those late-night trips to the boathouse. It’s weird, I know, but it’s quiet there. Just the water and the dark. It’s a strange kind of peace, a break from the constant hum of anxiety in my head. I also had a long stretch in Sudikoff on Sunday, which was probably me trying to cram some COSC stuff, but even then, it felt like I was just staring at the screen, not really absorbing anything. My knowledge for one COSC class is still high, which is a small comfort, but the other one… not so much.\n\nMy social life is non-existent, which isn't helping. I feel so isolated. It’s hard to reach out when you feel like this, and honestly, I don't even have the energy to pretend to be okay. I just want to disappear sometimes.\n\nThis high level of neuroticism is really getting to me. I'm constantly on edge, worried about everything I'm not doing, which then makes me even less capable of doing it. It's a vicious cycle. I know I'm supposed to be conscientious, and I *am* trying, but it's like my body and mind just aren't cooperating.\n\nFor next week, I *have* to do better. I need to break this cycle. My goals are simple, but feel monumental:\n1.  Actually attend my classes. Just one, to start. Maybe CHIN 033 on Monday.\n2.  Get out of the dorm more, even if it's just to the library or a different building.\n3.  Try to tackle at least one of those looming deadlines head-on, instead of just letting them hang over me.\n4.  And maybe, just maybe, try to get some proper rest, not just lying in bed feeling miserable.\n\nIt feels like a lot, but I have to try. I can't keep living like this.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: 5, because the student explicitly states \"My stamina is in the single digits\" and feels \"drained,\" finding it a \"miracle I even managed to drag myself out of bed.\"\n-   **Knowledge**: 35, because the student reports \"Classes this week were a complete write-off. Every single one... I missed them all\" and felt like they were \"just staring at the screen, not really absorbing anything,\" indicating a significant drop in current learning, despite \"My knowledge for one COSC class is still high.\"\n-   **Stress**: 95, because the student describes \"The guilt is eating at me, especially with all those deadlines piling up,\" feeling \"constant pressure,\" a \"constant hum of anxiety,\" and \"constantly on edge\" due to \"high level of neuroticism.\"\n-   **Happy**: 5, because the student states \"My happiness is practically non-existent\" and mentions \"not just lying in bed feeling miserable.\"\n-   **Sleep**: 25, because the student's goal is to \"get some proper rest, not just lying in bed feeling miserable,\" implying their current rest is not proper or restorative, even if they are spending time in bed.\n-   **Social**: 5, because the student explicitly states \"My social life is non-existent,\" feels \"so isolated,\" and \"barely left my room.\""}
{"week": 9, "emotion": {"stamina": 5, "knowledge": 75, "stress": 95, "happy": 5, "sleep": 5, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "This week felt like a blur, honestly. Another one of those weeks where I just feel completely drained, like I'm running on fumes. My body feels heavy, my mind is buzzing with everything I *should* be doing, and I just can't seem to catch a break.\n\nI know I missed all my classes again. Every single one. It's not that I don't want to go, it's just... I don't know. Getting out of bed feels impossible sometimes, especially when I've been up so late. I spent most of Wednesday, Friday, and a good chunk of the weekend just holed up in my dorm. It feels like a safe space, but also a trap.\n\nThe late nights in Sudikoff were brutal. Thursday night, then again Saturday night into Sunday morning. It was just me and the hum of the computers, trying to get through COSC assignments. I feel like I'm constantly playing catch-up, and even when I put in those hours, it feels like it's never enough. My brain just feels fried. No wonder my sleep is so messed up. I'm barely getting any, and it's definitely showing in how I feel.\n\nI barely saw anyone this week. My social battery is completely dead, and honestly, my happiness levels are in the gutter too. The only real \"activity\" I had was that brief time at the Boathouse on Thursday. It was nice to get out for a bit, but then it was back to the grind. I feel so isolated, even though I know there are people around. It's just hard to reach out when you feel this overwhelmed.\n\nThe deadlines are piling up, and that's a huge source of anxiety. Every time I look at the list, my stomach clenches. So many things due on Monday and Friday, and I feel like I'm already behind on everything. It's this constant pressure, this feeling that I'm not doing enough, even when I'm pushing myself to the absolute limit. My stamina is shot, and I just feel perpetually exhausted.\n\nI know I have a lot of knowledge, especially in my COSC classes, but sometimes it feels like it's all just theoretical, and I can't actually apply it when I'm this tired and stressed. It's frustrating.\n\nFor next week, I *have* to do better. My main goal is to actually attend my classes. All of them. I need to break this cycle of missing lectures and then trying to teach myself everything at 2 AM. I also need to figure out a way to get more sleep. Maybe if I start assignments earlier, I won't have to pull those all-nighters. And I really need to try and connect with someone, even just for a few minutes. This feeling of being alone with all this pressure is really getting to me. I just want to feel a little less overwhelmed, a little less tired, and a little more like myself.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** 5 - The student repeatedly states feeling \"completely drained,\" \"running on fumes,\" \"body feels heavy,\" \"stamina is shot,\" and \"perpetually exhausted.\" This indicates an extremely low level of physical and mental energy.\n-   **Knowledge:** 75 - The student explicitly states, \"I know I have a lot of knowledge, especially in my COSC classes.\" While they express frustration about *applying* it due to stress and tiredness, the *possession* of knowledge itself is affirmed as high.\n-   **Stress:** 95 - The journal is filled with indicators of extreme stress: \"mind is buzzing with everything I *should* be doing,\" \"constantly playing catch-up,\" \"deadlines are piling up,\" \"huge source of anxiety,\" \"stomach clenches,\" \"constant pressure,\" and feeling \"overwhelmed.\"\n-   **Happy:** 5 - The student directly states, \"my happiness levels are in the gutter,\" and expresses feeling \"so isolated\" and \"alone with all this pressure,\" indicating a very low emotional state.\n-   **Sleep:** 5 - The student mentions being \"up so late,\" that their \"sleep is so messed up,\" and they are \"barely getting any,\" often pulling \"all-nighters.\" This points to severely inadequate and disrupted sleep.\n-   **Social:** 5 - The student reports \"missed all my classes,\" being \"holed up in my dorm,\" \"barely saw anyone,\" and that their \"social battery is completely dead.\" They also mention feeling \"so isolated\" and that it's \"hard to reach out,\" indicating minimal social interaction and a strong sense of isolation."}
{"week": 10, "emotion": {"stamina": 10, "knowledge": 30, "stress": 95, "happy": 5, "sleep": 40, "social": 35}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 29.0, "full_text_response": "29/30"}, "weekly_desc": "This week felt… off. Like I was physically present in some places, but my brain just wasn't connecting. I really messed up with classes, I know that. The system says \"no class experience recorded,\" and honestly, it feels pretty accurate.\n\nI was in Sudikoff for a lot of Wednesday morning, right when COSC 089 and 065 were happening, and even CHIN 033. But I just… didn't go in. I don't know what it was. It's like I was drawn to the building, but then the thought of actually sitting in a lecture, of having to engage, just felt too much. The guilt is already eating at me, knowing I was right there and just couldn't make myself walk through the door.\n\nAnd TUCK 003 on Wednesday afternoon? Yeah, I ended up at the boathouse instead. I don't even know why. It wasn't planned. I just found myself there, needing to be anywhere but a classroom. It was quiet, which was nice for a bit, but then the anxiety just crept back in, thinking about what I was missing.\n\nThe constant low hum of worry is really getting to me. My knowledge levels are okay, I think, from what I've managed to read on my own, but it's not the same as being in class. And then I look at the upcoming deadlines – so many of them, especially those Monday and Friday ones, just piling up. It feels like a mountain I haven't even started climbing. My stomach just clenches thinking about it all.\n\nI *know* I need to be more disciplined. My conscientiousness is screaming at me to get it together, to be organized, to catch up. But then this other part of me, this really anxious part, just freezes up. My sleep has been okay, but I wake up feeling tired, probably from the mental load. Socially, I'm neutral, but I haven't really sought out much interaction, which probably isn't helping. My stamina feels low, just generally drained.\n\nThe biggest challenge this week was just getting myself to *do* things. The inertia was immense. And the constant worry about falling behind, that's a huge mental drain.\n\nNext week *has* to be different. My main goal is 100% class attendance. No more excuses, no more hovering outside the lecture hall. I need to be in every single one, even if I just sit there and absorb. Then, I need to dedicate specific, non-negotiable blocks of time to catching up on the material I missed, especially for COSC 089 and 065. And I absolutely need to start chipping away at those deadlines, not just let them loom over me. Maybe I should try to find a study buddy or just talk to someone about how overwhelmed I feel. Just getting it out might help.\n\nHopefully, next week I can turn this around. I really need to.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"My stamina feels low, just generally drained.\" They also describe feeling \"off,\" \"brain just wasn't connecting,\" and that \"the thought of actually sitting in a lecture... just felt too much,\" indicating severe mental and physical exhaustion. The \"inertia was immense\" and worry is a \"huge mental drain.\"\n- **Knowledge**: The student admits, \"I really messed up with classes,\" and that \"the system says 'no class experience recorded,' and honestly, it feels pretty accurate.\" They acknowledge missing multiple classes (\"didn't go in,\" \"ended up at the boathouse instead\"). While they claim \"My knowledge levels are okay, I think, from what I've managed to read on my own,\" they immediately qualify this with \"but it's not the same as being in class,\" indicating a significant gap in structured learning and a lack of confidence in their current knowledge acquisition method.\n- **Stress**: Stress is extremely high and pervasive. The student mentions \"The guilt is already eating at me,\" \"the anxiety just crept back in,\" and \"The constant low hum of worry is really getting to me.\" They describe \"upcoming deadlines – so many of them, just piling up\" feeling \"like a mountain I haven't even started climbing,\" and that \"My stomach just clenches thinking about it all.\" They also note an \"anxious part, just freezes up.\"\n- **Happy**: There are no indicators of happiness or positive emotions. The entire entry is dominated by negative feelings such as \"off,\" \"guilt,\" \"anxiety,\" \"worry,\" and physical manifestations of stress like a \"clenched stomach.\"\n- **Sleep**: The student states, \"My sleep has been okay, but I wake up feeling tired, probably from the mental load.\" This suggests that while they are getting some sleep, it is not restorative, indicating a moderate but problematic sleep quality.\n- **Social**: The student explicitly states, \"Socially, I'm neutral, but I haven't really sought out much interaction, which probably isn't helping.\" They also consider, \"Maybe I should try to find a study buddy or just talk to someone about how overwhelmed I feel,\" indicating a recognition of social isolation and a potential need for connection."}
