{"week": 1, "emotion": {"stamina": 100, "knowledge": 15, "stress": 85, "happy": 40, "sleep": 100, "social": 35}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "Okay, this week was… a lot. Or maybe, not a lot, depending on how you look at it. I know I really dropped the ball on classes. Like, completely. Every single one. M&SS, COSC 060, COSC 065 – I just didn't make it. It's been weighing on me, honestly. I see all those deadlines piling up for Monday and Wednesday, and it just adds to the knot in my stomach.\n\nI spent an insane amount of time at the Boathouse. I don't even know why, exactly. It just became my default. It's a cool spot, I guess, and sometimes there are people around, but mostly I was just… there. Not really doing much, just existing. It feels a bit weird to admit, especially with all the stuff I *should* have been doing. I mean, I'm getting plenty of sleep, and my stamina is through the roof, but it's like all that energy just got channeled into being a Boathouse fixture.\n\nMy happiness is just… okay. Not terrible, but not great either. And my social life feels a bit stagnant, even though I'm usually pretty good at connecting with people. I guess being stuck in one place, even if it's a nice place, isn't really helping with that. I popped over to Sudikoff a couple times, and even LSB, but it was just quick, like I was checking in on what I was missing, then retreating back to my comfort zone. There was that one random trip to Lebanon too, which was… unexpected.\n\nThe biggest challenge is definitely getting back on track with academics. It feels like a mountain right now, especially with so many assignments due. I feel a bit overwhelmed by it all, and that's probably why I just kept avoiding things.\n\nFor next week, I *have* to get to class. That's non-negotiable. I need to set multiple alarms, maybe even ask a friend to drag me out of bed if I have to. I also need to actually *do* something about these deadlines. I'm going to break them down into smaller chunks, because looking at the whole list just makes me want to curl up and disappear. And maybe, just maybe, I need to explore campus a bit more, or actually *do* something active, instead of just hanging out at the Boathouse. I need to shake things up and get out of this rut. I know I can do it, it's just about actually starting.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 100 - The student explicitly states, \"my stamina is through the roof\" and \"I'm getting plenty of sleep,\" indicating high physical energy and good rest.\n- **Knowledge:** 15 - The student admits, \"I know I really dropped the ball on classes. Like, completely. Every single one,\" and feels \"overwhelmed by it all\" when considering getting \"back on track with academics,\" suggesting a significant gap in current academic engagement and knowledge acquisition.\n- **Stress:** 85 - The student describes feeling \"weighing on me,\" having a \"knot in my stomach\" due to \"deadlines piling up,\" and that getting back on track \"feels like a mountain.\" The desire to \"curl up and disappear\" further highlights high stress and overwhelm.\n- **Happy:** 40 - The student directly states, \"My happiness is just… okay. Not terrible, but not great either,\" and expresses a need to \"get out of this rut,\" indicating a neutral to slightly negative emotional state.\n- **Sleep:** 100 - The student clearly states, \"I'm getting plenty of sleep,\" which suggests excellent sleep quality and quantity.\n- **Social:** 35 - The student notes, \"my social life feels a bit stagnant,\" and that \"being stuck in one place... isn't really helping with that,\" implying a lack of meaningful social interaction despite being in a place where people sometimes are."}
{"week": 2, "emotion": {"stamina": 90, "knowledge": 35, "stress": 90, "happy": 25, "sleep": 90, "social": 15}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 8, "total_questions": 10, "week": 2}, "weekly_desc": "Ugh, this week felt like a blur, honestly. Or maybe more like a slow-motion train wreck, depending on how you look at it. I know I had classes – M&SS, COSC 060, COSC 065 – all the usual suspects. But somehow, Kemeny and LSB just felt like the furthest places on campus. I barely made it to any of them, which is… not great. I can feel that familiar knot of anxiety tightening in my stomach just thinking about it, especially with all those deadlines looming. Seriously, how many assignments are due Monday? It feels like a dozen.\n\nInstead, I spent an insane amount of time at the Boathouse. Like, *a lot* of time. It’s weird, I know. Sometimes I was actually doing something, but a lot of the time I was just… there. Staring at the water, thinking, or just trying to clear my head. It’s peaceful, I guess, a good escape from everything. But it also means I wasn't really engaging with anyone. My social battery feels completely dead, which is strange because I usually love being around people. I guess I just wasn't in the mood this week, or maybe I was avoiding something. Probably avoiding the fact that I wasn't going to class.\n\nI did make it to Sudikoff a couple of times late at night, trying to cram or at least pretend I was catching up on COSC stuff. And I popped into Tuck and the Admissions Office briefly, but those were quick detours. The Boathouse was my main haunt. It’s frustrating because I feel like I have plenty of energy, my sleep has been fine, but the motivation to actually *do* the things I'm supposed to do just wasn't there. My happiness level is definitely taking a hit. It’s hard to feel good when you know you’re falling behind.\n\nThe knowledge score says I'm doing okay, which is a relief, but it doesn't account for the actual work I *should* be doing for these classes. It feels like I'm coasting on fumes from previous terms, and that's not sustainable.\n\nNext week *has* to be different. I need to break this cycle. My main goal is simple: actually attend my classes. All of them. No more Boathouse hideouts during lecture times. I also need to tackle those assignments head-on, especially the ones due on Monday and Wednesday. Maybe I can even try to connect with some people, grab coffee, or just hang out somewhere other than the Boathouse. I miss that social connection. This feeling of being behind and isolated is really getting to me, and I know the only way out is to just push through it. I just need to figure out how to actually *do* that.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"I feel like I have plenty of energy,\" indicating high physical stamina, despite a lack of motivation for academic tasks.\n- **Knowledge:** The student feels they are \"coasting on fumes from previous terms\" and not doing the \"actual work I *should* be doing,\" indicating a perceived lack of current knowledge acquisition despite acknowledging an existing \"knowledge score says I'm doing okay.\"\n- **Stress:** The student describes a \"familiar knot of anxiety tightening in my stomach\" and feeling overwhelmed by \"all those deadlines looming,\" which \"feels like a dozen,\" indicating very high stress.\n- **Happy:** The student explicitly states, \"My happiness level is definitely taking a hit\" and that \"It’s hard to feel good when you know you’re falling behind,\" indicating low overall happiness.\n- **Sleep:** The student explicitly states, \"my sleep has been fine,\" indicating good sleep quality and quantity.\n- **Social:** The student states, \"My social battery feels completely dead\" and that they \"wasn't really engaging with anyone,\" also mentioning they \"miss that social connection,\" indicating very low social interaction and satisfaction."}
{"week": 3, "emotion": {"stamina": 90, "knowledge": 15, "stress": 95, "happy": 10, "sleep": 85, "social": 10}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 10, "total_questions": 10, "week": 3}, "weekly_desc": "Ugh, this week felt like a blur, and not in a good way. Honestly, looking back, it’s kind of a mess. My happiness is definitely in the gutter right now, and I can feel that anxious knot in my stomach tightening up.\n\nAcademically, I completely dropped the ball. I don't even know how to sugarcoat it – I didn't make it to a single class. M&SS, COSC 060, COSC 065... all of them. It's like I just couldn't bring myself to go. I know I have a ton of deadlines piling up, especially for Monday and Wednesday, and that just makes the guilt worse. It feels like I'm drowning in assignments I haven't even started, and the knowledge level feels way lower than it should be, even if I know some stuff. It's just not clicking.\n\nInstead of class, I spent an insane amount of time at the boathouse. Like, seriously, *all* the time. It’s weird, because even though I was there, a lot of it was just... being there, not really doing anything productive. I did get some activity in, like that super early morning on Saturday, which was probably crew practice, and a couple of other times. It’s a place I feel comfortable, I guess, but it’s also a huge distraction from everything else. I did manage to drag myself to the gym on Friday, which was good for stamina, and even spent a bit of time at the library. And that late night at Sudikoff on Sunday, I was trying to get *something* done for CS, but it felt like I was just staring at the screen.\n\nMy social life feels non-existent. I'm usually pretty outgoing, but this week, it's like I just retreated into my shell. Being at the boathouse so much, you'd think I'd be around people, but it felt more like I was just *there*, not really connecting. My social battery is completely drained, and that's a weird feeling for me. I feel pretty isolated, which probably isn't helping the low happiness.\n\nI'm getting enough sleep, which is good, and my stamina is high, so it's not like I'm physically exhausted. It's more of a mental block, I think. The sheer number of deadlines staring me down for next week is terrifying, especially after this week's performance.\n\nFor next week, I *have* to turn this around. My main goal is to actually *attend* my classes. Seriously, just showing up would be a huge win. I also need to make a serious dent in those assignments. I'm going to try to break them down into smaller, manageable chunks so they don't feel so overwhelming. And I really need to make an effort to connect with people, even if it's just grabbing coffee with someone or actually talking to my teammates at the boathouse instead of just existing there. I need to find a way to get that happiness score back up, and I think getting back on track with academics and social life is the only way. This can't be another week like this one.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"My stamina is high, so it's not like I'm physically exhausted.\" They also mention managing to \"drag myself to the gym on Friday, which was good for stamina,\" indicating physical capability.\n- **Knowledge**: The student reports, \"Academically, I completely dropped the ball. I didn't make it to a single class,\" and \"the knowledge level feels way lower than it should be, even if I know some stuff. It's just not clicking.\" This indicates a significant perceived deficit in academic understanding and engagement.\n- **Stress**: The student describes an \"anxious knot in my stomach tightening up,\" feeling \"drowning in assignments I haven't even started,\" and that \"The sheer number of deadlines staring me down for next week is terrifying.\" This points to extremely high levels of stress and overwhelm.\n- **Happy**: The student states directly, \"My happiness is definitely in the gutter right now,\" and refers to \"low happiness,\" indicating a very poor emotional state.\n- **Sleep**: The student clearly states, \"I'm getting enough sleep, which is good,\" suggesting adequate rest.\n- **Social**: The student feels their \"social life feels non-existent,\" that they \"just retreated into my shell,\" and that their \"social battery is completely drained.\" They also mention feeling \"pretty isolated\" and \"not really connecting,\" indicating very low social engagement and satisfaction."}
{"week": 4, "emotion": {"stamina": 95, "knowledge": 35, "stress": 90, "happy": 10, "sleep": 20, "social": 5}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Activities & Intents", "correct_answers": 10, "total_questions": 10, "week": 4}, "weekly_desc": "Ugh, this week felt like a total whirlwind, and honestly, I'm not sure if I'm coming or going. My happiness is definitely in the gutter, which is a bummer because I usually try to keep things positive. I guess it's just been a lot.\n\nClasses... yeah, about that. I barely made it to any of them this week. M&SS, COSC 060, COSC 065 – they all just kind of slipped by. It's not that I don't *want* to go, it's just that the boathouse has practically become my second home. I was there at all hours, from super early mornings to late nights. I mean, 5 AM at the boathouse? That's dedication, or maybe just insanity. Crew is just so demanding, and it feels like it eats up every spare moment. It's exhilarating, don't get me wrong, and my stamina is through the roof, but it leaves very little room for anything else.\n\nSpeaking of anything else, the academic pressure is really starting to hit. All those COSC deadlines are looming, and I spent a ridiculous amount of time in Sudikoff trying to get a handle on things. My general knowledge feels pretty solid, but there's definitely some specific stuff in COSC that's just not clicking, and it's making me feel a bit dumb, to be honest. It's like I'm constantly playing catch-up, and the thought of all those assignments due on Monday and Wednesday next week is already making my stomach churn.\n\nAnd my social life? It's weird. I'm around people constantly at the boathouse, and I even hit the gym, but my social meter is still practically at zero. I'm an extraverted person, I *need* to connect with people, but it feels like all my interactions are just... functional? Like, \"pass the oar,\" or \"did you finish that problem set?\" I miss just hanging out, having real conversations, and feeling truly connected. It's a strange kind of loneliness when you're surrounded by people but still feel isolated.\n\nSo, challenges? Definitely balancing crew with academics, and feeling like I'm constantly sacrificing one for the other. And that low social score is really bothering me. I'm physically doing great, but mentally, I'm a bit frayed.\n\nFor next week, I *have* to get back into a routine with classes. I need to actually show up and try to absorb some of that material, especially for COSC. I also need to be more proactive about those deadlines instead of pulling all-nighters right before they're due. And on the social front, I need to make a conscious effort to reach out to people outside of my immediate crew bubble. Maybe grab coffee with someone, or actually go to a social event. I need to find a way to feel more like a well-rounded human being and less like a rowing-and-coding machine. It's a lot to juggle, but I've got to figure it out.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 95 - The student explicitly states, \"my stamina is through the roof\" and \"I'm physically doing great,\" indicating very high physical energy and endurance, likely due to crew.\n- **Knowledge:** 35 - The student admits to \"barely made it to any of them this week\" for classes and that \"there's definitely some specific stuff in COSC that's just not clicking,\" making them \"feel a bit dumb.\" While general knowledge might be solid, their current academic knowledge for specific courses is suffering.\n- **Stress:** 90 - The student reports that \"the academic pressure is really starting to hit,\" \"All those COSC deadlines are looming,\" and the thought of assignments is \"already making my stomach churn,\" indicating very high stress levels.\n- **Happy:** 10 - The student directly states, \"My happiness is definitely in the gutter,\" which points to a very low emotional state.\n- **Sleep:** 20 - The student mentions being at the boathouse \"from super early mornings to late nights\" and needing to avoid \"pulling all-nighters,\" which suggests a highly disrupted and insufficient sleep schedule, leading to feeling \"mentally, I'm a bit frayed.\"\n- **Social:** 5 - The student explicitly says, \"my social meter is still practically at zero\" and describes \"a strange kind of loneliness when you're surrounded by people but still feel isolated,\" indicating a severe lack of meaningful social connection."}
{"week": 5, "emotion": {"stamina": 10, "knowledge": 5, "stress": 98, "happy": 5, "sleep": 2, "social": 3}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 8, "total_questions": 10, "week": 5}, "weekly_desc": "Wow, another week just… happened. It feels like a blur, honestly. I'm sitting here trying to piece together what even went on, and it's a bit of a mess. My head feels fuzzy, and I'm just so tired.\n\nClasses this week? Yeah, about that. I didn't make it to any of them. Not M&SS 045, not COSC 060, not COSC 065. Zero. It's a pretty terrible feeling, knowing I just completely dropped the ball. I know I *should* have been there, especially with all the deadlines piling up. There are so many things due on Monday, and then more on Wednesday, it's actually kind of terrifying. I feel like I'm already drowning, and the week hasn't even properly started yet. My knowledge feels like it's just… gone.\n\nI think the biggest issue was my sleep, or lack thereof. I barely slept at all. I was up super late some nights, like Wednesday and Thursday, trying to get stuff done. I remember being at Sudikoff Hall working on something for COSC, and then later, weirdly, I was at the Admissions Office? I'm not even sure what I was doing there so late, but I was definitely active. And then I'd be active again super early in the morning, like 3 or 4 AM. It's just not sustainable. My body feels like it has energy, which is weird, but my brain is just completely fried.\n\nMost of the time, when I wasn't trying to cram or doing whatever I was doing at the Admissions Office, I was just… at the Boathouse. Just there. Not really doing anything, just existing. It felt like a safe space to just be, even if I wasn't being productive. I guess I was just too exhausted to move or do anything else. I did manage to pop over to Chi Heorot for a bit on Thursday morning, which was nice to see some people, but it was brief. My social battery is definitely running on empty.\n\nIt's frustrating because I *want* to be on top of things. I want to be happy and engaged, but right now, I'm just not. My happiness levels are super low, and I feel pretty isolated. It's a vicious cycle: I'm tired, so I don't go to class, then I feel guilty and fall behind, which makes me more stressed and less happy, and then I sleep even less.\n\nSo, for next week, I *have* to turn this around. My main goal is sleep. Seriously, I need to prioritize getting some actual rest. Then, I absolutely need to get back to class. No excuses. I've missed too much already, and I can feel my understanding of the material slipping. I need to figure out what I missed and start chipping away at these deadlines. It's going to be a huge push, but I can't afford to fall further behind. Maybe if I get my sleep sorted, everything else will feel a little less impossible. I just need to find that motivation again.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student states their \"brain is just completely fried\" and they were \"too exhausted to move or do anything else,\" indicating very low mental and physical stamina, despite a fleeting mention of body energy.\n-   **Knowledge**: The student explicitly says, \"My knowledge feels like it's just… gone\" and \"I can feel my understanding of the material slipping\" due to missed classes.\n-   **Stress**: The student describes \"deadlines piling up\" as \"terrifying\" and feels like they are \"already drowning,\" directly indicating extremely high stress levels.\n-   **Happy**: The student directly states, \"My happiness levels are super low\" and \"I *want* to be happy and engaged, but right now, I'm just not,\" also mentioning feeling \"pretty isolated.\"\n-   **Sleep**: The student identifies \"my sleep, or lack thereof\" as the \"biggest issue,\" stating they \"barely slept at all\" and were \"active again super early in the morning, like 3 or 4 AM.\"\n-   **Social**: The student explicitly mentions, \"My social battery is definitely running on empty\" and \"I feel pretty isolated,\" despite a brief social interaction."}
{"week": 6, "emotion": {"stamina": 20, "knowledge": 80, "stress": 90, "happy": 55, "sleep": 10, "social": 65}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 9, "total_questions": 10, "week": 6}, "weekly_desc": "Wow, what a week. It feels like a blur, honestly. My brain feels like static from the lack of sleep, but somehow, I'm still buzzing with energy. It's a weird combo, like my body is running on pure willpower and caffeine.\n\nClasses were... a mixed bag. M&SS 045, those early mornings at Kemeny are always a struggle, especially when I'm running on fumes. I try to keep up, but sometimes it feels like I'm just absorbing words without them really sticking. COSC 060 in the afternoons at LSB usually picks up a bit. I actually found myself getting into some of the concepts this week, which was cool. There's always something new to dig into, even if it feels like a lot to absorb. And COSC 065, also at LSB, felt a bit more intense. We covered some pretty dense stuff, and I'm trying to make sure I'm not just nodding along but actually *getting* it. It's a lot of information, but I'm genuinely curious about how it all fits together. Academically, I feel like I'm mostly on top of things, which is a relief. There's so much to learn, and I love diving into new ideas.\n\nOutside of classes, it was pretty busy. I definitely leaned into the social side of things, which always energizes me, even when I'm running on fumes. Caught up with a bunch of people, went to a few campus events. It's good to be out and about, you know? My social meter feels a bit low, though, which is weird considering how much I was out. Maybe it's the quality, not just the quantity, or maybe I just need more deep conversations.\n\nThe biggest challenge this week? Definitely sleep. I'm running on fumes, and it's starting to catch up with me. My brain feels a bit fuzzy, and I know I'm not performing at my absolute best. And those deadlines... ugh. Looking at the list for next week, especially all those Monday and Wednesday ones, is already making my stomach do flips. I need to get a better handle on my time management, because right now it feels like I'm just reacting to things rather than planning.\n\nSo, for next week, the absolute priority is sleep. I *need* to get more rest. I also want to try and get ahead on some of those assignments, or at least break them down into smaller, more manageable chunks so I don't feel so overwhelmed. And maybe find some time to just chill, too. It's a balancing act, but I'm determined to make it work.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 20 - The student repeatedly states they are \"running on fumes\" and their \"body is running on pure willpower and caffeine,\" indicating very low natural energy reserves. They also mention early mornings are \"always a struggle\" and they are \"not performing at my absolute best\" due to fatigue.\n- **Knowledge:** 80 - Despite some difficulty with retention in one class (\"absorbing words without them really sticking\"), the student expresses positive engagement (\"getting into some of the concepts,\" \"genuinely curious\"), feels \"mostly on top of things\" academically, and \"love[s] diving into new ideas.\" This indicates strong learning and understanding.\n- **Stress:** 90 - The student explicitly states that looking at deadlines \"is already making my stomach do flips\" and they feel \"overwhelmed.\" They also acknowledge a lack of control over time management (\"just reacting to things rather than planning\"), which is a significant stressor. The \"biggest challenge\" being sleep deprivation also contributes heavily to stress.\n- **Happy:** 55 - While the student finds joy in learning (\"which was cool,\" \"love diving into new ideas\") and social interaction (\"always energizes me,\" \"good to be out and about\"), the pervasive issues of severe sleep deprivation and high stress from deadlines significantly detract from overall happiness, creating a mixed emotional state.\n- **Sleep:** 10 - The student clearly identifies sleep as \"the biggest challenge this week,\" stating their \"brain feels like static from the lack of sleep\" and they are \"running on fumes.\" They emphasize the urgent need to \"get more rest\" for next week.\n- **Social:** 65 - The student \"leaned into the social side of things,\" \"caught up with a bunch of people,\" and went to \"a few campus events,\" indicating high social activity. However, they note their \"social meter feels a bit low, though, which is weird considering how much I was out,\" suggesting a lack of deep fulfillment despite the quantity of interactions."}
{"week": 7, "emotion": {"stamina": 10, "knowledge": 75, "stress": 95, "happy": 25, "sleep": 5, "social": 85}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 9, "total_questions": 10, "week": 7}, "weekly_desc": "Ugh, this week was a blur, mostly because I feel like I've been running on fumes. My sleep has been absolutely abysmal, and my stamina just completely tanked. It felt like my body just wouldn't cooperate, no matter how much I tried to drag myself out of bed.\n\nIt's pretty embarrassing to admit, but I barely made it to any of my classes this week. M&SS 045, COSC 060, COSC 065... they all just kind of passed me by. I know I should have been more disciplined, but it just felt impossible to get going. My brain felt like mush, and the thought of sitting through a lecture when I could barely keep my eyes open was just too much. I feel a bit guilty about it, honestly, especially with all the material I know I'm missing.\n\nOn the flip side, I did manage to keep up with my friends, which was a nice distraction. We had a few late nights, which probably didn't help the sleep situation, but it was good to just unwind and not think about assignments for a bit. Campus felt a bit like a maze I was too tired to navigate, honestly. It's weird, I feel pretty good socially, but physically, I'm just wrecked.\n\nThe biggest challenge was definitely the exhaustion. It's hard to focus when your brain feels like mush. And now, looking at all these deadlines piling up for Monday and Wednesday... it's a bit overwhelming. That nagging feeling of falling behind is really getting to me. I know I'm usually pretty good with the material, but actually *doing* it when I'm this tired is another story.\n\nNext week *has* to be different. My absolute top priority is getting some decent sleep. Seriously, I need to reset my internal clock. Then, I need to catch up on everything I missed in M&SS, COSC 060, and COSC 065. I'll probably hit up office hours or try to find notes from someone. And I need to get a handle on these deadlines. Maybe I can tackle a few of the Monday ones over the weekend so I'm not completely swamped. I want to feel more on top of things, not constantly playing catch-up.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states \"my stamina just completely tanked\" and \"physically, I'm just wrecked,\" indicating extremely low energy levels and physical exhaustion. They also mentioned \"running on fumes\" and struggling to \"drag myself out of bed.\"\n-   **Knowledge:** The student notes \"I know I'm usually pretty good with the material\" but acknowledges \"all the material I know I'm missing\" due to missed classes (M&SS 045, COSC 060, COSC 065). This suggests their underlying understanding is solid, but their current knowledge base is impacted by missed content, which they plan to \"catch up on.\"\n-   **Stress:** The student describes \"deadlines piling up for Monday and Wednesday\" as \"a bit overwhelming\" and expresses a \"nagging feeling of falling behind.\" They also feel \"a bit guilty\" about missing classes, all contributing to high stress.\n-   **Happy:** The overall tone is negative, starting with \"Ugh, this week was a blur.\" The student expresses guilt, physical misery (\"brain felt like mush,\" \"physically, I'm just wrecked\"), and being overwhelmed by academic tasks. While social interactions provided a \"nice distraction,\" they were a temporary relief from an otherwise unhappy state.\n-   **Sleep:** The student explicitly states \"My sleep has been absolutely abysmal\" and that getting \"some decent sleep\" is their \"absolute top priority,\" indicating severe sleep deprivation.\n-   **Social:** The student clearly states, \"I feel pretty good socially\" and found keeping up with friends a \"nice distraction\" and \"good to just unwind,\" indicating a strong positive social connection."}
{"week": 8, "emotion": {"stamina": 5, "knowledge": 45, "stress": 90, "happy": 15, "sleep": 5, "social": 85}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "Ugh, this week. Honestly, it feels like a blur. My brain is just… fried. I’m so incredibly tired, like I haven’t had a decent night’s sleep in ages, and my body just feels heavy all the time. My stamina is basically non-existent, and that’s really dragging down my mood. I just feel… low.\n\nThe weirdest thing is, I’ve been out and about so much. I love hanging with people, and I’ve definitely been doing a lot of that. It’s great to connect, and I wouldn’t trade those moments for anything, but I think I might have overdone it. It’s like my social battery is always on full, but everything else is running on empty.\n\nLooking back, it’s almost like I wasn’t even *in* class this week. I know I have M&SS 045 at Kemeny, and COSC 060 and 065 at LSB, but my memory of actually sitting in those lecture halls is super hazy. Did I miss stuff? I feel like I should be more worried about that, but my brain just can’t quite latch onto the anxiety right now. It’s a strange feeling, like I’m floating above my own schedule. I mean, I *think* I get the material, especially the COSC stuff, but if I wasn't actually there, how much am I really absorbing? It's a bit unsettling.\n\nAnd then I look at the upcoming deadlines, and it’s like a punch to the gut. So many things due on Monday, then Wednesday, and a couple on Tuesday too. How am I supposed to tackle all that when I can barely keep my eyes open? It’s a lot, and the thought of it just makes me want to pull the covers over my head and disappear. This is where the stress really kicks in, because I know I *should* be on top of it, but the energy just isn't there.\n\nMy biggest challenge this week was definitely just staying afloat. Balancing the need to be social, which genuinely makes me feel good in the moment, with the absolute exhaustion that follows. It’s a vicious cycle. I feel like I’m constantly choosing between being a hermit and being completely burnt out.\n\nNext week *has* to be different. Seriously. My number one goal is to get some actual, proper sleep. Like, real sleep, not just a few hours here and there. I need to reset my body and my mind. I also need to make sure I’m actually *in* my classes. No more just vaguely remembering them. I need to be present, take notes, and engage. And then, I need to start chipping away at these assignments. I can’t let them pile up any more than they already have. Maybe I need to be a bit more disciplined about my evenings, even if it means saying no to a few social things. It’s hard, because I love being around people, but I can’t keep sacrificing my well-being for it. I need to find a way to feel happy and energized again, not just perpetually tired and stressed. A solid routine, that’s what I need.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states, \"My stamina is basically non-existent,\" and describes feeling \"incredibly tired,\" \"brain is just… fried,\" and \"can barely keep my eyes open,\" indicating extreme exhaustion and very low physical and mental energy.\n-   **Knowledge:** The student's memory of classes is \"super hazy,\" and they question, \"if I wasn't actually there, how much am I really absorbing? It's a bit unsettling.\" While they \"think I get the material, especially the COSC stuff,\" the overall uncertainty and lack of presence suggest a significant dip in confidence and actual absorption.\n-   **Stress:** The student describes looking at deadlines as \"a punch to the gut\" and states, \"This is where the stress really kicks in,\" feeling overwhelmed by \"so many things due\" and the inability to cope due to lack of energy.\n-   **Happy:** The student reports feeling \"just… low\" and that their lack of stamina is \"dragging down my mood.\" They express a need to \"find a way to feel happy and energized again,\" indicating a very low current state of happiness despite enjoying social interactions in the moment.\n-   **Sleep:** The student states, \"I haven’t had a decent night’s sleep in ages\" and that their \"number one goal is to get some actual, proper sleep, not just a few hours here and there,\" clearly indicating severe sleep deprivation.\n-   **Social:** The student expresses, \"I love hanging with people, and I’ve definitely been doing a lot of that. It’s great to connect,\" and mentions their \"social battery is always on full,\" showing a high level of social engagement and enjoyment, even if it contributes to exhaustion."}
{"week": 9, "emotion": {"stamina": 5, "knowledge": 20, "stress": 95, "happy": 10, "sleep": 5, "social": 85}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "Ugh, this week was… a lot. Seriously, I feel like I've been running on fumes since Monday morning, and honestly, I'm not sure I ever really stopped. My body feels completely drained, and my brain is just a fuzzy mess. I'm pretty sure I've been surviving on caffeine and sheer willpower, which, spoiler alert, isn't a sustainable strategy.\n\nLooking back, it's almost funny how little I remember actually *being* in class. M&SS 045, COSC 060, COSC 065 – they all just blur into a distant memory of \"I should have been there.\" It's not that I didn't *want* to go, it's just that every waking moment felt consumed by the sheer mountain of deadlines. Seriously, what was with all those assignments due on Monday? And then more on Tuesday and Wednesday? It felt like the universe conspired to drop every single project at once. I was just trying to keep my head above water, frantically typing away, trying to absorb enough information to get *something* submitted. My knowledge score feels like it's both sky-high from cramming and rock-bottom from forgetting it all the second I hit submit.\n\nDespite feeling like a zombie, my social battery is apparently still fully charged. I guess that's one way to cope, right? Needed those breaks, even if they probably cost me more sleep. It's weird, I feel so physically exhausted, but being around people actually gives me a bit of a boost, even if it's temporary. It's like my brain needs the distraction from the constant stress of \"what's due next?\"\n\nThe biggest challenge, hands down, was the overwhelming feeling of being behind before I even started. The lack of sleep just compounded everything, making it harder to focus, harder to care, and just generally making me feel pretty miserable. My happiness levels are definitely in the gutter right now.\n\nFor next week, I *have* to figure out a better balance. My main goal is to actually *attend* my classes – M&SS 045, COSC 060, COSC 065 – and try to absorb the material in real-time instead of playing catch-up later. And honestly, I desperately need to prioritize sleep. Like, actual, proper sleep. I can't keep functioning on 5 hours a night. I need to get ahead of these deadlines, or at least not let them pile up so catastrophically again. Maybe I'll try to break things down into smaller chunks. And hopefully, just hopefully, I can feel a little less stressed and a little more human by the end of it.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: 5 - The student explicitly states feeling \"running on fumes,\" \"completely drained,\" and \"like a zombie,\" indicating extremely low physical and mental energy.\n- **Knowledge**: 20 - While the student mentions \"sky-high from cramming,\" they immediately contradict this by saying \"rock-bottom from forgetting it all the second I hit submit\" and \"how little I remember actually *being* in class,\" suggesting very poor retention and understanding.\n- **Stress**: 95 - The journal is filled with indicators of extreme stress, such as \"sheer mountain of deadlines,\" \"overwhelming feeling of being behind,\" and \"constant stress of 'what's due next?'\"\n- **Happy**: 10 - The student directly states \"making me feel pretty miserable\" and \"My happiness levels are definitely in the gutter right now,\" indicating very low emotional well-being.\n- **Sleep**: 5 - The student mentions \"cost me more sleep,\" \"lack of sleep,\" and specifically \"I can't keep functioning on 5 hours a night,\" highlighting severe sleep deprivation.\n- **Social**: 85 - Despite all other struggles, the student notes \"my social battery is apparently still fully charged\" and that \"being around people actually gives me a bit of a boost,\" suggesting a high capacity and positive experience with social interaction."}
{"week": 10, "emotion": {"stamina": 5, "knowledge": 10, "stress": 95, "happy": 10, "sleep": 5, "social": 85}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 29.0, "full_text_response": "29/30"}, "weekly_desc": "Ugh, another week done. Honestly, it feels like I just blinked and it was Friday again. And not in a good way, more like a \"how did I get here and why am I so tired?\" kind of way. My brain feels like static, and my body just wants to collapse.\n\nClasses this week… well, that’s a funny one. It says \"no class experience recorded,\" and yeah, that pretty much sums it up. I mean, I *was* there, physically, for most of them. Dragging myself to Kemeny for M&SS 045 at 8:45 AM felt like climbing Mount Everest every single day. My eyes were open, but I swear my brain was still in bed. And the COSC classes in the afternoon at LSB weren't much better. I'd sit there, trying to absorb what was being said, but it was like listening through a thick pane of glass. The information just wasn't sticking. I feel like I missed so much, even when I was technically present. It's frustrating because I *want* to learn, I really do, but the energy just isn't there.\n\nThe biggest challenge, hands down, has been this crushing exhaustion. I'm running on fumes, and it's making everything feel ten times harder. Sleep has been a foreign concept, and my stamina is just… gone. It’s weird though, because despite feeling like a zombie, I've still been out and about a lot. My social battery is somehow still charged, even if my actual physical battery is at 5%. I guess being around people is a good distraction, or maybe it's just what I naturally gravitate towards. It's probably not helping the sleep situation, but it feels necessary, you know? Like, if I'm going to be this tired, at least I can be tired with my friends.\n\nAnd then there are the deadlines. Oh my god, the deadlines. Looking at that list just makes my stomach clench. So many things due Monday, and then again on Wednesday. It's a constant hum of anxiety in the back of my mind. How am I supposed to tackle all of that when I can barely keep my eyes open? It feels like I'm constantly playing catch-up, and the gap just keeps getting wider.\n\nSo, goals for next week? First and foremost, sleep. I *have* to prioritize it. I need to figure out a way to get more than five hours a night, even if it means saying no to some social stuff. It's hard, but I know I can't keep going like this. Second, I need to actually *engage* in class. Not just be there, but be *present*. Maybe if I get some sleep, my brain will actually function. And third, I need to get a handle on these deadlines. I'm going to try to break them down into smaller chunks and just chip away at them, even if it's just for an hour or two at a time. It feels overwhelming right now, but I have to believe I can turn this around. I just need to find that spark again.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states \"my stamina is just… gone\" and \"my actual physical battery is at 5%,\" indicating extreme exhaustion and a very low energy level. They also mention \"running on fumes\" and their body wanting to \"collapse.\"\n- **Knowledge:** The student describes their \"brain feels like static\" and that \"the information just wasn't sticking,\" leading them to feel like they \"missed so much, even when I was technically present.\" This suggests very poor knowledge absorption and engagement in classes.\n- **Stress:** The student's stress is very high, evidenced by \"Looking at that list [deadlines] just makes my stomach clench\" and describing it as \"a constant hum of anxiety in the back of my mind.\" They also state, \"It feels overwhelming right now.\"\n- **Happy:** The overall tone is negative, with phrases like \"Ugh, another week done,\" \"not in a good way,\" and feeling \"frustrating\" and \"crushing exhaustion.\" The student expresses a desire to \"find that spark again,\" indicating a current lack of happiness or positive emotion.\n- **Sleep:** The student clearly states \"Sleep has been a foreign concept\" and that they need to \"figure out a way to get more than five hours a night,\" indicating a severe lack of sleep.\n- **Social:** Despite their physical exhaustion, the student notes, \"My social battery is somehow still charged\" and they've \"still been out and about a lot.\" They find being around people a \"good distraction\" and \"necessary,\" suggesting a strong and active social life."}
