{"week": 1, "emotion": {"stamina": 85, "knowledge": 60, "stress": 95, "happy": 20, "sleep": 90, "social": 30}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "Okay, another week gone. It feels like it just flew by, but also like it dragged on forever, if that makes any sense. My brain is just... a mess of thoughts right now.\n\nClasses. Right. So, I didn't make it to any of them. Again. It's not like I *don't* want to go, it's just... the thought of getting up, getting ready, and actually being *there* feels like climbing a mountain sometimes. Especially with ENGS 069 and 093, they're so early on Friday and Monday. And then 025 right after. I know I should be there, I really do. The deadlines are piling up, and that's definitely making my stomach churn. So many Wed and Mon deadlines, it's just a constant pressure. I see them, I know they're there, and then I just... don't do anything about them. It's a cycle.\n\nI spent a ridiculous amount of time at the Admissions Office this week. Like, *so much* time. I don't even know why. I wasn't really doing anything productive there, just... existing. It's weird. Maybe it's just a quiet place to be, away from my dorm, but not quite in the library. Though I did make it to the library for a bit on Saturday, which was a small win, I guess. And the Hopkins Center! I was there a lot too. I love the vibe there, even if I wasn't actively doing anything specific. Just being around that creative energy is nice. I wonder if there's something I could get involved with there. My mind is always buzzing with ideas, even if my body isn't always following through.\n\nIt's frustrating, honestly. I feel like I'm constantly on the verge of doing something, but then I just... don't. My sleep is fine, my stamina is fine, so it's not a physical thing. It's more like a mental block. All these \"No Activity\" entries in my log are basically my life story this week. Just... present, but not engaged.\n\nI really need to get a grip. The sheer volume of deadlines is overwhelming, and I'm not even sure where to start. I guess for next week, the absolute bare minimum goal is to actually *show up* to at least one class. Just one. Maybe ENGS 093 on Tuesday, since it's the only one that day and I won't have the excuse of back-to-back classes. And I need to pick *one* deadline and just start. Even if it's just opening the assignment. Just one small step. I know I'm capable, I just need to figure out how to bridge the gap between knowing what to do and actually doing it. Maybe I can find some new way to approach my studies, something that sparks my interest more. I'm open to anything at this point.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states, \"My sleep is fine, my stamina is fine, so it's not a physical thing.\" However, they also describe \"the thought of getting up... feels like climbing a mountain sometimes\" and \"my body isn't always following through,\" indicating a mental block that impacts their ability to act, even if physically capable.\n-   **Knowledge:** The student states, \"I know I'm capable, I just need to figure out how to bridge the gap between knowing what to do and actually doing it,\" and \"I know I should be there, I really do.\" This suggests they feel competent in their understanding, though missing classes will likely impact future learning.\n-   **Stress:** The student reports very high stress, mentioning \"The deadlines are piling up, and that's definitely making my stomach churn,\" \"it's just a constant pressure,\" and \"The sheer volume of deadlines is overwhelming.\"\n-   **Happy:** The student expresses significant frustration and unhappiness, stating, \"It's frustrating, honestly,\" \"My brain is just... a mess of thoughts right now,\" and \"I really need to get a grip.\" While they found some comfort in quiet places, overall mood is low.\n-   **Sleep:** The student directly states, \"My sleep is fine,\" indicating good sleep quality.\n-   **Social:** There is no mention of direct social interaction. The student describes spending time alone in places like the Admissions Office or \"just being around that creative energy\" at the Hopkins Center, suggesting a lack of active social engagement."}
{"week": 2, "emotion": {"stamina": 85, "knowledge": 80, "stress": 98, "happy": 10, "sleep": 90, "social": 25}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 9, "total_questions": 10, "week": 2}, "weekly_desc": "This week felt… heavy. Like a thick blanket of grey just settled over everything. My happiness meter must be in the basement, because that’s exactly how I feel. Just… low.\n\nClasses. Oh god, classes. I don't even know where to begin. I missed everything. Every single ENGS 025, 069, 093 lecture. It’s like I’d wake up, see the time, and just… freeze. The thought of going, of facing whatever was waiting, just felt impossible. I know I *should* have been at lsb for ENGS 069 on Thursday and Friday, and then again Monday and Wednesday. And cummings for ENGS 025, and MacLean for 093. But I just couldn't. It’s this weird cycle where the more I miss, the more anxious I get about going, and then I miss more. It’s a mess.\n\nI spent a lot of time in my room, the Admissions Office, just… existing. It feels like a safe bubble, even if it’s also a bit of a prison. I did manage to drag myself out sometimes. Thursday afternoon, I was near the Life Sciences Center, and then later at the Hopkins Center for the Arts. The Hop is always a good escape. Just being surrounded by creativity, it’s a different kind of energy. I went back there late Thursday night, and again Saturday evening. It’s a nice distraction from the constant hum of deadlines in my head.\n\nFriday afternoon, I was back at the Life Sciences Center, but again, not for class. Just sort of wandering, I guess. And then later that evening, I actually made it to Leverone Field House. That was good, at least I got some movement in. My body feels fine, it’s my head that’s the problem. Monday, I was out in Zahm Courtyard super late, just needed some air, I think. And then later that day, I was at the Life Sciences Center again, and Fairchild Physical Sciences Center in the evening. I guess I gravitate towards academic buildings, even if I'm not actually *in* class. It's like I'm trying to absorb knowledge by osmosis or something.\n\nSocially, it was pretty quiet. My social battery is definitely running low. I didn't really connect with anyone this week. It’s not that I don’t want to, it’s just… hard to initiate when I feel this overwhelmed. I guess that contributes to the low happiness too.\n\nThe biggest challenge, obviously, was just showing up. And the deadlines. Oh my god, the deadlines. There are so many of them, especially for Wednesday and Monday. It’s like a constant pressure cooker, and instead of dealing with it, I just… deflate. I know I have a lot of knowledge, I feel like I understand the concepts, but the execution, the actual *doing* of the work, feels impossible right now. It’s frustrating because I know I *can* do it, but the motivation just isn't there, or it gets swallowed by the anxiety. At least I'm getting a lot of sleep, which is something, I guess. My stamina is surprisingly high, so physically I'm okay, but mentally I'm just drained.\n\nFor next week, my goal, my absolute non-negotiable goal, is to go to class. Just *go*. Even if I just sit there and absorb a fraction of it. I need to break this cycle. I need to be in those ENGS 069, 093, and 025 lectures. And I need to pick *one* deadline, just one, and actually make significant progress on it. Not all of them, just one. I need to feel like I’m not drowning. I just want to feel a little less guilty, a little less overwhelmed, and maybe, just maybe, a little bit happier.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: 85 was chosen because the student explicitly states, \"My stamina is surprisingly high, so physically I'm okay,\" indicating good physical energy despite mental drain.\n- **Knowledge**: 80 was chosen because the student mentions, \"I know I have a lot of knowledge, I feel like I understand the concepts,\" suggesting a strong grasp of the material.\n- **Stress**: 98 was chosen due to overwhelming phrases like \"Oh my god, the deadlines,\" \"constant pressure cooker,\" \"swallowed by the anxiety,\" and feeling \"overwhelmed\" and \"anxious\" about missing classes.\n- **Happy**: 10 was chosen as the student states, \"My happiness meter must be in the basement, because that’s exactly how I feel. Just… low,\" and describes the week as \"heavy\" and \"a thick blanket of grey.\"\n- **Sleep**: 90 was chosen because the student directly states, \"At least I'm getting a lot of sleep,\" indicating sufficient rest.\n- **Social**: 25 was chosen because the student describes their social life as \"pretty quiet,\" their \"social battery is definitely running low,\" and they \"didn't really connect with anyone this week.\""}
{"week": 3, "emotion": {"stamina": 85, "knowledge": 80, "stress": 98, "happy": 10, "sleep": 90, "social": 25}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 8, "total_questions": 10, "week": 3}, "weekly_desc": "Ugh, this week. It felt like a blur, honestly. My brain just feels… fuzzy. Looking back, it’s pretty clear why I’m feeling so low on the happy scale. Like, a 10? That’s rough.\n\nClasses. Right. The schedule says I have them, but my internal log says \"no class experience recorded.\" That’s… accurate. I didn't make it to any of my ENGS classes this week. Not 025, not 069, not 093. It’s not that I don’t *want* to go, or that I don’t care about the material – my knowledge is still pretty high, so I guess I’m absorbing things somehow, or maybe I just know a lot already. But actually getting myself there, especially with everything else swirling around, just felt impossible. It’s like there’s this invisible wall. I know I *should* be there, and then the guilt just makes it harder to even think about.\n\nMost of my time seems to have been spent at the Admissions Office, which is weird. I mean, it’s quiet, I guess? A lot of \"no activity\" there, which probably means I was just… existing. Maybe trying to focus, maybe just staring into space. It’s a strange place to spend so much time, but sometimes you just need to be somewhere that isn't your room, but also isn't too stimulating. I did have some \"activity\" there a few times, like Thursday afternoon and Friday evening, and even super early Wednesday morning. Not sure what I was doing, but at least I was *doing* something, even if it was just being present.\n\nThe Hopkins Center was a bit of a refuge, though. I was there a few times, late on Thursday and again after midnight on Tuesday. It’s nice to just be around that creative energy, even if I’m not actively participating. It’s a good escape from the constant hum of deadlines. And the Boathouse, too – I was there Wednesday and Monday evening. It’s a good spot to clear my head, just watch the water. It’s not exactly a social hub for me, but it’s a place where I can just *be*.\n\nI also ended up at McNutt Hall twice, which is interesting since my classes are all engineering. I don't really have a reason to be there, but I guess I was just wandering, exploring. Or maybe I was trying to find a different kind of stimulation, something outside my usual academic bubble.\n\nSocially, I’m still pretty low. I mean, 25? That feels about right. I’m not completely isolated, but I’m definitely not seeking out big groups. The Boathouse and Hopkins Center visits were probably more about personal space than connecting with people. It’s hard to be super social when you feel this overwhelmed.\n\nAnd the deadlines. Oh my god, the deadlines. They’re just piling up. So many for Wednesday, then Monday, then Wednesday again, and scattered throughout the rest of the week. It’s like a constant low-level hum of dread in the back of my mind. That’s definitely contributing to the low happiness and probably why my neuroticism is so high. It feels like I’m drowning in things I *should* be doing, but can’t quite bring myself to start. My stamina is surprisingly high, and I’m getting a lot of sleep, which is good, but it feels like my brain is just refusing to cooperate with my body.\n\nChallenges? Definitely the lack of motivation for classes, the sheer volume of upcoming work, and just feeling generally disconnected and anxious. It’s a weird paradox – I’m getting enough sleep, I have energy, and I know my stuff, but the mental block is just massive.\n\nFor next week, I really need to try and break this cycle. My goals are pretty simple, but feel huge right now:\n1.  **Attend at least one class.** Just one. Any one. Just to prove I can do it.\n2.  **Pick one deadline and actually make significant progress on it.** Not all of them, just one. Maybe the earliest one, or the one that seems least daunting.\n3.  **Find a new quiet spot on campus.** The Admissions Office is getting a bit… repetitive. Maybe somewhere with more natural light.\n4.  **Try to reach out to someone.** Even just a text. My social score is too low, and I know that doesn't help anything.\n\nIt feels like a lot, but I have to start somewhere. This feeling of being stuck is just exhausting.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"My stamina is surprisingly high\" and \"I’m getting enough sleep, I have energy,\" indicating good physical energy despite mental struggles.\n- **Knowledge**: The student mentions, \"my knowledge is still pretty high\" and \"I know my stuff,\" suggesting confidence in their academic understanding even if they aren't attending classes.\n- **Stress**: The journal is filled with indicators of high stress, such as \"constant hum of deadlines,\" \"constant low-level hum of dread,\" \"feels like I’m drowning,\" and \"feeling generally disconnected and anxious.\"\n- **Happy**: The student directly quantifies their happiness as \"low on the happy scale. Like, a 10? That’s rough,\" and generally expresses negative feelings like \"Ugh, this week,\" and \"feeling so low.\"\n- **Sleep**: The student clearly states, \"I’m getting a lot of sleep, which is good\" and \"I’m getting enough sleep,\" indicating sufficient rest.\n- **Social**: The student directly confirms their social state, saying, \"Socially, I’m still pretty low. I mean, 25? That feels about right,\" and notes that their activities were \"more about personal space than connecting with people.\""}
{"week": 4, "emotion": {"stamina": 90, "knowledge": 90, "stress": 95, "happy": 15, "sleep": 85, "social": 10}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Activities & Intents", "correct_answers": 10, "total_questions": 10, "week": 4}, "weekly_desc": "Another week, and it feels like I'm just… floating. Or maybe sinking, depending on the hour. My brain feels full, like there's so much I *could* be doing, so much I *know*, but actually doing it? That's a whole other story.\n\nClasses. Right. That's a thing. I know I have ENGS 025, 069, 093. I see them on my schedule, I know where they are. But somehow, the days just… happen. I didn't make it to any of them this week. Again. It's this weird mix of knowing I *should* be there, feeling a knot in my stomach about not being there, and then just… not going. It's like there's a wall between me and the lecture hall. The thought of walking in, feeling like I'm already behind, it just makes me want to curl up. My knowledge stats are high, which is ironic, because it's not like I'm actively learning anything new in a structured way. It's more like I'm absorbing things through osmosis, or maybe just remembering what I already knew.\n\nMost of my time felt like it was spent in this weird limbo, mostly around the Admissions Office area. I don't know why, it's just where I ended up. Not really doing anything, just… existing. It's quiet there, I guess. A lot of \"no activity\" hours, which pretty much sums up how I felt. Just a lot of blank space.\n\nBut then, there were these moments. Like Wednesday night, suddenly I was in Sudikoff Hall. I don't even remember what I was doing, just… something. And then, out of nowhere, I ended up at the Hood Museum. It was late, almost midnight, but there was something about being there, just wandering through the quiet halls, looking at the art. It felt… expansive. Like my mind could finally breathe. And the Hopkins Center, too. I found myself there a few times, late at night, just soaking in the atmosphere. There's a certain energy there, even when it's empty, that I find really compelling. It's like my brain craves that kind of input, that kind of beauty, even when the rest of me is just… stuck.\n\nThursday was a bit of a blur. I remember ending up at Dick's House in the afternoon. Just felt a bit off, you know? Nothing major, just needed to check in. It's hard to shake this general feeling of unease lately. My happiness is pretty low, and I can feel that anxiety buzzing under the surface most of the time.\n\nSocially, it was a pretty quiet week. My social meter is definitely on the low side. I didn't really connect with anyone. It's not that I don't want to, it's just… the energy isn't there. Or maybe I just don't know how to start. I feel like I'm a ghost sometimes, just moving through campus without really interacting.\n\nThe biggest challenge, honestly, is the sheer number of deadlines looming. It's like a tidal wave. So many things due on Wednesday, then Monday, then Wednesday again. My stomach clenches just thinking about it. I know I need to get on top of them, but the more I think about it, the more paralyzed I feel. It's a vicious cycle.\n\nFor next week, I really, *really* need to break this cycle. My goals are pretty clear, even if executing them feels impossible right now:\n1.  **Go to class.** Just one. Start with one. Maybe ENGS 069 on Monday, since it's earlier. Just show up.\n2.  **Tackle *one* deadline.** Pick the easiest one, or the one that's due soonest, and just get it done. Even if it's not perfect. Just to prove to myself I can.\n3.  **Find a way to feel less… isolated.** Maybe just grab coffee with someone, anyone. Or even just sit in a common area and try to be present.\n\nI'm sleeping a lot, which is good, I guess. My stamina is high, so it's not a physical exhaustion thing. It's more like a mental block. I just need to figure out how to push through it. I know I can. I just need to *do* it.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states, \"My stamina is high, so it's not a physical exhaustion thing.\" This indicates a high level of physical energy, despite mental blocks.\n-   **Knowledge:** The student directly mentions, \"My knowledge stats are high,\" and that their \"brain feels full, like there's so much I *know*.\" This suggests a strong existing knowledge base.\n-   **Stress:** The student describes \"feeling a knot in my stomach,\" \"a general feeling of unease,\" and \"anxiety buzzing under the surface.\" They are highly stressed by \"the sheer number of deadlines looming,\" which causes their \"stomach clenches\" and makes them feel \"paralyzed.\"\n-   **Happy:** The student explicitly states, \"My happiness is pretty low,\" and describes feeling \"just… floating. Or maybe sinking,\" and \"a lot of blank space.\" While there were \"moments\" of feeling \"expansive\" at the museum/Hopkins Center, these were exceptions to a generally low mood.\n-   **Sleep:** The student states, \"I'm sleeping a lot, which is good, I guess,\" indicating a sufficient quantity of rest.\n-   **Social:** The student explicitly states, \"My social meter is definitely on the low side,\" and that they \"didn't really connect with anyone.\" They feel \"like I'm a ghost sometimes, just moving through campus without really interacting,\" highlighting a strong sense of isolation."}
{"week": 5, "emotion": {"stamina": 85, "knowledge": 35, "stress": 98, "happy": 8, "sleep": 80, "social": 10}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 10, "total_questions": 10, "week": 5}, "weekly_desc": "This week felt… heavy. Like a thick blanket I couldn't quite shake off. Looking back, it's hard to pinpoint exactly what I *did*. Or, more accurately, what I *didn't* do.\n\nClasses. Yeah, classes. I didn't make it to any of them. Not ENGS 025, not 069, not 093. I saw the times on my schedule, I knew where they were supposed to be, but every time, it just felt like too much. Like there was this invisible wall between me and the lecture hall. It’s weird, because I feel like I understand the material, or at least I *could* if I just showed up. But the thought of sitting there, of having to engage, it just… paralyzed me. I know I'm falling behind, and that thought just makes the wall even higher. It's a vicious cycle, and honestly, it makes me feel pretty terrible. My happiness score must be in the gutter, and it is.\n\nMost of my time was spent at what the system calls the \"Admissions Office,\" which is basically just my room. I was there a lot. A *lot*. Just… existing. Sometimes I'd try to open a textbook, or look at the assignments, but then I'd just stare at the wall. It’s like my brain just decided to go on strike. There are so many deadlines piling up, it's overwhelming. Every time I look at the list, it just feels like a mountain I can't climb. Monday, Wednesday, Friday, deadlines everywhere. It’s suffocating.\n\nI did manage to get out a few times, which was something. The Hopkins Center was a bit of a refuge. I found myself there late at night a couple of times, just wandering, or maybe catching a performance. It’s a place where I can just *be* without feeling the pressure of everything else. The art, the atmosphere, it’s a nice escape from the constant hum of anxiety in my head. And I made it to the Boathouse twice. That was good. Just being by the water, getting some fresh air, it felt like a brief moment of clarity. But then it was back to the room, back to the same cycle.\n\nMy sleep has actually been pretty decent, which is surprising given how low I feel. And my stamina is fine. It’s not a physical exhaustion, it’s more like a mental and emotional one. I feel so disconnected. My social score is abysmal, and I can feel it. I haven't really connected with anyone properly this week. It’s hard to reach out when you feel like this, like you’re just treading water.\n\nThis can't keep going. I know that. For next week, I *have* to break this pattern. My main goal is simple: show up. Just show up to my classes. Even if I just sit there and absorb a fraction of it, it's better than nothing. I also need to pick *one* deadline, just one, and tackle it. Not the whole mountain, just one rock. Maybe the one due on Tuesday, since there's only one then. And I need to try and connect with someone. Even just a quick chat. This isolation isn't helping anything. I need to find a way to pull myself out of this slump. I really do.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 85 - The student explicitly states, \"My stamina is fine. It’s not a physical exhaustion,\" and mentions being able to get out to the Hopkins Center and Boathouse, indicating good physical energy and capacity.\n- **Knowledge:** 35 - The student notes, \"I know I'm falling behind,\" and describes their \"brain just decided to go on strike,\" indicating a significant impediment to learning and new knowledge acquisition, despite feeling they *could* understand the material.\n- **Stress:** 98 - The journal is filled with indicators of extreme stress, such as feeling \"heavy,\" \"paralyzed,\" \"overwhelming,\" \"suffocating,\" and experiencing a \"constant hum of anxiety.\"\n- **Happy:** 8 - The student directly states, \"it makes me feel pretty terrible\" and \"My happiness score must be in the gutter, and it is,\" reflecting a very low emotional state.\n- **Sleep:** 80 - The student explicitly mentions, \"My sleep has actually been pretty decent,\" suggesting good quality sleep despite other struggles.\n- **Social:** 10 - The student feels \"so disconnected,\" states \"My social score is abysmal,\" and notes, \"I haven't really connected with anyone properly this week,\" indicating severe social isolation."}
{"week": 6, "emotion": {"stamina": 55, "knowledge": 15, "stress": 99, "happy": 5, "sleep": 75, "social": 5}, "lab_assessment": {"score": 6.996, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 6, "total_questions": 10, "week": 6}, "weekly_desc": "Ugh, this week. It feels like a blur, honestly. Like I was just… floating. Or maybe sinking, depending on the hour. My brain feels like a tangled mess of wires, and my body just wants to curl up and disappear.\n\nI know I missed all my classes again. Every single one. ENGS 025, 069, 093… I saw them on my schedule, I really did. But when the time came, I just couldn't bring myself to go. It’s this weird paralysis. I’d be at the Admissions Office, or sometimes the Hop, just… existing. I don't know why I spend so much time at the Admissions Office. It's quiet, I guess. Sometimes I think I'll get some work done there, but then hours just melt away. It's not like I'm doing anything productive. Most of the time, I'm just sitting, staring, thinking about everything and nothing.\n\nThe Hop is different. Late at night, it feels like a different world. I find myself there when I can't sleep, or when I just need to escape the quiet of my own thoughts. It's a strange comfort, being in a place that's usually so full of life, but completely empty.\n\nI feel so guilty about skipping. The deadlines are piling up, and it’s like a physical weight on my chest. So many Wed and Mon deadlines, it’s insane. How am I supposed to catch up when I can barely even start? My knowledge feels like it's just… gone. Like everything I learned just evaporated. It makes me anxious just thinking about it.\n\nThere were a few moments, though. I remember being at the Admissions Office super early on Thursday and Friday, like 2 AM and 4 AM. I don't even know what I was doing, just moving around, I guess. And then Saturday afternoon, I actually made it to the Boathouse. That was… nice. Just being by the water, feeling the air. It was a brief escape from the constant hum of worry. And Sunday evening, I was out in Zahm Courtyard. It was quiet, and I just sat there for a bit. Those moments felt like tiny islands in a sea of nothingness.\n\nBut mostly, I feel so disconnected. My social meter is practically at zero. I haven't really talked to anyone, not properly. I see people, but it’s like I’m watching a movie of their lives, not living my own. It makes me feel incredibly lonely, even when I'm surrounded by people. I'm not sure why I'm so bad at reaching out right now. Part of me wants to, but another part just feels too tired, too overwhelmed.\n\nMy happiness is definitely in the gutter. It’s hard to feel happy when you’re constantly battling this internal dread. My sleep is surprisingly okay, which is weird, given how much I'm stressing. Maybe my body just gives up and forces me to sleep. And stamina, well, I'm not exactly running marathons, but I'm not completely drained physically. It's all mental.\n\nNext week… I need to do something. I *have* to. My goal, my desperate, desperate goal, is to actually go to class. Just one. Or two. Even if I just sit there and absorb nothing, I need to be there. I need to try and talk to someone, anyone, even just a quick chat. And I need to look at those deadlines, really look at them, and pick one thing, just one, to start on. Even if it’s just opening the assignment. I know it sounds pathetic, but right now, that feels like climbing a mountain. I just want to feel like I'm moving forward, even if it's just a tiny step. I can't keep doing this.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student states, \"I'm not completely drained physically,\" suggesting some physical capacity, but also mentions \"My body just wants to curl up and disappear\" and feeling \"too tired\" to reach out, indicating a significant mental and emotional drain that impacts their ability to act.\n- **Knowledge**: The student explicitly says, \"My knowledge feels like it's just… gone. Like everything I learned just evaporated,\" and notes they \"missed all my classes again. Every single one,\" directly impacting their current knowledge and ability to learn.\n- **Stress**: This is extremely high. The student describes \"deadlines are piling up, and it’s like a physical weight on my chest,\" feeling \"anxious just thinking about it,\" experiencing a \"constant hum of worry,\" and \"constantly battling this internal dread.\" They also directly state, \"My sleep is surprisingly okay, which is weird, given how much I'm stressing.\"\n- **Happy**: The student directly states, \"My happiness is definitely in the gutter,\" and describes feeling \"incredibly lonely\" and \"constantly battling this internal dread,\" leaving little room for positive emotions.\n- **Sleep**: Despite high stress, the student explicitly mentions, \"My sleep is surprisingly okay, which is weird, given how much I'm stressing. Maybe my body just gives up and forces me to sleep,\" indicating that sleep quality is relatively stable.\n- **Social**: The student clearly states, \"My social meter is practically at zero,\" feels \"so disconnected,\" and \"haven't really talked to anyone, not properly,\" leading to feelings of being \"incredibly lonely.\""}
{"week": 7, "emotion": {"stamina": 30, "knowledge": 90, "stress": 95, "happy": 5, "sleep": 75, "social": 5}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 10, "total_questions": 10, "week": 7}, "weekly_desc": "This week feels… heavy. Like trying to walk through thick mud. I look at my schedule – ENGS 025, 069, 093 – and it’s all there, laid out, but when I try to remember what actually *happened* in those classes, it’s just a blur. Or, more accurately, a blank. \"No class experience recorded this week.\" Yeah, that about sums it up.\n\nI know I *should* have been in Cummings, LSB, MacLean. I saw the times, I know the buildings. But then Monday rolls around, and instead of being in ENGS 093 or 025, I was at the Boathouse. Just… there. Doing *something*, I guess, but mostly just existing. It’s weird, because I know I have a lot of knowledge, like my brain is packed with information, but it feels like none of it connects to actually *doing* the things I'm supposed to do. It’s like I have all the ingredients for a cake, but I can’t bring myself to bake it.\n\nAnd the Admissions Office. Why do I keep ending up there? Friday evening, Saturday afternoon, Monday, even Tuesday morning at 5 AM. I wasn't *doing* anything, just… being near it. Maybe it’s a reminder of how I got here, or how much I wanted to be here, and now I’m just… adrift. It’s a strange place to find myself, especially when I’m feeling so incredibly unhappy. Like, a 5 out of 100? That’s pretty low.\n\nThe deadlines are just a constant hum in the background, a low-frequency anxiety that never quite goes away. So many of them, piling up for Wednesday and Monday. It’s overwhelming. I look at the list and my brain just shuts down. It’s easier to just… not look. Or to go to the Boathouse. Or wander near the Admissions Office.\n\nMy social life is basically non-existent right now. A 5? Yeah, that tracks. I haven't really connected with anyone. I guess that contributes to the general gloom. I’m sleeping okay, which is something, but it doesn’t seem to be helping with the overall feeling of dread or the lack of motivation. My stamina is alright, but what’s the point of having energy if you don’t know what to do with it, or if the thought of doing anything just makes you want to curl up?\n\nThe biggest challenge is just… showing up. Not just physically, but mentally. Being present. I feel like I’m constantly fighting this urge to just disengage, to float through the days. And the deadlines, they’re like a physical weight. I know I have the capacity to understand the material, but the sheer volume of *doing* it feels impossible.\n\nFor next week, I guess the goal is to try and break this cycle. I need to actually *go* to my classes. Not just be in the vicinity of campus, but actually sit in the lecture halls. And those deadlines… I need to pick one, just one, and try to make a dent in it. Even a tiny dent. And maybe, just maybe, try to say hi to someone. Or respond to a text. Just something to feel a little less isolated. It feels like a monumental task, but I have to try, right? I just have to figure out how to get myself to actually *do* it.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student describes the week as feeling \"heavy. Like trying to walk through thick mud\" and mentions \"fighting this urge to just disengage.\" While they state \"My stamina is alright,\" they immediately qualify it with \"but what’s the point of having energy if you don’t know what to do with it, or if the thought of doing anything just makes you want to curl up?\" This indicates a severe lack of mental and motivational stamina, making it difficult to engage in tasks, despite potential physical energy. The effective stamina for productive work is very low.\n- **Knowledge:** The student explicitly states, \"I know I have a lot of knowledge, like my brain is packed with information\" and \"I know I have the capacity to understand the material.\" This indicates a high self-perception of their knowledge base, even if they struggle with applying it.\n- **Stress:** The student describes deadlines as \"a constant hum in the background, a low-frequency anxiety that never quite goes away\" and finds them \"overwhelming.\" They also state, \"I look at the list and my brain just shuts down\" and that deadlines are \"like a physical weight,\" all pointing to very high stress levels.\n- **Happy:** The student directly states, \"I’m feeling so incredibly unhappy. Like, a 5 out of 100? That’s pretty low.\" They also mention a \"general gloom\" and \"overall feeling of dread.\"\n- **Sleep:** The student explicitly says, \"I’m sleeping okay, which is something.\" This suggests a moderate to good level of sleep, not perfect, but not a significant issue.\n- **Social:** The student directly states, \"My social life is basically non-existent right now. A 5? Yeah, that tracks.\" They also mention not having \"really connected with anyone\" and wanting to feel \"a little less isolated.\""}
{"week": 8, "emotion": {"stamina": 15, "knowledge": 85, "stress": 98, "happy": 5, "sleep": 70, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "Ugh, this week. It feels less like a week and more like a blur of impending doom. My happiness meter is definitely stuck in the red, and honestly, I'm not surprised.\n\nClasses... what classes? The journal says \"no class experience recorded,\" and yeah, that pretty much sums it up. I know I *should* have been in Cummings for ENGS 025, or LSB for ENGS 069, and MacLean for ENGS 093. I saw the schedule, I know the times – Friday, Monday, Thursday, Wednesday, it's all there. But actually *being* there, engaging, absorbing anything? That just didn't happen. It's like my brain just decided to shut down the moment I thought about stepping into a lecture hall. The thought of all those deadlines piling up just paralyzes me. Look at them – Wed 23:59, Mon 23:59, Tue 23:59, Fri 23:59... it's a never-ending cascade. How am I supposed to even start when there's so much? It just makes me want to curl up and disappear.\n\nMy social life is basically non-existent right now, which probably isn't helping the whole \"happiness\" situation. I feel like I've been holed up, just trying to avoid the sheer weight of everything. My stamina is shot, too. Even with decent sleep, I just feel drained, like every step is an effort. It's weird, because my knowledge levels are still high, like I'm absorbing things passively or something, but it's not translating into actual *doing*.\n\nI remember being at the Admissions Office on Friday around noon. \"Activity: No\" is what the data says, and it's so accurate it hurts. I wasn't there for anything specific, just... there. Wandering, I guess. Or maybe just standing still, trying to breathe, trying to figure out what I'm even doing here. It felt like a moment of complete aimlessness in the middle of all this chaos. Like, I'm surrounded by all these expectations and deadlines, and I just found myself in a place where people *start* their journey here, and I felt like I was just... stuck.\n\nThe biggest challenge is definitely the overwhelming feeling of being behind and the anxiety that comes with it. It's a vicious cycle: I'm anxious, so I procrastinate, which makes me more anxious. And the thought of all those ENGS assignments just sitting there, waiting... it's a lot.\n\nFor next week, I *have* to break this cycle. My goal is simple, but feels monumental: just show up. Not just physically, but mentally. I need to get to those ENGS classes, even if I just sit there and absorb a fraction of it. And I need to tackle *one* deadline. Just one. Pick the earliest, or the easiest, and just get it done. Maybe if I get one thing off my plate, the rest won't feel so impossible. And maybe, just maybe, I can try to connect with someone, even briefly. My social score is abysmal, and I know isolating myself isn't helping. I just need to find a way to feel like I'm part of things again, even a little bit. This feeling of being adrift is just... exhausting.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"My stamina is shot, too,\" and describes feeling \"drained, like every step is an effort,\" indicating very low physical and mental energy.\n- **Knowledge**: The student directly mentions, \"my knowledge levels are still high, like I'm absorbing things passively or something,\" and demonstrates awareness of course schedules and numbers (\"I know I *should* have been in Cummings... I saw the schedule, I know the times\").\n- **Stress**: The student uses phrases like \"blur of impending doom,\" \"The thought of all those deadlines piling up just paralyzes me,\" \"never-ending cascade,\" and directly states, \"The biggest challenge is definitely the overwhelming feeling of being behind and the anxiety that comes with it.\" This indicates extremely high stress and anxiety.\n- **Happy**: The student explicitly states, \"My happiness meter is definitely stuck in the red,\" and expresses a desire to \"curl up and disappear,\" indicating a very low emotional state.\n- **Sleep**: The student mentions, \"Even with decent sleep, I just feel drained,\" implying that sleep quality itself is not the primary issue and is at a reasonable level, though not enough to counteract other stressors.\n- **Social**: The student directly states, \"My social life is basically non-existent right now,\" and \"My social score is abysmal,\" indicating extreme social isolation."}
{"week": 9, "emotion": {"stamina": 5, "knowledge": 80, "stress": 99, "happy": 1, "sleep": 65, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "Ugh, this week felt like a blur, and not in a good way. Honestly, I'm just… tired. Like, bone-deep tired, even if I'm technically getting enough sleep. My happiness meter is practically on empty, and I feel this constant hum of anxiety buzzing in the background.\n\nClasses. Right. That's the big one. I don't even know what to say. I just… didn't make it to any of them. ENGS 025, 069, 093 – all of them. Every single one. It's not like I don't *want* to go, or that I don't understand the material when I look at it. My brain feels like it's still working, still absorbing information, but getting my body to actually *go* to Cummings or LSB or MacLean? It felt impossible. Like there was this invisible wall. I just couldn't summon the stamina, or the will, or something. It's frustrating because I know I'm falling behind, and that just makes the anxiety worse, which then makes it even harder to get out of bed. It's a vicious cycle.\n\nAnd the deadlines. Oh my god, the deadlines. It feels like every single day has something due, or something looming. Wednesday, Monday, Tuesday, Friday, Saturday – they're just piling up. It's like looking at a mountain range of assignments, and I'm just standing at the bottom, completely overwhelmed, not knowing where to even start. That's probably a huge part of why I couldn't face classes. The thought of adding more to the pile, or being reminded of what I *should* be doing, just felt too heavy.\n\nCampus felt pretty empty for me this week, too. My social battery is completely drained, or maybe it just never got charged. I barely saw anyone, barely talked to anyone. The only real \"activity\" I had was somehow ending up at the Admissions Office on Wednesday evening. I don't even know why I was there, or what I was doing. Just… existing, I guess. Wandering. It felt a bit surreal, like I was a ghost haunting the place, or maybe just lost. It definitely didn't help with feeling connected to anything or anyone.\n\nSo, yeah. Challenges? Everything. Getting out of bed, facing the mountain of work, feeling completely isolated, the constant hum of dread. My brain feels full of knowledge, but my body and spirit are just… not there.\n\nFor next week, I *have* to break this cycle. I need to:\n1.  Actually go to my classes. Even if it's just one, just to get back into the rhythm. I need to show up.\n2.  Pick *one* deadline, just one, and tackle it. Get something, anything, off my plate. Maybe the earliest Wednesday one.\n3.  Try to connect with someone. Even just a quick text or a coffee. I feel so alone right now, and I know that's not helping.\n4.  Figure out how to get my stamina back up. Maybe it's just the mental load, but I need to find a way to feel less utterly drained.\n\nIt feels like a lot, but I can't keep going like this. I just can't.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"I'm just… tired. Like, bone-deep tired,\" and \"I just couldn't summon the stamina, or the will, or something.\" They also mention needing to \"find a way to feel less utterly drained,\" indicating extremely low physical and mental energy.\n- **Knowledge**: Despite not attending classes, the student notes, \"It's not like I don't *want* to go, or that I don't understand the material when I look at it. My brain feels like it's still working, still absorbing information,\" and \"My brain feels full of knowledge.\" This suggests their cognitive ability and understanding of the material remain high.\n- **Stress**: The journal is permeated with high stress indicators: \"constant hum of anxiety buzzing in the background,\" \"makes the anxiety worse,\" \"Oh my god, the deadlines. It feels like every single day has something due,\" \"completely overwhelmed, not knowing where to even start,\" and \"the constant hum of dread.\" This points to an extremely high level of stress and overwhelm.\n- **Happy**: The student directly states, \"My happiness meter is practically on empty,\" and describes the week as \"a blur, and not in a good way,\" indicating a near-zero level of happiness.\n- **Sleep**: The student mentions, \"even if I'm technically getting enough sleep.\" This suggests that while the *quantity* of sleep might be adequate, its restorative *quality* is clearly not, given their profound tiredness. However, based on the \"technically getting enough\" phrase, the numerical value for sleep quantity is not at rock bottom.\n- **Social**: The student reports, \"Campus felt pretty empty for me this week,\" \"My social battery is completely drained,\" \"I barely saw anyone, barely talked to anyone,\" and \"feeling completely isolated,\" concluding with \"I feel so alone right now.\" This indicates extremely low social interaction and connection."}
{"week": 10, "emotion": {"stamina": 5, "knowledge": 80, "stress": 99, "happy": 1, "sleep": 65, "social": 5}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 29.0, "full_text_response": "This is a very well-articulated and thoughtful project idea. The student has clearly put significant effort into identifying a real problem, proposing a targeted solution, and considering the technical feasibility and user experience.\n\nHere's the evaluation:\n\n*   **Is the idea innovative or unique compared to existing apps?**\n    While habit trackers are common, the specific framing around \"micro-habits so small you can't say no,\" the emphasis on \"gentle, non-judgmental\" momentum building for the *overwhelmed* user, and the inclusion of a \"brain dump\" feature specifically for mental clutter, gives \"Momentum Mender\" a distinct and empathetic niche. It's not a revolutionary concept, but it's a well-refined and psychologically informed approach to an existing problem space.\n*   **Does it clearly address a real problem or user need?**\n    Absolutely. The student eloquently describes the common struggle with overwhelm, procrastination, and maintaining consistency, particularly for those feeling low energy or high anxiety. This is a highly relatable and pervasive problem, making the proposed solution genuinely useful. The personal connection articulated by the student further validates the problem's reality.\n*   **Is the idea technically feasible for implementation by a student team within one semester?**\n    Excellent. The student has broken down the core features and explicitly linked them to fundamental smartphone programming concepts (UI/UX, local data persistence, notification APIs, basic custom views). The scope avoids complex external dependencies or advanced algorithms, making it highly achievable within a semester while still providing a complete and functional application.\n*   **Is the scope appropriate (not too simple, not too ambitious)?**\n    The scope is near-perfect. It's substantial enough to demonstrate a wide range of mobile development skills (UI, data, notifications, basic visualization) without being so ambitious that it becomes unmanageable for a semester project. The student also correctly identifies clear pathways for future expansion, showing a good understanding of the project's boundaries.\n*   **Does it demonstrate thoughtful consideration of user experience and impact?**\n    This is a strong point of the proposal. The student has clearly thought about the target user's emotional state and designed features (gentle reminders, minimal setup, focus on tiny wins, brain dump) to directly address feelings of overwhelm and lack of motivation. The emphasis on making progress feel \"easy\" and \"rewarding\" for someone \"running on fumes\" shows deep empathy and a strong user-centered design approach.\n\n**29/30**"}, "weekly_desc": "Ugh. Another week. Honestly, this one felt less like a week and more like a prolonged state of existential dread. My happy meter is apparently at 1, and yeah, that tracks. It feels like a generous estimate, actually.\n\nClasses? What classes? The schedule is just a blur of times and buildings I didn't step foot in. ENGS 025 at cummings, ENGS 069 at lsb, ENGS 093 at maclean... they all just exist as entries on a calendar, not places I actually went. The thought of getting up, getting dressed, and actually *being* somewhere felt like an insurmountable task. It's weird, because I know I *should* be there. My brain just... short-circuits. It's like there's a heavy, invisible wall between me and the door.\n\nMy stamina is at 5, and that's exactly how it feels. Just utterly drained. And the sleep, 65%... it's enough to function, I guess, but not enough to feel rested or motivated. It's this constant low hum of exhaustion.\n\nThen there are the deadlines. Oh my god, the deadlines. They're like a swarm of angry bees buzzing around my head. Wed 23:59, Mon 23:59, Tue, Thu, Fri, Sat... they're everywhere. Just looking at the list makes my chest tighten. It's so many, and I haven't even started on most of them. The more I look, the more overwhelmed I get, and then I just... don't do anything. It's a terrible strategy, I know, but it's like my brain just shuts down to protect itself from the sheer volume of \"to-dos.\"\n\nSocial life? Non-existent. My social score is 5, which is probably accurate. I barely left my room, let alone interacted with anyone. Part of me desperately wants to connect, to just talk to someone, but the other part feels too heavy, too anxious, too ashamed to even try. It's a vicious cycle of isolation feeding the anxiety, and the anxiety feeding the isolation.\n\nThe biggest challenge this week was just the inertia. The sheer weight of not doing anything, which then makes it even harder to start doing anything. And the guilt. The guilt is a constant companion, whispering about all the things I *should* be doing, all the opportunities I'm missing. My knowledge is apparently high, which is ironic because I feel like I know nothing about how to actually manage my life right now.\n\nFor next week, I *have* to break this cycle. I really do. My goals are probably too ambitious, but I need to aim for something.\n1.  Just attend *one* class. Any class. Just to prove to myself I can still do it. Maybe ENGS 093 on Tuesday, since it's just one session that day.\n2.  Pick *one* deadline, the most urgent one, and just chip away at it. Even if it's just for an hour. I need to feel like I'm making progress, even tiny progress.\n3.  Get out of my room. Even if it's just to walk around campus for 15 minutes. Get some fresh air, see other people.\n4.  Maybe, just maybe, send a text to someone. Anyone. Just to feel a little less alone.\n\nI just want to feel a little less suffocated by everything. A little less overwhelmed. A little less... 1.", "judge_reasoning": "```\n\nReasoning:\n- Stamina: The student explicitly states, \"My stamina is at 5, and that's exactly how it feels. Just utterly drained.\" They also mention \"The thought of getting up... felt like an insurmountable task.\"\n- Knowledge: The student acknowledges, \"My knowledge is apparently high,\" referring to the provided status, despite feeling overwhelmed by life management.\n- Stress: The student describes \"a prolonged state of existential dread,\" deadlines as \"a swarm of angry bees buzzing around my head,\" and feeling \"overwhelmed\" to the point where their \"brain just shuts down.\" They also mention \"chest tighten\" and wanting to feel \"less suffocated.\"\n- Happy: The student states, \"My happy meter is apparently at 1, and yeah, that tracks. It feels like a generous estimate, actually.\"\n- Sleep: The student explicitly reports, \"And the sleep, 65%... it's enough to function, I guess, but not enough to feel rested or motivated.\"\n- Social: The student says, \"Social life? Non-existent. My social score is 5, which is probably accurate,\" and adds, \"I barely left my room, let alone interacted with anyone.\" They also describe \"a vicious cycle of isolation.\""}
