{"week": 1, "emotion": {"stamina": 90, "knowledge": 15, "stress": 95, "happy": 40, "sleep": 90, "social": 50}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "Okay, this week was… a lot. Definitely not what I expected, and honestly, I'm feeling a bit all over the place about it.\n\nThe biggest thing, and I know this is going to sound bad, is that I didn't make it to any of my classes. Not a single one. ECON, COSC 050, COSC 065 – all missed. I saw the summary said \"no class experience,\" and yeah, that's painfully accurate. It wasn't intentional, not really. It's just… I found this pottery studio, Davidson Pottery Studio, and it just completely absorbed me. I spent so much time there, especially Monday, Tuesday, and Wednesday mornings. It's a bit of a drive, being in Vermont and all, but once I'm there, I just lose track of time. There's something so incredibly freeing about working with clay, shaping something with your hands. It’s a completely different kind of challenge than what I get in my classes, and I just got really, really into it. I guess my openness really kicked in there, because I just dove headfirst into this new thing.\n\nBut then, the guilt started to creep in. Especially with all those deadlines looming. I mean, there are so many due Sunday, Monday, Tuesday, and Wednesday. Just looking at that list makes my stomach clench a little. My conscientiousness is screaming at me for letting things slide. I know I *should* have been in Kemeny and LSB, learning what I needed to for these assignments. Now I'm going to have to play catch-up, and that's a pretty stressful thought.\n\nMy sleep has been good, which is a relief, and my stamina feels fine, but my schedule has been a bit chaotic. I was up late a few times, like Sunday night at Fairchild and then again early Tuesday morning at the Boathouse. It feels like I'm just bouncing around, trying to fit everything in, but not really succeeding at anything. I did manage to get to the gym on Monday night, which was good for blowing off some steam, and I was around Sudikoff a bit, but not for anything productive, it seems.\n\nSocially, I feel pretty average. I haven't really connected with people much this week, probably because I was off-campus so much. It's a weird feeling, being so engrossed in something new but also feeling a bit isolated from the usual campus rhythm.\n\nThe main challenge, obviously, is the academic fallout from missing all my classes. I'm worried about falling behind, especially with COSC. And the sheer number of deadlines is intimidating. My neuroticism is definitely flaring up, making me second-guess everything and worry about how I'm going to manage.\n\nFor next week, my goals are pretty clear:\n1.  **Get back to class.** No matter what, I need to be in Kemeny and LSB for ECON, COSC 050, and COSC 065. I need to prioritize my studies.\n2.  **Tackle those deadlines head-on.** I need to figure out what I missed and start chipping away at those assignments immediately. No more procrastinating.\n3.  **Find a balance with pottery.** I love it, I really do, but it can't come at the expense of my degree. Maybe I can schedule specific, limited times for it, or find a studio closer to campus if that's an option. I need to be more disciplined with my time.\n4.  **Manage my anxiety.** This feeling of being overwhelmed isn't helping. I need to break down tasks into smaller steps and just focus on one thing at a time to avoid getting paralyzed by the sheer volume of work.\n\nThis week was a wake-up call. I need to be more responsible, even when I find something new and exciting. It's all about finding that equilibrium.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"My stamina feels fine.\" While they mention being \"up late a few times,\" they also managed to \"get to the gym\" and drive to Vermont, indicating a generally good energy level.\n- **Knowledge:** The student admits, \"I didn't make it to any of my classes. Not a single one,\" and acknowledges \"no class experience.\" They express worry about \"falling behind, especially with COSC,\" indicating a significant perceived deficit in academic knowledge for the week.\n- **Stress:** The journal is filled with indicators of high stress: \"guilt started to creep in,\" \"Just looking at that list makes my stomach clench a little,\" \"that's a pretty stressful thought,\" \"worried about falling behind,\" \"the sheer number of deadlines is intimidating,\" \"My neuroticism is definitely flaring up,\" and \"This feeling of being overwhelmed isn't helping.\"\n- **Happy:** The student found significant joy and fulfillment in pottery, describing it as \"incredibly freeing\" and stating, \"I just got really, really into it. I love it, I really do.\" However, this positive experience is heavily overshadowed by \"guilt,\" \"stressful thought,\" and feeling \"overwhelmed\" by academic responsibilities, leading to a net lower happiness.\n- **Sleep:** The student directly states, \"My sleep has been good, which is a relief.\" Although they were \"up late a few times,\" the overall quality of sleep is reported as positive.\n- **Social:** The student directly assesses their social state as \"Socially, I feel pretty average.\" They also note they \"haven't really connected with people much\" and feel \"a bit isolated from the usual campus rhythm,\" which aligns with a neutral, slightly detached social experience."}
{"week": 2, "emotion": {"stamina": 20, "knowledge": 75, "stress": 98, "happy": 15, "sleep": 25, "social": 25}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 10, "total_questions": 10, "week": 2}, "weekly_desc": "This week felt… like a blur, honestly. It’s Sunday night now, and I’m trying to piece together what even happened. My head feels a bit fuzzy, and there’s this knot in my stomach thinking about everything that’s due.\n\nAcademically, it was rough. I know I have classes – ECON 036, COSC 050, COSC 065 – but looking back, I didn't make it to any of them. Not a single one. It’s weird, because I *want* to be on top of things, I really do. My brain feels like it’s capable of understanding the material, but actually getting myself to Kemeny or LSB at 8:45 AM or 10:00 AM just didn't happen. It’s like there’s this invisible wall. The system even says \"No class experience recorded this week,\" which just hits different. It’s true, I guess. I wasn't *there*.\n\nInstead, I found myself in some really odd places at even odder hours. I spent so much time at that Davidson Pottery Studio in Vermont. I mean, it’s a cool place, and I love the idea of just getting lost in something creative, but it’s not exactly on campus, and I was there for hours, sometimes in the middle of the night, sometimes during the day when I should have been in class. A lot of that time was just… \"No Activity.\" Just being there, I guess. It’s a bit of an escape, I suppose, but it’s clearly not helping with the academic side of things.\n\nMy sleep schedule is a mess, even though I feel like I'm getting enough hours in. I was up at Fairchild Physical Sciences Center until 3 AM some nights, then back there at 1 AM, or at the Hopkins Center. Sometimes I was actually doing something, sometimes just… existing. Then I’d be at the pottery studio for half the day, missing everything. It’s a cycle that’s making me feel pretty low, honestly. My happiness score feels like it’s taken a hit, and I can definitely feel the stress building up. All these deadlines popping up – Sunday, Monday, Tuesday, Wednesday – it’s a lot, and I haven’t even started on some of them because I’ve been so off-kilter.\n\nSocially, I feel a bit disconnected. I was at Zahm Courtyard early in the week, and the Boathouse a few times, but it wasn't really *social* social. More just being in places. I guess I haven't really put myself out there much this week, which is a shame because I usually enjoy connecting with people.\n\nI know I’m capable, and I want to do well. My knowledge feels high, but it’s not translating into actual work or attendance. It’s frustrating. This week felt like I was just drifting, pulled by whatever impulse came next, rather than sticking to a plan.\n\nFor next week, I *have* to get back on track. My main goal is simple: **attend every single class.** No more excuses. I need to be present, physically and mentally. Second, I need to **tackle these deadlines head-on**. I’ll make a list, break them down, and actually start working on them during daylight hours. And finally, I need to **re-evaluate my time at the pottery studio**. It’s a great outlet, but it can’t be at the expense of my studies. Maybe I can set specific, limited times for it, or find a creative outlet closer to campus. I need to find a way to channel my energy more productively and get my happiness back up. This feeling of being overwhelmed and behind is just not sustainable.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student describes an \"invisible wall\" preventing class attendance, a feeling of \"drifting,\" and being \"low,\" indicating a significant lack of energy and motivation for academic tasks. They also state, \"This feeling of being overwhelmed and behind is just not sustainable,\" implying a depletion of reserves.\n-   **Knowledge**: The student explicitly states, \"My brain feels like it’s capable of understanding the material\" and \"My knowledge feels high,\" indicating a strong self-perception of their intellectual capacity and existing knowledge base, despite current academic disengagement.\n-   **Stress**: The student reports \"a knot in my stomach,\" explicitly states \"I can definitely feel the stress building up,\" and feels \"overwhelmed and behind\" due to \"all these deadlines popping up,\" indicating extremely high stress levels.\n-   **Happy**: The student states, \"It’s a cycle that’s making me feel pretty low, honestly,\" and \"My happiness score feels like it’s taken a hit,\" clearly indicating a very low emotional state.\n-   **Sleep**: The student explicitly states, \"My sleep schedule is a mess,\" and describes highly irregular and late hours, being \"up at Fairchild Physical Sciences Center until 3 AM some nights, then back there at 1 AM,\" which points to poor sleep quality and regularity despite their personal perception of sufficient hours.\n-   **Social**: The student explicitly states, \"Socially, I feel a bit disconnected,\" and clarifies that their presence in social spaces \"wasn't really *social* social. More just being in places.\" They also note they \"haven't really put myself out there much this week.\""}
{"week": 3, "emotion": {"stamina": 5, "knowledge": 65, "stress": 98, "happy": 8, "sleep": 3, "social": 8}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 10, "total_questions": 10, "week": 3}, "weekly_desc": "This week felt like a complete whirlwind, and honestly, not in a good way. Looking back, it’s pretty clear why I’m feeling so drained and just… off. My happiness levels are in the basement, and my body feels like it’s running on fumes. Sleep? What’s sleep?\n\nThe biggest thing, and it’s hard to even write it down, is that I didn't make it to a single one of my classes this week. Not Econ, not COSC 050, not COSC 065. It’s a mess. I know I should have been there, especially with how much material we’re covering. But I just kept finding myself drawn to the pottery studio. It’s like a different world there, a place where I can just lose myself in the clay and the process. The hours just melt away, and before I know it, it’s the middle of the night or the next morning. I guess that explains why I was there so much, even at weird hours like 4 AM on Friday or all day Saturday and Sunday. It’s a passion, and it feels so good to create, but it’s clearly eating into everything else.\n\nMy sleep schedule is completely shot because of it. I was up at Fairchild late into the night, then sometimes at the Boathouse, then back to the pottery studio at dawn. It’s no wonder my stamina is so low. I’m constantly tired, and that just makes it harder to focus or even care about anything else. I did manage to get some work done at the library on Friday, and I’ve been trying to keep up with the material on my own, which I guess is why my knowledge levels are still pretty high. But it’s not the same as being in class, engaging with the professors and my peers.\n\nSpeaking of peers, my social life this week was practically non-existent. I barely saw anyone outside of fleeting moments. I popped into the dining hall once, and was at my dorm, but mostly I was either at the pottery studio, Fairchild, or the Boathouse, often alone. I know I need to connect with people more, but when I’m this tired and stressed, it’s hard to even think about it.\n\nAnd the deadlines… oh god, the deadlines. They’re just looming over me, a constant reminder of everything I’m falling behind on. There are so many due this Sunday, Monday, Tuesday, and Wednesday. It’s making me incredibly anxious, and I feel this knot in my stomach just thinking about how much I have to catch up on. It’s a lot of pressure, and I’m feeling the weight of it.\n\nFor next week, I absolutely *have* to get back on track. My main goal is to actually attend all my classes. No excuses. I need to figure out a way to manage my time better, especially with the pottery. Maybe I can set specific, limited hours for it, or only go on weekends, so it doesn't completely derail my academic responsibilities. I also desperately need to prioritize sleep. I can’t keep burning the candle at both ends like this; it’s clearly impacting my mood and my ability to function. I need to tackle those upcoming assignments head-on and try to get ahead, or at least caught up, so I don't feel this crushing anxiety anymore. And maybe, just maybe, I can try to be a bit more social, even if it’s just grabbing a meal with someone. This week was a wake-up call. I need to find a healthier balance.", "judge_reasoning": "```\n\n**Reasoning:**\n\n*   **Stamina:** The student explicitly states \"no wonder my stamina is so low\" and describes their body as \"running on fumes\" and feeling \"so drained\" and \"constantly tired.\"\n*   **Knowledge:** The student claims \"my knowledge levels are still pretty high\" because they \"did manage to get some work done at the library\" and have \"been trying to keep up with the material on my own,\" despite acknowledging they missed all classes.\n*   **Stress:** The student expresses extreme anxiety about \"the deadlines,\" describing them as \"looming over me,\" \"making me incredibly anxious,\" causing a \"knot in my stomach,\" and feeling \"this crushing anxiety\" and \"the weight of it.\"\n*   **Happy:** The student states \"My happiness levels are in the basement\" and describes the week as \"not in a good way,\" feeling \"so drained and just… off.\"\n*   **Sleep:** The student rhetorically asks \"Sleep? What’s sleep?\" and states their \"sleep schedule is completely shot,\" indicating they are \"up late into the night\" and \"at dawn.\"\n*   **Social:** The student reports their \"social life this week was practically non-existent\" and that they \"barely saw anyone outside of fleeting moments,\" often being \"alone.\""}
{"week": 4, "emotion": {"stamina": 5, "knowledge": 20, "stress": 95, "happy": 75, "sleep": 2, "social": 90}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "Error in evaluation", "correct_answers": 0, "total_questions": 0, "week": 4}, "weekly_desc": "Okay, this week was... a lot. It feels like a blur of late nights and early mornings, and honestly, I'm running on fumes. My sleep is just non-existent right now, which explains why my stamina feels so low. It's a weird feeling because, despite being so tired, I actually feel pretty happy overall, and my social life has been great.\n\nThe biggest thing I need to address is class. Or, well, the lack thereof. I didn't make it to any of my scheduled classes this week, which is a huge problem, I know. Every time ECON 036, COSC 050, or COSC 065 was supposed to be happening, I found myself completely absorbed at the Davidson Pottery Studio. It's a bit off-campus, but I've just been so drawn to it lately. It's a completely different kind of challenge, and I've been spending hours there, just getting lost in the process. It's been incredibly fulfilling and creatively stimulating, which I guess explains why my happiness is still so high. It's like I've discovered this whole new passion, and it's hard to pull myself away.\n\nBut then the reality hits. I've been trying to make up for missing lectures by pulling all-nighters at Fairchild Physical Sciences Center. Seriously, I've spent so many hours there, especially between midnight and 5 AM, just trying to wrap my head around the material and get assignments done. It's exhausting, and it's clearly not sustainable. I can feel the pressure building, especially with all these deadlines popping up – a bunch due Sunday, Monday, Tuesday, and Wednesday. It's a lot to juggle when you're already behind.\n\nOn the flip side, my social battery is definitely full. I've been hanging out at the Boathouse a lot, which is always a good time, and spent some quality time in the dorms and even got a workout in at the gym. It's good to connect with people and just decompress, even if it means sacrificing more sleep.\n\nThe challenge for next week is pretty clear: I absolutely *have* to get back to class. I can't keep missing lectures, no matter how much I'm enjoying the pottery. I need to figure out a way to balance this new interest with my actual academic responsibilities. And seriously, I need to prioritize sleep. It's impacting everything. I'm going to try to set a strict bedtime, even if it means cutting back on some of the late-night study sessions and being more efficient during the day. I also need to map out all those deadlines and start tackling them systematically so I don't get completely overwhelmed. It's time to get conscientious about this.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student explicitly states \"my stamina feels so low\" and \"I'm running on fumes.\" They also mention \"It's exhausting\" and \"clearly not sustainable\" due to \"late nights and early mornings\" and \"pulling all-nighters.\" This indicates critically low stamina.\n-   **Knowledge**: The student admits \"I didn't make it to any of my scheduled classes this week\" and is \"trying to make up for missing lectures by pulling all-nighters\" to \"wrap my head around the material.\" This suggests a significant gap in current academic understanding and progress, despite efforts to catch up.\n-   **Stress**: The student feels \"the pressure building, especially with all these deadlines popping up\" and notes \"It's a lot to juggle when you're already behind.\" They also mention needing to \"map out all those deadlines and start tackling them systematically so I don't get completely overwhelmed,\" indicating high stress levels.\n-   **Happy**: Despite academic struggles, the student states \"I actually feel pretty happy overall\" and \"my happiness is still so high\" due to the \"incredibly fulfilling and creatively stimulating\" experience at the pottery studio and a great social life. They describe discovering a \"whole new passion.\"\n-   **Sleep**: The student repeatedly emphasizes \"My sleep is just non-existent right now,\" \"pulling all-nighters,\" and \"sacrificing more sleep.\" They acknowledge needing to \"prioritize sleep\" as \"It's impacting everything.\" This points to extremely low sleep.\n-   **Social**: The student explicitly states \"my social life has been great\" and \"my social battery is definitely full.\" They mention \"hanging out at the Boathouse a lot\" and connecting with people to \"decompress,\" indicating a very active and positive social experience."}
{"week": 5, "emotion": {"stamina": 5, "knowledge": 70, "stress": 95, "happy": 80, "sleep": 2, "social": 95}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 9, "total_questions": 10, "week": 5}, "weekly_desc": "Okay, another week bites the dust. Honestly, I'm running on fumes. My body feels like it's been through a blender, and my brain isn't far behind. Sleep is definitely not my friend right now, and my stamina is just... gone.\n\nThe biggest thing this week, and it's hard to even write it down, is that I didn't make it to any of my classes. Not a single one. ECON, COSC 050, COSC 065 – all of them. I know, I know. It's a huge problem. I feel this knot in my stomach just thinking about it. It's not like I don't care about the material; I actually really enjoy learning, and I feel like I've got a good grasp on things generally. But getting myself out of bed, especially after some of those late nights, just felt impossible. It's a weird disconnect, feeling like I know a lot but then not showing up to learn more.\n\nMy social life, though, is thriving, which is probably part of the problem. I spent a lot of time out and about, whether it was at the Hop, just hanging out in Zahm Courtyard, or those late-night unknown adventures. I love being around people, and it really does make me happy. It's like a necessary escape from the academic pressure cooker. And the pottery studio... I was there a lot. It's such a calming space, even if I wasn't always actively doing something. It's just a place where I can breathe, away from campus sometimes. I even managed to get some actual work done in Sudikoff and McNutt, but it was always late, always a scramble.\n\nThe real challenge is this insane pile of deadlines staring me down. It feels like every single class has something due in the next few days. Sunday, Monday, Tuesday, Wednesday – it's just a constant stream. That's probably why my neuroticism is flaring up. I know I *should* be on top of it, and I *want* to be, but the exhaustion just makes everything feel so much heavier. It's like I'm constantly playing catch-up, and the more I fall behind on sleep, the harder it is to catch up on anything else.\n\nSo, for next week, I absolutely *have* to get my act together. My main goal is to prioritize sleep. Seriously, I need to make it a non-negotiable. If I can get more rest, I know my stamina will improve, and then maybe, just maybe, I'll actually make it to my morning classes. I need to be more disciplined about my social time too, even though it's hard to say no. And those deadlines? I need to break them down and tackle them one by one, instead of letting them pile up and overwhelm me. I'm going to try to get ahead on readings and assignments, so I'm not pulling all-nighters right before things are due. It's time to be more conscientious about my schedule, not just my intentions.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"I'm running on fumes,\" \"my stamina is just... gone,\" and describes their body feeling \"like it's been through a blender.\" They also mention \"the exhaustion just makes everything feel so much heavier,\" indicating extremely low physical and mental energy.\n- **Knowledge:** Despite not attending classes, the student asserts, \"I actually really enjoy learning, and I feel like I've got a good grasp on things generally.\" They also note a \"weird disconnect, feeling like I know a lot but then not showing up to learn more,\" suggesting confidence in their existing understanding of the material.\n- **Stress:** The student expresses significant distress, feeling a \"knot in my stomach\" about missed classes and facing an \"insane pile of deadlines.\" They admit their \"neuroticism is flaring up\" and feel \"constantly playing catch-up,\" indicating a very high level of academic pressure and anxiety.\n- **Happy:** The student finds considerable happiness in their social life, stating, \"My social life, though, is thriving, which is probably part of the problem. I love being around people, and it really does make me happy.\" They also find the \"pottery studio\" to be a \"calming space\" and a \"place where I can breathe,\" contributing to their overall well-being despite academic struggles.\n- **Sleep:** The student clearly indicates a severe lack of sleep, stating, \"Sleep is definitely not my friend right now\" and mentioning \"late nights.\" Their primary goal for the next week is to \"prioritize sleep. Seriously, I need to make it a non-negotiable,\" highlighting its critical deficiency.\n- **Social:** The student's social life is described as \"thriving,\" and they \"spent a lot of time out and about.\" They explicitly state, \"I love being around people,\" and acknowledge that it's \"hard to say no\" to social engagements, indicating a very active and fulfilling social life."}
{"week": 6, "emotion": {"stamina": 5, "knowledge": 75, "stress": 90, "happy": 85, "sleep": 2, "social": 95}, "lab_assessment": {"score": 10.494000000000002, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 9, "total_questions": 10, "week": 6}, "weekly_desc": "What a week. Honestly, I'm completely wiped out. My stamina is practically non-existent, and I swear I've barely slept more than a couple of hours each night. Fairchild Physical Sciences Center has pretty much become my second home after midnight, and Sudikoff too, for all the COSC stuff. It feels like I'm constantly burning the candle at both ends, trying to keep up.\n\nThe biggest thing this week, and I know it's going to sound wild, is that I barely made it to any of my actual classes. I saw the schedule, I know I *should* have been in Kemeny for ECON and COSC 050, and LSB for COSC 065. But I just wasn't there. Instead, I spent a huge chunk of my time, especially during the day, at that Davidson Pottery Studio in Vermont. It's been incredibly intense, a real deep dive into a project I'm passionate about, and it's demanding a lot of my focus and time. It's a bit of a trek, too, which eats into the day even more. I know it's not ideal for my academic attendance, and that little voice in my head, the one that worries about everything, is definitely screaming about all the material I've missed. It's a weird feeling, being so happy and engaged with something, but also feeling that gnawing anxiety about falling behind in my actual coursework.\n\nDespite the exhaustion and the academic guilt, I'm actually feeling pretty good overall. My social battery is somehow still at 95%, which is wild considering how little sleep I've had. I guess those quick meetups at the Boathouse or just being out in Zahm Courtyard, even briefly, really recharge me. It's like I thrive on that connection, even when I'm running on fumes. And I'm still feeling pretty knowledgeable, which is a relief, probably because I'm cramming so much in during those late-night study sessions.\n\nBut man, the deadlines. They're just piling up. I've got a bunch due Sunday, Monday, Tuesday, and Wednesday. It's a lot to juggle, especially with the time I'm dedicating to the pottery studio. It feels like I'm constantly playing catch-up, and that's where the stress really kicks in.\n\nLooking ahead to next week, I absolutely *have* to figure out this balance. My main goals are:\n1.  **Prioritize sleep:** Seriously, 2 hours a night is not sustainable. I need to find a way to get at least a few more hours in, even if it means being more efficient with my study time.\n2.  **Catch up on missed class material:** I can't keep missing lectures. I need to review notes from friends, watch recordings if they're available, and make sure I understand what I missed in ECON 036, COSC 050, and COSC 065.\n3.  **Re-evaluate the pottery studio commitment:** While I love it, I need to see if I can adjust my hours there, or at least be more strategic about when I'm there, so it doesn't completely derail my academic schedule.\n4.  **Tackle those deadlines head-on:** I need a solid plan to chip away at them early, rather than leaving everything to the last minute.\n\nIt's going to be another challenging week, but I'm determined to make it work. I just need to be smarter about my time and remember that my health and academics are important too.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"I'm completely wiped out. My stamina is practically non-existent,\" and \"running on fumes,\" indicating extremely low energy levels.\n- **Knowledge:** While the student acknowledges missing classes and feeling \"gnawing anxiety about falling behind,\" they also state, \"I'm still feeling pretty knowledgeable, which is a relief, probably because I'm cramming so much in during those late-night study sessions.\" This suggests their perceived knowledge is still relatively high due to intense effort.\n- **Stress:** The student expresses significant stress due to \"that little voice in my head... screaming about all the material I've missed,\" \"gnawing anxiety about falling behind,\" and \"the deadlines. They're just piling up,\" leading to feeling \"constantly playing catch-up.\"\n- **Happy:** Despite the challenges, the student reports being \"so happy and engaged with something\" (the pottery project) and \"actually feeling pretty good overall,\" indicating a strong sense of contentment and passion.\n- **Sleep:** The student clearly states, \"I swear I've barely slept more than a couple of hours each night,\" and identifies \"2 hours a night is not sustainable,\" reflecting critically low sleep.\n- **Social:** The student directly mentions, \"My social battery is somehow still at 95%,\" and \"I thrive on that connection,\" indicating a very high and resilient social well-being."}
{"week": 7, "emotion": {"stamina": 5, "knowledge": 75, "stress": 90, "happy": 85, "sleep": 2, "social": 95}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 10, "total_questions": 10, "week": 7}, "weekly_desc": "Okay, another week down. It feels like a blur, honestly. On one hand, I'm feeling pretty good, like my social life is really thriving, which is awesome. I've been out and about, catching up with people, and that always boosts my mood. My happiness level is definitely up there, which is great.\n\nBut then there's the other side of the coin. My sleep? Non-existent. Seriously, a 2 out of 10? That's rough. And my stamina is right there with it, barely clinging on at a 5. I know exactly why, too. I spent so many late nights in Fairchild and Sudikoff this week. It felt like I was practically living there, especially Thursday, Friday, and Saturday nights, just grinding away. I was there until 3, 4, even 5 AM some nights, just trying to get through everything. And then again on Monday and Tuesday nights. It's a cycle, I know.\n\nThe weird thing is, even though I was pulling those crazy hours, I didn't actually make it to any of my scheduled classes this week. Not a single one. I saw the schedule for ECON, COSC 050, COSC 065, but I just couldn't drag myself there. It's a bit of a worry, because I know I'm missing out on the lectures and discussions. Still, I feel like I'm keeping up with the material, at least knowledge-wise, from all the self-study. It's just not the ideal way to do it.\n\nI did manage to get out to the Boathouse a few times, which was nice, and ran some errands at the Post Office. There were also a couple of late-night excursions off campus, which were probably more social than anything else. That's probably where the high social score comes from. It's a balancing act, and right now, the scales are definitely tipped towards social and late-night work, and away from sleep and actual class attendance.\n\nLooking at the upcoming deadlines is a bit daunting. So many due on Sunday, Monday, Tuesday, and Wednesday. That's probably why I've been pushing so hard. It feels like there's always something looming.\n\nMy biggest challenge right now is definitely this sleep deprivation and the resulting lack of stamina. It's not sustainable, and I can feel it wearing me down, even if I'm generally happy. I also need to figure out how to actually *attend* my classes. I'm learning the material, but being there in person makes a difference.\n\nFor next week, my goals are pretty clear:\n1.  **Prioritize sleep:** I need to get more than a couple of hours a night. I'm going to try to set a hard stop time for studying, even if it means not finishing everything perfectly.\n2.  **Boost stamina:** With more sleep, hopefully, my energy levels will naturally improve. Maybe even try to squeeze in some actual exercise that isn't just walking between buildings.\n3.  **Attend classes:** This is non-negotiable. I need to be in those lectures. I'll try to shift my study schedule earlier in the day so I'm not so exhausted by morning.\n4.  **Manage deadlines proactively:** Instead of cramming last minute, I need to break down the work for those upcoming deadlines into smaller, more manageable chunks throughout the week.\n\nIt's a lot, but I'm determined to get back on track. I know I can do it, I just need to find a better rhythm.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states, \"my stamina is right there with it, barely clinging on at a 5.\" This is further supported by their inability to \"drag myself there\" to classes and feeling \"worn down\" by sleep deprivation.\n-   **Knowledge:** Despite missing all scheduled classes, the student states, \"I feel like I'm keeping up with the material, at least knowledge-wise, from all the self-study.\" They acknowledge it's \"not the ideal way,\" but imply they are still learning effectively.\n-   **Stress:** The student mentions \"Looking at the upcoming deadlines is a bit daunting\" and that \"It feels like there's always something looming,\" indicating significant pressure and worry. They also note this is \"probably why I've been pushing so hard.\"\n-   **Happy:** The student directly states, \"I'm feeling pretty good,\" and \"My happiness level is definitely up there, which is great.\" They also confirm this by saying, \"even if I'm generally happy,\" despite other challenges.\n-   **Sleep:** The student explicitly rates their sleep as \"a 2 out of 10\" and describes it as \"Non-existent\" and \"sleep deprivation,\" having spent \"so many late nights... until 3, 4, even 5 AM some nights.\"\n-   **Social:** The student reports their \"social life is really thriving, which is awesome\" and that they've been \"out and about, catching up with people.\" They also attribute their activities to a \"high social score.\""}
{"week": 8, "emotion": {"stamina": 5, "knowledge": 75, "stress": 90, "happy": 85, "sleep": 2, "social": 95}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "What a week, honestly. I feel like I'm running on fumes, my stamina is practically non-existent, and sleep? What's sleep? But weirdly, despite all that, I'm still feeling pretty good, especially socially. My social battery is definitely topped up, which is a huge plus.\n\nClasses... yeah, that's where things got a bit messy. I know the system says \"no class experience recorded,\" and that's pretty accurate. I ended up spending a ridiculous amount of time at the Davidson Pottery Studio this week. It's just... it's become such an intense passion. I get so lost in it, the clay, the wheel, the whole process. It's incredibly creatively fulfilling, and honestly, it feels like a real escape from everything else. I know it's off-campus, and it's a private business, but it's where I felt drawn to be. It's like I discover something new about myself every time I'm there.\n\nThe downside, of course, is that it completely threw off my class schedule. I missed pretty much everything. Then I'd be scrambling late at night, pulling all-nighters in Sudikoff or Fairchild, trying to catch up on COSC and ECON material. It's a constant cycle of feeling behind, then cramming, then feeling exhausted. My brain feels like it's buzzing with all the information, which is good for my knowledge levels, but my body is definitely protesting. The sheer number of deadlines looming over me doesn't help either – it's like a constant low hum of anxiety in the background.\n\nBut then I'd grab food at the Commons or hang out at the Boathouse, or even just wander around with friends, and suddenly, I'd feel a surge of happiness. It's like the social connections are what keep me afloat, even when everything else feels like it's spiraling. I even ended up at Hanover High School for some reason on Saturday night, which was... an experience. And that late-night trip to Jewel of India was definitely a highlight.\n\nThe challenge is clearly the balance. I'm so drawn to this new creative outlet, and my social life is thriving, but my academic structure is crumbling. I know I'm capable of understanding the material, but showing up to lectures is a basic requirement, and I just didn't manage it this week. It's frustrating because I *want* to be on top of things, but I also don't want to give up this new thing that brings me so much joy.\n\nSo, for next week, my goals are pretty clear, even if they feel daunting. First, I absolutely *have* to get to all my classes. No more pottery studio during lecture times. I need to be present and engaged. Second, I need to figure out a way to get more sleep. Two hours a night is just not sustainable, and I can feel it wearing me down, even if I'm trying to ignore it. Maybe I can schedule my pottery time more intentionally, perhaps in the evenings or on the weekend, so it doesn't clash with my academic responsibilities. It's about finding that sweet spot where I can pursue my passions without completely sacrificing my well-being and my grades. It's going to be tough, but I have to try.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student explicitly states, \"I feel like I'm running on fumes, my stamina is practically non-existent,\" and \"my body is definitely protesting,\" further noting that \"Two hours a night is just not sustainable, and I can feel it wearing me down.\" This indicates extremely low physical and mental energy.\n- **Knowledge:** Despite missing classes, the student mentions, \"My brain feels like it's buzzing with all the information, which is good for my knowledge levels,\" and \"I know I'm capable of understanding the material,\" indicating a strong grasp or active acquisition of academic content through cramming.\n- **Stress:** The student describes \"a constant low hum of anxiety in the background\" due to \"the sheer number of deadlines looming over me\" and feeling caught in \"a constant cycle of feeling behind, then cramming, then feeling exhausted,\" highlighting very high stress levels.\n- **Happy:** Despite academic struggles, the student reports \"still feeling pretty good,\" finding pottery \"incredibly creatively fulfilling\" and a source of \"so much joy.\" They also experience \"a surge of happiness\" from social interactions.\n- **Sleep:** The student dramatically asks, \"sleep? What's sleep?\" and explicitly states they are \"pulling all-nighters\" and getting \"Two hours a night is just not sustainable,\" indicating extremely poor sleep.\n- **Social:** The student's social life is thriving, with statements like \"My social battery is definitely topped up,\" \"the social connections are what keep me afloat,\" and \"my social life is thriving,\" suggesting very high social well-being."}
{"week": 9, "emotion": {"stamina": 5, "knowledge": 55, "stress": 90, "happy": 85, "sleep": 2, "social": 95}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "Okay, this week was… a lot. I feel like I’m running on fumes, honestly. My sleep is a disaster, and my stamina is basically non-existent, but somehow, I’m still feeling pretty happy and my social battery is completely full. It’s a weird contradiction.\n\nAcademically, it was a bit of a mess. I know I had classes, especially on Thursday, but I just couldn't make it. I spent a huge chunk of Thursday at that pottery studio in Vermont, which was totally unexpected but also kind of amazing. I guess my high openness just kicked in and I needed to explore something completely different. It was a nice break from everything, a chance to just create and not think about problem sets or readings. But then the guilt started to creep in, especially knowing I missed ECON and COSC 065. My conscientiousness is screaming at me to get back on track.\n\nWednesday night was a blur. I was at Fairchild super late, trying to get some work done, and I think I pulled an all-nighter or something close to it. That probably explains why I was so utterly drained by Thursday morning. I ended up at Sudikoff later on Thursday, so I did manage to get *some* COSC-related stuff done, but it wasn't the focused class time I needed.\n\nThe biggest challenge right now is definitely sleep. How am I supposed to function on so little? And then there are all these deadlines looming. Seriously, so many things due Sunday, Monday, Tuesday, Wednesday… it’s overwhelming just looking at the list. My neuroticism is definitely flaring up when I think about how much I have to catch up on, especially with the classes I missed.\n\nFor next week, my goals are pretty clear:\n1.  **Prioritize sleep.** I *have* to get more rest. This isn't sustainable.\n2.  **Catch up on missed material.** I need to review what I missed in ECON and COSC 065, and make sure I understand it before the next lectures.\n3.  **Tackle those deadlines head-on.** I need to break them down and start chipping away at them, especially the ones due early in the week. No more last-minute scrambles if I can help it.\n4.  **Re-establish my routine.** I thrive on structure, and this week felt a bit too free-form. I need to get back into a consistent study schedule.\n\nI loved the social aspect of this week, and the pottery was a cool experience, but I need to find a better balance. My brain feels like mush, even if my heart is happy. Time to get serious again.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** The student explicitly states \"I feel like I’m running on fumes, honestly\" and \"my stamina is basically non-existent,\" indicating extreme fatigue and very low energy levels.\n-   **Knowledge:** The student admits \"Academically, it was a bit of a mess\" and \"missed ECON and COSC 065,\" acknowledging a need to \"catch up on missed material\" and \"make sure I understand it,\" suggesting a current gap in their understanding of the week's content.\n-   **Stress:** The student mentions \"the guilt started to creep in,\" \"My conscientiousness is screaming at me,\" and describes deadlines as \"overwhelming just looking at the list,\" with \"My neuroticism is definitely flaring up,\" all pointing to very high stress levels.\n-   **Happy:** Despite other challenges, the student explicitly states \"somehow, I’m still feeling pretty happy\" and \"my heart is happy,\" also describing the pottery experience as \"amazing\" and a \"nice break,\" indicating a high level of contentment.\n-   **Sleep:** The student describes their sleep as \"a disaster\" and mentions pulling \"an all-nighter or something close to it,\" questioning \"How am I supposed to function on so little?\", which clearly indicates severe sleep deprivation.\n-   **Social:** The student states \"my social battery is completely full\" and \"I loved the social aspect of this week,\" indicating high satisfaction and engagement with social interactions."}
{"week": 10, "emotion": {"stamina": 5, "knowledge": 90, "stress": 85, "happy": 85, "sleep": 2, "social": 95}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 28.5, "full_text_response": "28.5/30"}, "weekly_desc": "Okay, another week down. It feels like a blur, honestly. My brain is definitely running on fumes right now, which is probably why I'm even writing this.\n\nClasses this week were... a lot. Waking up for ECON 036 every morning at Kemeny is a commitment, especially when I feel like I barely closed my eyes. Professor [Professor's name, if I had one, but I don't, so I'll just say 'the prof'] is good, but sometimes it feels like my brain is trying to process the material through a thick fog. COSC 065 over at LSB was interesting, though. I really enjoy diving into the concepts there; it feels like my brain lights up, even when my body is screaming for a nap. And then COSC 050 in the afternoons, back at Kemeny – it's a good challenge, and I feel like I'm really grasping the core ideas, which is satisfying. I feel pretty confident about the material in all my classes, actually. It's just the *energy* to engage with it that's the problem.\n\nCampus life was pretty vibrant, as usual. I spent a lot of time just hanging out between classes, grabbing coffee, chatting with people. That's probably where a lot of my energy went, actually. I love being around my friends, and there was always something going on. Whether it was just a quick catch-up or a longer conversation, I felt really connected and happy. It's definitely a huge part of what makes me feel good here.\n\nHow did I feel? Honestly, a mix of really happy and utterly exhausted. My social battery is fully charged – I feel great about my connections and the fun I had. But my actual physical battery? Completely drained. I'm running on fumes, and it's starting to catch up with me. My stamina is practically non-existent. It's like my mind is buzzing with ideas and connections from classes and conversations, but my body just wants to collapse. There's also this low hum of anxiety about all the deadlines piling up. I know I'm capable, and I understand the material, but the sheer *volume* of things due next week is a bit overwhelming when I'm this tired.\n\nThe biggest challenge, hands down, was sleep. Or the lack thereof. I just haven't been getting enough, and it's impacting everything. It makes it harder to focus in class, harder to feel motivated to start assignments, and even harder to fully enjoy the social stuff because I'm constantly fighting off yawns. Balancing the desire to be social and engaged with the absolute necessity of rest has been a real struggle. It feels like I'm always choosing between one or the other, and this week, social won out, but at a cost.\n\nSo, for next week, my goals are pretty clear:\n1.  **Prioritize sleep.** Seriously. I need to make a conscious effort to get to bed earlier, even if it means saying no to some late-night plans. My brain and body desperately need it.\n2.  **Get a head start on assignments.** With so many deadlines looming (Sunday, Monday, Tuesday, Wednesday – it's a lot!), I can't afford to procrastinate. I need to break them down and tackle them bit by bit, especially the COSC ones.\n3.  **Manage my time better.** I need to find a way to balance my social life with my academic responsibilities and, crucially, my rest. Maybe schedule specific blocks for studying and specific blocks for socializing, rather than just letting things happen organically.\n\nI'm still happy to be here, and I love what I'm learning and the people around me. I just need to figure out how to do it all without completely burning out. Wish me luck.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** 5 - The student explicitly states, \"My stamina is practically non-existent,\" \"Completely drained,\" and \"running on fumes,\" indicating extreme physical exhaustion.\n-   **Knowledge:** 90 - The student expresses high confidence in their academic abilities, stating, \"I feel pretty confident about the material in all my classes,\" \"I feel like I'm really grasping the core ideas,\" and \"I know I'm capable, and I understand the material.\"\n-   **Stress:** 85 - There's a clear \"low hum of anxiety about all the deadlines piling up\" and the \"sheer *volume* of things due next week is a bit overwhelming,\" indicating significant pressure and worry.\n-   **Happy:** 85 - Despite exhaustion, the student repeatedly mentions happiness, stating, \"I felt really connected and happy,\" \"My social battery is fully charged – I feel great about my connections and the fun I had,\" and \"I'm still happy to be here, and I love what I'm learning and the people around me.\"\n-   **Sleep:** 2 - The student identifies \"sleep. Or the lack thereof\" as \"The biggest challenge, hands down,\" noting they \"haven't been getting enough\" and \"barely closed my eyes,\" with their brain and body \"desperately need[ing] it.\"\n-   **Social:** 95 - The student describes a vibrant social life, spending \"a lot of time just hanging out... chatting with people,\" feeling \"really connected and happy,\" and explicitly stating, \"My social battery is fully charged – I feel great about my connections and the fun I had.\" They even admit \"social won out\" over rest."}
