{"week": 1, "emotion": {"stamina": 90, "knowledge": 5, "stress": 95, "happy": 10, "sleep": 85, "social": 25}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 1}, "weekly_desc": "Another week just… happened. It feels like a blur, honestly. I’m sitting here, trying to piece together what even went on, and mostly I just feel this familiar knot in my stomach about everything I *didn't* do.\n\nClasses… yeah. I didn't make it to any of them this week. Not BIOL, not COSC 050, not COSC 065. I know, I know. It’s bad. Every morning, I’d wake up, feeling surprisingly rested, actually – my sleep tracker says I’m getting plenty of sleep, which is weird because my brain feels anything but rested. I’d just… stay in Parker House. The thought of getting up, getting ready, and going to a lecture, especially knowing how much I’m already behind, just felt impossible. It’s like this heavy blanket of dread just keeps me glued to my bed. I’d tell myself I’d catch up later, or just read the notes, but then later never really comes. It’s frustrating, because I *want* to learn, I really do. But the inertia is just so strong.\n\nI spent a lot of time just… existing in my dorm. Or wandering. I found myself down at the Boathouse a lot. It’s peaceful there, just watching the water. It’s a good escape from the constant hum of anxiety in my head. I went there early in the morning a couple of times, and then again in the evenings. It’s a quiet place, and I don’t really have to talk to anyone. I guess that’s good, because I haven’t really been feeling up to much social interaction. My social battery feels pretty neutral, but I haven't really pushed it. Just quick trips to the dining hall for food, mostly.\n\nI also ended up near the Admissions Office a few times, and the Life Sciences Center, and even the Hopkins Center. Not for any particular reason, just kind of drifting. It feels a bit aimless, which probably isn't helping with the whole \"getting things done\" situation. My stamina is apparently through the roof, but it's not like I'm using it for anything productive.\n\nThe biggest challenge, by far, is this overwhelming feeling of being behind. And the deadlines. Oh god, the deadlines. There are so many of them, just piling up. Sunday has two, Monday has three, Tuesday has four, and then more later in the week. It’s like a wall of assignments, and I haven’t even started chipping away at it. My knowledge level feels stagnant, which is probably accurate since I haven't been absorbing anything new in class. I feel this constant pressure, this tightness in my chest, and it just makes me want to retreat even more. It’s a vicious cycle. I know I should be working, but the sheer volume of it just paralyzes me. I'm not happy about it, but it's hard to break out of.\n\nI really need to turn things around. My goal for next week, and I really mean it this time, is to actually *go* to my classes. All of them. Even if I feel lost, I need to be there. And I need to start tackling these deadlines, one by one. I need to break them down into smaller, manageable pieces, instead of just staring at the whole mountain. Maybe I can try to find a study buddy, or at least someone to just sit with in the library, so I feel a bit more accountable. I just need to find a way to push through this feeling of being completely overwhelmed and actually *do* something. It's a lot, but I have to try.", "judge_reasoning": "```\n\n**Reasoning:**\n- **Stamina:** 90. The student explicitly states, \"My stamina is apparently through the roof,\" and describes spending a lot of time \"wandering\" and \"drifting\" to various locations, indicating high physical energy, even if undirected.\n- **Knowledge:** 5. The student admits, \"I didn't make it to any of [classes] this week\" and \"My knowledge level feels stagnant, which is probably accurate since I haven't been absorbing anything new in class.\" This indicates a near-complete lack of new learning.\n- **Stress:** 95. The journal is filled with indicators of extreme stress: \"familiar knot in my stomach,\" \"heavy blanket of dread,\" \"constant hum of anxiety,\" \"overwhelming feeling of being behind,\" \"deadlines. Oh god, the deadlines,\" \"wall of assignments,\" \"constant pressure, this tightness in my chest,\" and feeling \"paralyzes me.\"\n- **Happy:** 10. The student directly states, \"I'm not happy about it,\" and the overall tone is one of frustration, dread, and being caught in a \"vicious cycle.\"\n- **Sleep:** 85. The student reports, \"Every morning, I’d wake up, feeling surprisingly rested, actually – my sleep tracker says I’m getting plenty of sleep.\" While their brain doesn't feel rested, the physical act of sleeping is described as successful.\n- **Social:** 25. The student avoids social interaction, stating, \"I don’t really have to talk to anyone,\" and \"I haven’t really been feeling up to much social interaction.\" They also mention their \"social battery feels pretty neutral, but I haven't really pushed it,\" suggesting low engagement rather than active depletion."}
{"week": 2, "emotion": {"stamina": 85, "knowledge": 30, "stress": 98, "happy": 5, "sleep": 90, "social": 10}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Layouts & Views Basics", "correct_answers": 8, "total_questions": 10, "week": 2}, "weekly_desc": "This week felt like a blur, honestly. A really anxious, blurry blur. My happiness is just… gone. It’s like a constant hum of dread in the background, and it’s hard to shake.\n\nI didn't make it to a single class this week. Not BIOL, not COSC 050, not COSC 065. I just... couldn't. Every time the class time rolled around, I’d be in my dorm, Parker House, just staring at the wall, or at my laptop, not really doing anything productive. The thought of going, of facing the material I know I’m already behind on, just felt overwhelming. It’s a terrible cycle – I miss class because I’m anxious, and then I get more anxious because I missed class. My conscientiousness is clearly taking a hit, and it’s not helping with the mountain of deadlines I see coming. So many things due Sunday, Monday, Tuesday. It’s like a wall of assignments, and I haven't even started chipping away at it.\n\nOn campus, I mostly stuck to my dorm. I mean, I was *there* for most of the week, even when I was supposed to be in class. I did find myself at the Admissions Office a few times, which is weird. Not sure why, maybe just wandering, or trying to feel like I was doing *something* official, even if it wasn't class. It’s a strange place to gravitate towards when you’re already a student. And the boathouse… I went there a few times too. It’s quiet, I guess. A place to just… be, without having to interact or pretend everything’s fine.\n\nMy social life is practically non-existent right now. The social meter is so low, and it shows. I barely saw anyone, which probably isn't helping my mood, but also, the thought of interacting just feels exhausting. I know I need to connect with people, but it's like I'm stuck in my own head, just spiraling. I feel bad about not being more present, for myself and maybe for others.\n\nThe biggest challenge is definitely this feeling of being completely overwhelmed by everything. I have a high knowledge score overall, which is good, but then there are these specific things, especially in COSC, where I just feel completely lost, like my brain just shuts down. It’s frustrating because I know I *can* understand it, but the anxiety just paralyzes me. My sleep has been surprisingly good, and my stamina is high, so it’s not a physical exhaustion, it’s purely mental.\n\nFor next week, I *have* to get back to class. That's the absolute top priority. I need to force myself to go, even if I just sit there and absorb a fraction of it. I also need to pick *one* deadline, just one, and focus on getting it done, rather than looking at the whole terrifying list. Maybe the one due Saturday, just to get a win. And I need to try, really try, to reach out to someone, anyone. Even just a quick text. This isolation isn't helping. I need to find a way to manage this anxiety, because it's just eating me alive and stopping me from doing anything.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** 85 - The student explicitly states, \"My sleep has been surprisingly good, and my stamina is high, so it’s not a physical exhaustion, it’s purely mental.\" This indicates good physical energy.\n-   **Knowledge:** 30 - While the student mentions having \"a high knowledge score overall,\" they immediately qualify this by saying they feel \"completely lost, like my brain just shuts down\" in specific areas like COSC, and are \"already behind on\" material, with the \"anxiety just paralyzes me\" from applying what they know. This indicates a significant current functional knowledge gap and lack of confidence in critical areas.\n-   **Stress:** 98 - The journal is saturated with indicators of extreme stress: \"A really anxious, blurry blur,\" \"constant hum of dread,\" feeling \"overwhelming,\" \"mountain of deadlines,\" \"completely overwhelmed by everything,\" and \"the anxiety just paralyzes me\" and is \"eating me alive.\"\n-   **Happy:** 5 - The student directly states, \"My happiness is just… gone,\" and describes a \"constant hum of dread in the background.\"\n-   **Sleep:** 90 - The student clearly states, \"My sleep has been surprisingly good.\"\n-   **Social:** 10 - The student reports, \"My social life is practically non-existent right now,\" and \"The social meter is so low,\" adding that they \"barely saw anyone\" and \"the thought of interacting just feels exhausting.\""}
{"week": 3, "emotion": {"stamina": 15, "knowledge": 65, "stress": 95, "happy": 5, "sleep": 85, "social": 10}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "UI Components & Event Handling", "correct_answers": 8, "total_questions": 10, "week": 3}, "weekly_desc": "This week… wow. It feels like a blur, honestly. My head just feels so heavy, and my stomach is constantly doing flips. I don't even know where to begin with classes this week. Or, actually, I do know: I didn't go to any of them. Not a single one. BIOL, COSC 050, COSC 065… all of them. I just couldn't. Every time the alarm went off, or I saw the time approaching, this wave of dread would just wash over me, and I'd just… stay in my room. It's like I'm stuck in this loop of knowing I *should* be there, feeling terrible for not being there, and then that feeling makes it even harder to go. It's a mess.\n\nI spent so much time in Parker House. Just… existing in my room. I mean, I was at the Boathouse a lot, which is something. Early mornings, late nights, just being out on the water, or at least near it, feels like the only time my brain quiets down a little. It’s a weird contrast, feeling so active there, but then completely shutting down for everything else. I even went to Vail and Leverone, but it wasn't for anything productive, just wandering, I guess. And the Commons, briefly. It’s like I’m physically moving around, but my mind is just… not engaged with anything important.\n\nSocially, it's been pretty quiet. Too quiet, maybe. I barely talked to anyone. I know I should try to connect more, but it just feels like such an effort, and I don't even know what I'd say. Everyone else seems to have it all together, going to classes, hanging out, and I'm just… not. It makes me feel even more isolated. My happiness is definitely at an all-time low. I'm sleeping a lot, which you'd think would help, but I just wake up feeling the same, if not worse, because another day has passed and I haven't done anything.\n\nAnd the deadlines. Oh god, the deadlines. They're just piling up. So many for Sunday, Monday, Tuesday… just looking at the list makes my stomach clench. It’s like this giant, insurmountable wall, and I haven't even started chipping away at it. I know I have the knowledge, I know I *could* do this, and I even have the stamina, but it's like there's a mental block, a paralysis that just keeps me from starting. The anxiety is just overwhelming.\n\nMy biggest challenge this week was just getting myself to engage with anything academic. The avoidance is real, and it's making everything so much worse. I feel like I'm letting myself down, and that feeling just feeds into the anxiety.\n\nFor next week, I really, really need to try and get to class. Just one. Or two. Even if I just sit there and don't absorb everything, just being present would be a start. And I need to pick *one* of those deadlines, just one, and try to make some progress on it. Not all of them, just one. Maybe if I can get that first step done, the rest won't feel so impossible. I just want to feel a little less overwhelmed, a little less like I'm drowning.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student states \"I didn't go to any of them [classes]. Not a single one. ... I just couldn't,\" and describes \"completely shutting down for everything else\" despite feeling active in one specific area. They also mention a \"mental block, a paralysis that just keeps me from starting,\" indicating a severe lack of effective energy for daily tasks and academic engagement.\n- **Knowledge:** The student explicitly states, \"I know I have the knowledge, I know I *could* do this,\" indicating a self-perception of competence in their academic material, even though they are not engaging with classes or new content.\n- **Stress:** The student reports physical symptoms like \"My head just feels so heavy, and my stomach is constantly doing flips,\" and emotional states like \"wave of dread,\" \"feeling terrible,\" and \"The anxiety is just overwhelming.\" They also explicitly mention \"Oh god, the deadlines. They're just piling up,\" and feeling \"overwhelmed\" and \"drowning.\"\n- **Happy:** The student directly states, \"My happiness is definitely at an all-time low,\" and describes feeling \"terrible,\" \"isolated,\" and waking up \"feeling the same, if not worse.\"\n- **Sleep:** The student explicitly states, \"I'm sleeping a lot,\" indicating a high quantity of sleep, even if they note it is not restorative.\n- **Social:** The student reports, \"Socially, it's been pretty quiet. Too quiet, maybe. I barely talked to anyone,\" and feels \"isolated\" and that connecting \"feels like such an effort.\""}
{"week": 4, "emotion": {"stamina": 5, "knowledge": 10, "stress": 98, "happy": 5, "sleep": 85, "social": 5}, "lab_assessment": {"score": 11.660000000000002, "max_score": 11.66, "topic": "Activities & Intents", "correct_answers": 10, "total_questions": 10, "week": 4}, "weekly_desc": "This week felt… heavy. Like a thick blanket of dread just settled over everything. I know I had classes – BIOL, COSC 050, COSC 065 – but honestly, I didn't make it to a single one. It's embarrassing to even write that down. Every morning, the thought of getting out of Parker House, facing people, and pretending to be on top of things just felt impossible. My stamina is completely drained, even though I've been getting a lot of sleep. It's like my body is just refusing to cooperate.\n\nThe deadlines are piling up, and that's probably a huge part of why I feel so paralyzed. So many things due Sunday, Monday, Tuesday. It's just a constant hum of anxiety in the back of my mind. I tried to do something about it. Sunday night, I finally dragged myself to Sudikoff, just to stare at the computer screen for COSC. It felt like I was there, but not really *there*. Same thing on Tuesday at Steele Hall. It's all last-minute panic, and it just makes me feel worse.\n\nI did manage to get to the boathouse a few times. It's one of the only places I feel a tiny bit of calm, even if it's just me and the water. It's not really a social thing for me, which is probably why I gravitate towards it. My social meter is practically at zero, and honestly, I haven't really felt like connecting with anyone. Even going to the dining hall felt like a monumental task some evenings.\n\nMy happiness is just… gone. It's hard to feel happy when you know you're falling behind and you can't seem to pull yourself out of it. I keep thinking about all the things I *should* be doing, and it just makes me want to curl up and disappear.\n\nI know this can't keep going. For next week, I really, really need to try and make it to at least one class. Just one. Maybe BIOL on Tuesday, or one of the COSC lectures. And I need to break down these assignments into tiny, manageable chunks. Even if it's just 30 minutes of work on something, it's better than nothing. I just need to find a way to get some momentum back, to feel like I'm not drowning. It's just so hard to start when everything feels so overwhelming.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** 5 because the student explicitly states, \"My stamina is completely drained,\" and describes the thought of getting out as \"felt impossible,\" indicating a near-total lack of energy for daily tasks.\n- **Knowledge:** 10 because the student admits, \"I didn't make it to a single one [class],\" and even when attempting to work, \"It felt like I was there, but not really *there*,\" suggesting minimal engagement with or acquisition of academic material.\n- **Stress:** 98 because the student describes a \"thick blanket of dread,\" \"deadlines are piling up,\" feeling \"paralyzed,\" and a \"constant hum of anxiety,\" indicating an extremely high and pervasive level of stress and overwhelm.\n- **Happy:** 5 because the student states, \"My happiness is just… gone,\" and finds it \"hard to feel happy,\" expressing a profound sense of despair and lack of joy.\n- **Sleep:** 85 because the student clearly mentions, \"even though I've been getting a lot of sleep,\" indicating a high quantity of sleep, despite its apparent lack of restorative effect on stamina.\n- **Social:** 5 because the student declares, \"My social meter is practically at zero,\" and \"haven't really felt like connecting with anyone,\" even finding \"going to the dining hall felt like a monumental task,\" showing a strong aversion to social interaction."}
{"week": 5, "emotion": {"stamina": 5, "knowledge": 5, "stress": 95, "happy": 5, "sleep": 30, "social": 5}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Layouts & UI Design", "correct_answers": 8, "total_questions": 10, "week": 5}, "weekly_desc": "This week was… a lot. Or maybe, it was a lot of nothing, which somehow feels even worse. I just couldn't bring myself to go to any of my classes. Not BIOL, not COSC 050, not COSC 065. Every single one, I just missed. It's like there's this invisible wall between me and the door, and I just can't push through it. My brain knows I *should* be there, that I'm falling behind, but my body just feels so heavy, so drained. My stamina is just gone, and I'm so incredibly unhappy. It's this constant hum of anxiety, a knot in my stomach that just won't loosen.\n\nI spent so much time just holed up in my dorm, or at that private residence on Maynard Street. Just existing, I guess. I was out late a few nights, wandering around, grabbing food at the Commons, or just being at the Boathouse or McNutt Hall, but it wasn't really *doing* anything productive. I remember being at the Life Sciences Center late on Thursday and again on Tuesday, but it wasn't for class. I think I was trying to study, or at least be in a place where I *could* study, but it didn't really stick. I even made it to Leverone Field House and the Tuck School of Business at random times, but it felt more like aimless drifting than actual purpose. It's like I'm trying to escape my own head, but I just end up in different buildings.\n\nMy social life is pretty much non-existent, which, honestly, isn't a huge surprise. When I feel this overwhelmed and anxious, the last thing I want to do is pretend to be okay around people. It's hard enough just dealing with myself.\n\nAnd the deadlines. Oh god, the deadlines. They're just looming over me, one after another. Sunday, Monday, Tuesday – it's a relentless wave. How am I supposed to tackle all of them when I haven't even been to class to understand what's going on? I feel like my brain is just a fog, and any knowledge I thought I had has just evaporated. The pressure is immense, and it just makes me want to curl up and disappear. I know I have the capacity to understand this stuff, but right now, I feel like I know absolutely nothing.\n\nI really, really need to get a grip. For next week, my absolute top priority has to be showing up to class. Just getting myself there, even if I feel like a zombie. And I need to start chipping away at these assignments, even if it's just for an hour at a time. I can't keep letting this spiral out of control. I just hope I can actually follow through. The thought of it all just makes me want to pull the covers back over my head and stay there.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina:** 5 - The student explicitly states, \"My stamina is just gone,\" and describes their body as feeling \"so heavy, so drained.\" They also mention they \"just couldn't bring myself to go to any of my classes\" and that there's an \"invisible wall\" preventing them from pushing through, indicating a severe lack of physical and mental energy.\n-   **Knowledge:** 5 - The student expresses a profound sense of intellectual deficit, stating, \"I'm falling behind,\" and \"I feel like my brain is just a fog, and any knowledge I thought I had has just evaporated.\" They conclude with \"right now, I feel like I know absolutely nothing,\" directly indicating a very low perceived knowledge level.\n-   **Stress:** 95 - The journal is permeated with signs of high stress and anxiety. The student describes \"this constant hum of anxiety, a knot in my stomach that just won't loosen,\" and feeling \"overwhelmed and anxious.\" The \"deadlines\" are a major source of stress, described as \"looming over me, one after another,\" and a \"relentless wave,\" with \"The pressure is immense.\"\n-   **Happy:** 5 - The student explicitly states, \"I'm so incredibly unhappy.\" They also describe the week as \"a lot of nothing, which somehow feels even worse,\" and that they are \"just existing.\" Their desire to avoid social interaction because they don't \"want to do is pretend to be okay around people\" further underscores their very low mood.\n-   **Sleep:** 30 - While not explicitly detailing sleep quality, the student mentions being \"out late a few nights, wandering around,\" which suggests an irregular or insufficient sleep schedule. Their feeling that \"My body just feels so heavy, so drained\" is a common symptom of poor sleep. The desire to \"pull the covers back over my head and stay there\" also hints at a struggle with getting up, possibly due to exhaustion or a desire to escape, which can be linked to sleep issues.\n-   **Social:** 5 - The student directly states, \"My social life is pretty much non-existent.\" They further explain that when \"overwhelmed and anxious, the last thing I want to do is pretend to be okay around people,\" indicating a complete withdrawal from social interaction."}
{"week": 6, "emotion": {"stamina": 5, "knowledge": 5, "stress": 95, "happy": 5, "sleep": 5, "social": 5}, "lab_assessment": {"score": 8.162, "max_score": 11.66, "topic": "ListView & ArrayAdapter", "correct_answers": 7, "total_questions": 10, "week": 6}, "weekly_desc": "This week felt like a blur, honestly. It’s hard to even piece together what happened, or what I *should* have done. Looking at the schedule, I know I had classes, but... I just couldn't bring myself to go. Not to BIOL, not to COSC 050, not to COSC 065. Any of them. I just stayed in, mostly at Parker House or that private residence on Maynard. It’s not like I was doing anything productive, just... existing. The thought of getting up, getting ready, and facing people, let alone trying to absorb information when my brain feels like static, was just too much.\n\nI know I should be more on top of things. There are so many deadlines looming – Sunday, Monday, Tuesday, it’s just a constant wave. It makes my stomach clench just thinking about it. I tried to get some work done late at night, I guess, ending up at Sudikoff Hall a couple of times, or just staying up at the dorm. But it feels like I’m just treading water, not actually making progress. That’s probably why I’m so exhausted. My sleep is just non-existent, and I feel it in every single bone. My stamina is completely shot.\n\nI barely saw anyone this week, which isn't great, but also, I just don't have the energy for it. I feel so drained, and honestly, pretty miserable. It’s like I know what I need to do, I have all this information in my head, but the actual *doing* part is impossible. I did wander around a bit, ended up at the dining hall a few times, and even the Boathouse or Leverone, but it wasn't for anything specific, just... moving.\n\nThe biggest challenge is definitely this overwhelming feeling of being behind and not being able to catch up. Every missed class just adds to the pile, and then the anxiety about the deadlines just paralyzes me. It’s a vicious cycle.\n\nFor next week, I *have* to break this. My main goal is just to *show up*. To class, to anything. Even if I just sit there, I need to be present. I need to try and get more than a few hours of sleep, somehow. And I need to pick *one* deadline, just one, and actually get it done. Maybe if I can just get one thing off my plate, the rest won't feel so impossible. I just need to find a way to get out of this slump.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student explicitly states, \"My stamina is completely shot,\" and mentions feeling \"so exhausted\" and \"so drained,\" indicating extremely low energy levels.\n-   **Knowledge**: While the student notes, \"I have all this information in my head,\" they also describe their \"brain feels like static\" and the inability to \"absorb information,\" along with missing classes, which severely impacts their functional knowledge acquisition and application.\n-   **Stress**: The student expresses high stress due to \"so many deadlines looming – Sunday, Monday, Tuesday, it’s just a constant wave,\" and that \"It makes my stomach clench just thinking about it,\" and \"anxiety about the deadlines just paralyzes me.\"\n-   **Happy**: The student directly states feeling \"honestly, pretty miserable\" and describes the week as \"a blur,\" merely \"just... existing,\" reflecting a very low emotional state.\n-   **Sleep**: The student reports, \"My sleep is just non-existent\" and mentions needing to \"get more than a few hours of sleep,\" indicating severe sleep deprivation.\n-   **Social**: The student states, \"I barely saw anyone this week\" and that \"The thought of getting up, getting ready, and facing people... was just too much,\" highlighting a significant lack of social interaction and desire for it."}
{"week": 7, "emotion": {"stamina": 15, "knowledge": 5, "stress": 98, "happy": 8, "sleep": 5, "social": 5}, "lab_assessment": {"score": 9.328000000000001, "max_score": 11.66, "topic": "Data Storage", "correct_answers": 8, "total_questions": 10, "week": 7}, "weekly_desc": "Ugh, this week. It feels like a blur, honestly. I'm sitting here trying to piece it all together, and mostly what I'm getting is a sense of dread.\n\nAcademically, it was… well, it was nothing. I didn't make it to a single class. Not BIOL, not COSC 050, not COSC 065. Every time the alarm went off, or I saw the time ticking closer, this wave of just *heaviness* would wash over me. It felt impossible to get out of bed, or even just to leave 6 Maynard Street. I spent so much time there, just... existing. It's not even my dorm, but it felt like the only place I could be. I know I should have been in LSB or Kemeny, learning things, but the thought of facing people, or even just the material, felt too much. It's like my brain just shut down.\n\nI did try to do *something* at night. I was at Sudikoff really late on Wednesday and again on Monday night, trying to catch up on COSC stuff, but it felt like I was just staring at the screen, not really absorbing anything. And I went to the library on Thursday night, but again, it was more about being *there* than actually being productive. I guess I was trying to convince myself I was still on top of things, but the reality is I'm just falling further behind.\n\nThe only consistent thing I did was go to the boathouse. That's the one place I felt a little bit normal, a little bit like myself. Being out on the water, even just for a bit, is the only time my head feels clear. It's a weird contrast, feeling so completely checked out of everything else, but then being able to push myself physically there. I even went to the Hopkins Center super late on Saturday and Tuesday night, which was... interesting. Just needed a different kind of escape, I guess.\n\nMy sleep schedule is completely messed up. I'm up so late, then I just crash, and then I can't get myself to wake up for anything important. It's a vicious cycle. And the thought of all those deadlines piling up – Sunday, Monday, Tuesday, they're everywhere – just makes my stomach clench. I have so much to do, and I've done so little. It's overwhelming. I feel like I know so much, but then I feel like I know nothing at all, especially after missing all those lectures.\n\nI really need to get it together. For next week, my main goal, my *only* goal, is to actually *go* to class. Just show up. Even if I feel completely lost, I need to be there. And I need to figure out what's going on with me and 6 Maynard Street, because it's clearly not helping. I also need to try and tackle at least one of those looming assignments, just to feel like I'm not completely drowning. It's going to be hard, I know it will be, but I can't keep doing this. I just can't.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina:** The student states it felt \"impossible to get out of bed\" and that \"the thought of facing people, or even just the material, felt too much,\" indicating a severe lack of energy for daily tasks, despite some physical activity at the boathouse and Hopkins Center.\n- **Knowledge:** The student explicitly states they \"didn't make it to a single class,\" were \"not really absorbing anything\" when trying to study, and feel like they \"know nothing at all\" after missing lectures.\n- **Stress:** The student describes a \"sense of dread,\" a \"wave of just *heaviness*,\" and that the thought of deadlines \"just makes my stomach clench,\" leading to feeling \"overwhelming\" and \"completely drowning.\"\n- **Happy:** The student's overall tone is one of \"dread\" and \"ugh,\" with the only respite being feeling \"a little bit normal\" and having a \"clear\" head at the boathouse, not true happiness.\n- **Sleep:** The student explicitly states their \"sleep schedule is completely messed up\" and that they \"can't get myself to wake up for anything important,\" indicating severe disruption and poor quality.\n- **Social:** The student avoided all classes because \"the thought of facing people... felt too much\" and retreated to a non-dorm location (\"6 Maynard Street\") as \"the only place I could be,\" indicating significant social withdrawal."}
{"week": 8, "emotion": {"stamina": 15, "knowledge": 85, "stress": 95, "happy": 40, "sleep": 10, "social": 55}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 8}, "weekly_desc": "Okay, another week gone. It feels like they just blur into each other sometimes, especially when I look back and try to figure out what actually happened. My mood tracker says I'm pretty happy, like an 8, which is... good? I guess? But honestly, there's this constant hum of anxiety under everything, especially when I think about classes.\n\nSpeaking of classes, this week was a bit of a disaster on that front. I didn't make it to any of them. Not BIOL, not COSC 050, not COSC 065. I know, I know. It's ridiculous. I'd wake up, or rather, *not* wake up, and then the thought of getting ready and going just felt like too much. Or I'd be up super late, like that one night I was at Sudikoff trying to get something done for COSC, and then the morning just hits you like a brick wall. I feel like I understand the material, my knowledge score is high, but actually *showing up* and *doing* the work on time? That's where I completely fall apart. It's so frustrating because I *want* to do well, but the motivation just evaporates when it's time to actually execute.\n\nAnd the deadlines! Oh my god, the deadlines. There are so many coming up. Sunday had two, Monday had four, Tuesday has five. Just looking at that list makes my stomach clench. I tried to get some stuff done, like that late night at Sudikoff on Monday, but it feels like I'm always playing catch-up. I spent a lot of time at Parker House or Goldstein, just... existing. And 6 Maynard Street, too. It's nice to have places to just chill, but I know I should have been in class.\n\nMy sleep schedule is completely messed up. I was up at 2 AM, 3 AM, 4 AM multiple times this week, sometimes at the Boathouse, sometimes just wandering around, or at 6 Maynard. Then I'd crash for hours. It's probably why I can't get myself out of bed for morning classes. I love being by the water at the Boathouse, it's a good escape, and hanging out at 6 Maynard is always chill. I guess those are my social outlets, which is fine, but I wonder if they're also contributing to the chaos. My social score is average, which feels about right. I'm not a huge party person, but I like having a few places to go.\n\nThe biggest challenge is definitely getting myself to be more disciplined. I feel this immense pressure from all the assignments piling up, and it just makes me want to avoid everything even more. It's a vicious cycle. I feel happy when I'm not thinking about it, but the second I do, the anxiety just floods in.\n\nFor next week, I *have* to do better. My main goal is to actually attend my classes. All of them. Even if I'm tired, I need to just get myself there. I also need to try and fix my sleep schedule. No more 4 AM adventures, hopefully. And I need to start tackling those deadlines *before* the last minute. I know I have the knowledge, I just need to figure out how to actually apply it consistently. It feels overwhelming, but I have to try.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: 15 - The student states \"the thought of getting ready and going just felt like too much\" and \"the motivation just evaporates when it's time to actually execute,\" indicating very low energy and drive. They also mention \"the morning just hits you like a brick wall\" after late nights.\n- **Knowledge**: 85 - The student explicitly states, \"I feel like I understand the material, my knowledge score is high\" and \"I know I have the knowledge,\" indicating strong confidence in their academic understanding.\n- **Stress**: 95 - The student describes \"this constant hum of anxiety,\" \"the deadlines! Oh my god, the deadlines,\" and that looking at the list \"makes my stomach clench.\" They also feel \"immense pressure\" and that \"the anxiety just floods in,\" making them feel \"overwhelming.\"\n- **Happy**: 40 - While the student reports \"My mood tracker says I'm pretty happy, like an 8,\" they immediately question it (\"good? I guess?\"). They also clarify that they \"feel happy when I'm not thinking about it,\" suggesting a conditional and fragile happiness, overshadowed by pervasive anxiety. They find some \"chill\" moments in specific places, but it's not a deep, stable happiness.\n- **Sleep**: 10 - The student directly states, \"My sleep schedule is completely messed up,\" detailing being \"up at 2 AM, 3 AM, 4 AM multiple times\" and struggling to \"get myself out of bed for morning classes.\"\n- **Social**: 55 - The student explicitly says, \"My social score is average, which feels about right.\" They mention having \"places to just chill\" like Parker House, Goldstein, Boathouse, and 6 Maynard Street, which they identify as \"social outlets,\" indicating a moderate level of social engagement."}
{"week": 9, "emotion": {"stamina": 5, "knowledge": 70, "stress": 98, "happy": 15, "sleep": 5, "social": 25}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 9}, "weekly_desc": "Okay, another week gone. And honestly, it feels like it just… happened. Like I was floating through it, barely touching down. My head feels so heavy, and my eyes are just burning. Sleep, or the lack of it, is really starting to catch up to me. I mean, ten hours for the whole week? That's just not sustainable. I keep telling myself I'll get to bed earlier, but then it's suddenly 2 AM and I'm still trying to figure out that COSC problem or just staring at the ceiling. I remember being at Parker House super late, and then the boathouse? What was I even doing there at 2 AM on Friday? It's all a blur.\n\nAnd because of that, everything else just feels like it's crumbling. I missed so many classes this week. *All* of them, actually. BIOL, COSC 050, COSC 065… every single one. I was just… not there. Or I was in my dorm, or at that private residence on Maynard, just trying to exist. The thought of going to class, sitting there, trying to absorb information when my brain feels like static, it just felt impossible. The guilt is eating at me, though. I know I *should* be there. I know I'm paying for these classes. It's just so hard to drag myself out of bed, let alone focus. My stamina is practically non-existent.\n\nIt's weird, because I feel like I *know* a lot of the material, or at least I did before this week. But now, with all the missed lectures, I feel like I'm falling behind, and that just makes the anxiety worse. There are so many deadlines coming up – Sunday, Monday, Tuesday, it's just a constant wave. I spent some time at Sudikoff trying to catch up on Saturday night, and then again on Tuesday, but it feels like I'm just treading water.\n\nI did manage to get out a bit, which was nice, I guess. Saw a movie at the Nugget, and then went to the Hopkins Center for something. And the Sphinx Society, that was… interesting. It's good to have those moments, to feel like a normal person for a bit, but even those feel like they drain me more than they recharge me. My social battery is just so low. I try to be agreeable and present, but inside, I'm just screaming for a quiet corner.\n\nThis cycle of not sleeping, missing classes, feeling guilty, and then getting more anxious about the deadlines is just… a lot. I feel like I'm constantly on the verge of tears, or just completely numb. My happiness is definitely taking a hit.\n\nNext week, I *have* to do better. My main goal is just to *show up*. To every single class. Even if I just sit there and absorb a fraction of it, it's better than nothing. And sleep. I need to prioritize sleep. Maybe if I get more sleep, I'll have the energy to actually go to class, and then maybe I won't feel so overwhelmed by everything. I need to break this cycle. I just don't know how yet. It feels like a mountain right now.", "judge_reasoning": "```\n\nReasoning:\n- **Stamina**: The student explicitly states, \"My stamina is practically non-existent,\" and mentions feeling \"drained\" even by social activities, indicating extremely low physical and mental energy.\n- **Knowledge**: The student feels they \"know a lot of the material, or at least I did before this week,\" suggesting a foundational understanding. However, they also express feeling \"falling behind\" due to \"all the missed lectures\" and an inability to \"absorb information when my brain feels like static,\" indicating a current struggle with learning and retention.\n- **Stress**: The student describes \"the guilt is eating at me,\" \"anxiety worse,\" and a \"constant wave\" of deadlines, feeling like they are \"just treading water\" and \"on the verge of tears,\" all pointing to extremely high stress levels.\n- **Happy**: The student directly states, \"My happiness is definitely taking a hit,\" and describes feeling \"constantly on the verge of tears, or just completely numb,\" indicating very low emotional well-being.\n- **Sleep**: The student reports an alarming \"ten hours for the whole week,\" mentions being up until \"2 AM,\" and states that \"sleep, or the lack of it, is really starting to catch up to me,\" signifying severe sleep deprivation.\n- **Social**: The student explicitly says, \"My social battery is just so low,\" and notes that social moments \"drain me more than they recharge me,\" and they are \"screaming for a quiet corner,\" despite some engagement, indicating a negative and exhausting social experience."}
{"week": 10, "emotion": {"stamina": 5, "knowledge": 70, "stress": 100, "happy": 15, "sleep": 5, "social": 25}, "lab_assessment": {"score": 0, "max_score": 0, "topic": "No exam this week", "correct_answers": 0, "total_questions": 0, "week": 10}, "project": {"score": 29.0, "full_text_response": "29/30"}, "weekly_desc": "This week felt like a blur, honestly. Mostly a blur of anxiety and exhaustion. My head feels so heavy, and my eyes just want to stay closed. Looking back, it's pretty clear why.\n\nI didn't make it to a single class this week. Not one. BIOL, COSC 050, COSC 065 – all of them just… passed by while I was either still in my dorm at Goldstein Hall or back at 6 Maynard. It's this awful feeling, knowing I *should* be there, knowing I'm paying for it, and just not being able to drag myself out of bed. The guilt is a constant hum in the background, making it even harder to focus on anything else. My conscientiousness is clearly in the gutter right now.\n\nThe main reason, I think, is the Boathouse. I was there so late, or so early, almost every night. Thursday, Friday, Saturday – 1 AM, 2 AM, even 3 AM. It's intense, and it completely wrecks my sleep schedule. My sleep stat is at a 5, and honestly, it feels generous. My stamina is also at a 5, which makes sense because I'm just running on fumes. It's hard to feel happy when you're this tired and stressed, so that 15 for happiness isn't surprising.\n\nEven though I'm at the Boathouse, my social score is still pretty low. I'm not really out there socializing much beyond the immediate activity. I tend to keep to myself, and when I'm this drained, the thought of engaging with people just feels like too much. I just want to retreat into my own space.\n\nThe knowledge stats are high, which is weird, because I feel like I'm absorbing nothing right now. Maybe it's just raw intelligence, but it's not translating into actual academic engagement. I know the material is there, but getting myself to *do* anything with it is the problem.\n\nAnd then there are the deadlines. So many deadlines. Sunday, Monday, Tuesday, Wednesday, Thursday, Saturday. It's just a wall of assignments, and I haven't even started on most of them. The thought of it makes my stomach clench. It's this constant, overwhelming dread that just paralyzes me. My neuroticism is definitely through the roof.\n\nI keep wondering if there's a better way to manage all this. I mean, I *want* to do well. I want to be a good student. I feel bad for not being present, for potentially letting myself down, or even my professors. It's just that the energy isn't there.\n\nFor next week, I *have* to get to class. That's the absolute top priority. I need to figure out how to balance the Boathouse with my academics, or something's going to break. I also desperately need to catch up on sleep. Maybe if I can get a few solid nights of rest, I'll have the stamina to actually tackle those deadlines. I need to try and organize my time better, even though the thought of it feels impossible right now. Just one step at a time, I guess. Just one step.", "judge_reasoning": "```\n\nReasoning:\n-   **Stamina**: The student explicitly states, \"My stamina is also at a 5, which makes sense because I'm just running on fumes.\" They also mention \"exhaustion,\" \"not being able to drag myself out of bed,\" and \"the energy isn't there.\"\n-   **Knowledge**: The student notes, \"The knowledge stats are high, which is weird, because I feel like I'm absorbing nothing right now.\" This indicates their inherent knowledge base or potential remains high (consistent with the previous 70), even if their current engagement is low. They also state, \"I know the material is there.\"\n-   **Stress**: The student describes their state as \"a blur of anxiety,\" mentions \"The guilt is a constant hum,\" and explicitly states, \"It's hard to feel happy when you're this tired and stressed.\" They are overwhelmed by \"So many deadlines,\" which causes their \"stomach clench\" and \"constant, overwhelming dread that just paralyzes me.\" They conclude, \"My neuroticism is definitely through the roof.\"\n-   **Happy**: The student directly states, \"It's hard to feel happy when you're this tired and stressed, so that 15 for happiness isn't surprising.\"\n-   **Sleep**: The student explicitly states, \"My sleep stat is at a 5, and honestly, it feels generous.\" They detail staying up until \"1 AM, 2 AM, even 3 AM\" and confirm it \"completely wrecks my sleep schedule.\"\n-   **Social**: The student confirms, \"Even though I'm at the Boathouse, my social score is still pretty low.\" They explain this by saying, \"I'm not really out there socializing much beyond the immediate activity. I tend to keep to myself, and when I'm this drained, the thought of engaging with people just feels like too much. I just want to retreat into my own space.\""}
